[{"id":13145216,"created_at_i":1481370092,"type":"story","author":"privong","title":"LIGO black hole echoes hint at general-relativity breakdown","url":"http://www.nature.com/news/ligo-black-hole-echoes-hint-at-general-relativity-breakdown-1.21135","text":null,"points":254,"children":[{"id":13147417,"created_at_i":1481398246,"type":"comment","author":"WhitneyLand","text":"<p>No aspersions here. I&#x27;m keeping the faith, but can anyone recall what these allude to?</p><p>1) Utah has solved the energy crisis on a table top with deuterium</p><p>2) That bump in the collider data is looking pretty odd</p><p>3) Remind your child to chelate if the autism acts up</p><p>4) Wow those neutrinos are moving so fast</p><p>5) Bigotry can stop if we&#x27;d go door to door and talk about it</p><p>6) Arsenic can kill but it enables growth for at least one family</p><p>7) This theory will be perfect if we get rid of Λ</p><p>In all fairness, this topic is a little different because we know for sure something big has to happen eventually to reconcile QM&#x2F;Gravity.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13145649,"created_at_i":1481378250,"type":"comment","author":"vanderZwan","text":"<p>&gt; <i>The echoes could be a statistical fluke, and if random noise is behind the patterns, says Afshordi, then the chance of seeing such echoes is about 1 in 270, or 2.9 sigma. To be sure that they are not noise, such echoes will have to be spotted in future black-hole mergers. “The good thing is that new LIGO data with improved sensitivity will be coming in, so we should be able to confirm this or rule it out within the next two years.”</i></p><p>Can I take a moment to commend the level-headed non-hype of this paragraph? It gives the impression that their first priority is finding the &quot;truth&quot; (I know, I know; I&#x27;m using it as a shorthand), not whatever they <i>want</i> to be confirmed. Gives the research much more credibility.</p><p>I mean, I know it&#x27;s Nature so we should expect it, but it&#x27;s still nice to see.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13148088,"created_at_i":1481405985,"type":"comment","author":"Animats","text":"<p>There was a time when Nature was a highly respected publication. Now, their headlines are at tabloid level.</p>","points":null,"parent_id":13145649,"story_id":13145216,"children":[{"id":13151055,"created_at_i":1481464285,"type":"comment","author":"im3w1l","text":"<p>TFA is in &quot;news &amp; comments&quot; rather than &quot;research&quot; (which is the respected part).</p>","points":null,"parent_id":13148088,"story_id":13145216,"children":[]},{"id":13149595,"created_at_i":1481430446,"type":"comment","author":"mturmon","text":"<p>It&#x27;s a for-profit publication, and I agree -- sometimes it shows.</p>","points":null,"parent_id":13148088,"story_id":13145216,"children":[]}]},{"id":13146092,"created_at_i":1481384351,"type":"comment","author":"wyager","text":"<p>It&#x27;s actually a bit hyped for particle physics. It ignores the fact that you&#x27;re very likely to see a lot of &quot;significant&quot; effects in physics because there are tens of thousands of data analyses performed every year, so we&#x27;re bound to find some chance occurrences at this significance level. See the diphoton excess a few years ago.</p><p>This is why the particle physics community has a very strict unofficial standard of 5 sigma for significance. People don&#x27;t generally publish &quot;serious&quot; papers at 3 sigma.</p>","points":null,"parent_id":13145649,"story_id":13145216,"children":[{"id":13146168,"created_at_i":1481385154,"type":"comment","author":"vanderZwan","text":"<p>You&#x27;re right, of course - while not a particle physicist, I know about the sigma standards, and mistakenly assumed others would see the &quot;2.9 sigma&quot; and immediately knew what that implied.</p>","points":null,"parent_id":13146092,"story_id":13145216,"children":[{"id":13146386,"created_at_i":1481387536,"type":"comment","author":"pushtheenvelope","text":"<p>it wasn&#x27;t obvious to this layman. thanks for clarifying.</p>","points":null,"parent_id":13146168,"story_id":13145216,"children":[]}]},{"id":13146684,"created_at_i":1481390617,"type":"comment","author":"roywiggins","text":"<p>We&#x27;ve only observed a small handful of black hole collisions though so seeing something at 2.9 sigma would be somewhat more surprising, right? Definitely not rising to the level of a discovery yet of course.</p>","points":null,"parent_id":13146092,"story_id":13145216,"children":[{"id":13147185,"created_at_i":1481395853,"type":"comment","author":"maxander","text":"<p>Only a small handful of observations (only one, last I heard, but I may be out of date), but lots and lots of <i>analyses.</i>  And for every scientist that has their own model and does their own data processing, there&#x27;s a chance that the model lines up with some arbitrary noise in the data.</p>","points":null,"parent_id":13146684,"story_id":13145216,"children":[{"id":13147779,"created_at_i":1481402371,"type":"comment","author":"lamontcg","text":"<p>You also have to add in that once these experimental results were released that a hundred or so theoretical physicists immediately started working on massaging the data into supporting their pet theories.  After every anomalous result there&#x27;s immediately hundreds of published papers by someone trying to simply be the first to publish in case their idea happens to pan out.  It is a kind of shotgun approach to winding up being the next Dirac discovering the positron from math or whatever.</p><p>Since there&#x27;s 99 other PhDs who probably looked at this data and found their pet theories didn&#x27;t match the data and haven&#x27;t been able to publish you have to account for that filtering effect that this was the 1-in-100 paper that managed to match the data.  Adding that &quot;Look Elsewhere Effect&quot; to the 2.9 sigma would push the global significance (in the literal sense of global -- meaning all the research teams across the whole world) of this result down into meaninglessness.</p><p>Of course its likely that any discovery would start out looking like something on the edge of significance exactly like this.  The safe bet is that this disappears, but all we can do is wait for more data to come in and see if the significance improves or disappears.</p><p>And I do really hope that someone finds something like this via the LIGO data.  I&#x27;m convinced there&#x27;s something very interesting out there to find, and sooner or later it should pop up experimentally and shake up our model of the universe.</p>","points":null,"parent_id":13147185,"story_id":13145216,"children":[{"id":13149933,"created_at_i":1481439002,"type":"comment","author":"jdmichal","text":"<p>Yes, this is basically a distributed version of the issues discussed in psychology regarding researcher degrees of freedom with a single data set. If you throw enough models at the data, one of them is bound to stick, whether it is predictive or not.</p>","points":null,"parent_id":13147779,"story_id":13145216,"children":[]}]}]}]},{"id":13147372,"created_at_i":1481397873,"type":"comment","author":"BurningFrog","text":"<p>I assume one reason for that high standard is that particle physics experiments are repeatable and can be observed with very high precision.</p><p>None of that is true of LIGO observations of black hole collisions.</p>","points":null,"parent_id":13146092,"story_id":13145216,"children":[]},{"id":13147385,"created_at_i":1481397942,"type":"comment","author":"eximius","text":"<p>yea, 1 in 270 seems fairly likely given the circumstances.</p>","points":null,"parent_id":13146092,"story_id":13145216,"children":[]}]}]},{"id":13149244,"created_at_i":1481423137,"type":"comment","author":"maverick_iceman","text":"<p>2.9 sigma is hardly evidence of anything in fundamental physics. There was a 4 sigma evidence of diphoton excess from ATLAS and CMS last year which went away this year. 3-4 sigma discrepancies come and go. It&#x27;s not for nothing that physicists have the discovery criteria set at 5 sigma.</p><p>What&#x27;s more, one should be extremely skeptical when observations seem to violate long held physical theories. The superluminal neutrinos from OPERA ostensibly had &gt;5 sigma evidence but nobody (correctly) took it seriously as it violated special relativity. Unsurprisingly, it was ultimately traced to a loose GPS cable.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13147709,"created_at_i":1481401520,"type":"comment","author":"lamontcg","text":"<p>The breathlessness of this article is fairly annoying.</p><p>LIGO wasn&#x27;t really setup to confirm GR around black holes. It was designed to study highly energetic, high-curvature gravitational phenomena where it would be expected that there might be deviations from GR.  Measuring deviations from GR predictions is exactly why you&#x27;d built the experiment and isn&#x27;t &quot;ironic&quot; at all (and not even in the Alanis Morrissette sense since finding something new would be more like having a party on your wedding day rather than raining on it).</p><p>GR is also fully expected to break down at the central singularity of a black hole.  The curvature of space-time become infinite there with infinite force. At the very least its expected that quantum gravity would smear this out.</p><p>The problem of black hole entropy at the event horizon of the black hole has also been known for decades and is one of the drivers behind doing research like LIGO.  The &quot;firewall&quot; problem is recently all the rage in the west coast theoretical community, but its been known for some time that we can&#x27;t make sense of black hole entropy entirely classically with GR, so that finding non-GR effects near the event horizon is at least hoped-for, if not expected, and LIGO is precisely the kind of experiment that could shed light on that.</p><p>Its legitimately very exciting, but its the result of methodically grinding away at a very hard problem for decades.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13145450,"created_at_i":1481374671,"type":"comment","author":"guard-of-terra","text":"<p>It&#x27;s weird that they had the idea of firewall just in 2012. I had this exact idea maybe ten years prior while being a school student. A fairly obvious one if you think of that - some photons will orbit the black hole.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13145487,"created_at_i":1481375323,"type":"comment","author":"privong","text":"<p>&gt; A fairly obvious one if you think of that - some photons will orbit the black hole.</p><p>That some photons would orbit black holes is fairly well-known. There&#x27;s an &quot;innermost stable circular orbit&quot;[0] (&quot;photon sphere&quot; for rotating black holes [1]), inside which stable (circular) orbits do not exist. These are at larger radii than the event horizon and so would be unrelated to the firewall proposal.</p><p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Innermost_stable_circular_orbit\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Innermost_stable_circular_orbi...</a></p><p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Photon_sphere\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Photon_sphere</a></p>","points":null,"parent_id":13145450,"story_id":13145216,"children":[]},{"id":13145492,"created_at_i":1481375458,"type":"comment","author":"zeroer","text":"<p>Where photons orbit a black hole is called a Photon Sphere.</p><p><a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Photon_sphere\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Photon_sphere</a></p><p>It&#x27;s at 1.5 times the radius of the event horizon for a non-charged, non-rotating black hole. But it&#x27;s more of a theoretical than practical construct.  You wouldn&#x27;t expect to actually find any photons there because the orbit is unstable and any deviance from a perfect orbit would accumulate exponentially.</p>","points":null,"parent_id":13145450,"story_id":13145216,"children":[]},{"id":13145503,"created_at_i":1481375645,"type":"comment","author":"danbruc","text":"<p>Photons orbit the black hole in the photon sphere which is located outside of the event horizon, at 1.5 times the Schwarzschild radius in case of a Schwarzschild black hole. As far as I know such orbits are also usually not stable. For a photon to orbit the black hole in the photon sphere it has to move tangentially, to reach the photon sphere the photon needs to move with at least some radial component and a photon can of course not just fire its rockets when reaching the photon sphere to enter the orbit. The idea of the firewall is very different from the idea of photons orbiting a black hole which was studied a long time ago.</p>","points":null,"parent_id":13145450,"story_id":13145216,"children":[{"id":13145535,"created_at_i":1481376282,"type":"comment","author":"david-given","text":"<p>Wouldn&#x27;t you get orbiting photons simply by having them emitted from falling bodies, i.e. hot gas?</p><p>Any photons emitted in the right direction by incoming material in the right place would enter an orbit; and given that hot material emits photons in all directions continuously, and there&#x27;s a steady supply of infalling material, there&#x27;s going to be a continuous source of orbiting photons.</p>","points":null,"parent_id":13145503,"story_id":13145216,"children":[{"id":13145597,"created_at_i":1481377390,"type":"comment","author":"danbruc","text":"<p>IANAP so don&#x27;t take my word for it, but I would assume the photons would have to be emitted EXACTLY tangentially at EXACTLY the photon sphere. Just a tiny bit earlier or later or with a tiny bit of radial momentum and the photon would eventually escape or fall into the black hole. And a real black hole is not a perfect Schwarzschild black hole, it will almost certainly have at least some charge or angular momentum, surrounding matter will change the metric somewhat. But I can not tell whether that makes it more or less likely for a photon to stay in orbit but I tend towards less likely because this seems to add more possibilities to randomly push the photon out of its orbit one way or another.</p>","points":null,"parent_id":13145535,"story_id":13145216,"children":[{"id":13147181,"created_at_i":1481395812,"type":"comment","author":"Retra","text":"<p>All orbits should &#x27;eventually&#x27; decay as more matter comes in and perturbs the orbit. Stability is a matter of how quickly it decays, not <i>if</i> it decays.</p>","points":null,"parent_id":13145597,"story_id":13145216,"children":[{"id":13147597,"created_at_i":1481400277,"type":"comment","author":"MaulingMonkey","text":"<p>My understanding is that photons are uniquely unstable.  By virtue of traveling at a constant (the speed of light), they lack the self-regulating orbital mechanics of matter (where going deeper into the gravity well speeds you up, and going farther away slows you down.)</p><p>Dealing with spherical cows, before accounting for drag, you can describe the possible space for valid orbits as a volume, and you could describe the bounds of the velocity vector via another volume, for all positions and velocities at those positions that describe - at least on paper - mathematically perfectly stable orbits.</p><p>Dealing with a photonic cow, before accounting for drag, you can describe the possible space for mathematically stable orbits as not a volume but <i>an area</i> - the <i>surface</i> of a sphere.  The velocity vector has a very specific magnitude (c), and a very limited range of possible directions (<i>exactly</i> perpendicular to the normal of the sphere&#x27;s surface).  The shape you would use to describe the bounds of this velocity vector have 0 volume, 0 <i>area</i>.  It only has a <i>length</i>.</p><p>Both cows can be further perturbed by drag, tidal effects, non-point gravity sources, etc. to further worsen the problem.  Individual collisions with particles of space dust will push the spherical cow from one mathematically stable orbit to another, until eventually they add up enough to most likely deorbit it.  Individual collisions with particles of space dust will instead take the <i>photonic</i> cow from one mathematically unstable orbit to another, with a decent chance of it ending up on an escape trajectory instead.</p>","points":null,"parent_id":13147181,"story_id":13145216,"children":[]}]}]}]}]},{"id":13145515,"created_at_i":1481375869,"type":"comment","author":"TheOtherHobbes","text":"<p>It&#x27;s potentially more complicated than that.</p><p>Someone on Reddit asked a brilliant question a while back - what happens to quantum fields at the event horizon?</p><p>In QFT, fields are everywhere. But to support a field, you need a mechanism that allows causal propagation - which is exactly what isn&#x27;t allowed across an event horizon.</p><p>So at the very least you have a discontinuity where three and possibly all four fundamental forces stop working, and which is separate to any hypothetical relativistic singularity.</p><p>Whatever is left is going to be some kind of unimaginably weird sub-quantum soup.</p><p>I don&#x27;t know if that&#x27;s the same firewall that was invented in 2012. But the takeaway is that relativity isn&#x27;t complete enough to model black holes. You absolutely need to include quantum effects - and when you do, things get very strange indeed.</p>","points":null,"parent_id":13145450,"story_id":13145216,"children":[{"id":13147732,"created_at_i":1481401705,"type":"comment","author":"pdonis","text":"<p><i>&gt; to support a field, you need a mechanism that allows causal propagation - which is exactly what isn&#x27;t allowed across an event horizon.</i></p><p>That&#x27;s because the event horizon is a lightlike surface. Causal propagation isn&#x27;t allowed across any lightlike surface. For example, there are lightlike surfaces that contain the event where you are right now. Causal propagation isn&#x27;t allowed across them. Yet QFT works just fine in your vicinity.</p><p>What the Reddit questioner apparently did not realize is that the event horizon is defined globally, not locally. In other words, its location is defined in terms of the global properties of the spacetime, not in terms of any local properties. Locally, the EH is just a lightlike surface, and is no different, from a QFT point of view, from any other lightlike surface.</p>","points":null,"parent_id":13145515,"story_id":13145216,"children":[]},{"id":13145688,"created_at_i":1481378849,"type":"comment","author":"danbruc","text":"<p><i>In QFT, fields are everywhere.</i></p><p>The fields in quantum field theory are mathematical tools, they are not physical entities.</p><p><i>But to support a field, you need a mechanism that allows causal propagation - which is exactly what isn&#x27;t allowed across an event horizon.</i></p><p>But that is only a one-way thing - the future light cones of events inside the event horizon are contained inside the event horizon but the future light cones of events outside the event horizon certainly overlap the inside of the black hole.</p>","points":null,"parent_id":13145515,"story_id":13145216,"children":[{"id":13146393,"created_at_i":1481387611,"type":"comment","author":"evanb","text":"<p>Can you explain what you mean by</p><p>&gt; The fields in quantum field theory are mathematical tools, they are not physical entities.</p><p>If you mean that the world itself is not the mathematics then I can accept it (although I might resist, the philosophical rejection of things like Tegmark&#x27;s Mathematical Universe Hypothesis), but if you mean that what we actually have is a bunch of particles doing one thing or another, I must object, because it is extremely difficult to explain nonperturbative phenomena like instantons or sphaelerons if you have that attitude.</p>","points":null,"parent_id":13145688,"story_id":13145216,"children":[{"id":13146532,"created_at_i":1481389189,"type":"comment","author":"danbruc","text":"<p>Quantum fields have gauge symmetry so they do not have any definite values, you can assume them to have more or less any value as long as you are consistent. My views on this topic are heavily influenced by Nima Arkani-Hamed and here [1] are 30 seconds from a lecture where he is very explicit about this. But I am aware that this is not really a topic with universal agreement, at least this is what it looks to a non-physicist like me. And looking at your user profile I am pretty sure you are going to tell me that I am asking for to much realism.</p><p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=tnA7bh7dTqY&amp;t=1669\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=tnA7bh7dTqY&amp;t=1669</a></p>","points":null,"parent_id":13146393,"story_id":13145216,"children":[]}]},{"id":13145756,"created_at_i":1481380029,"type":"comment","author":"vanderZwan","text":"<p>&gt; The fields in quantum field theory are mathematical tools, they are not physical entities.</p><p>Still, they only maintain physical relevance as long as they are continuous, no? Otherwise you literally have a break in reality.</p>","points":null,"parent_id":13145688,"story_id":13145216,"children":[{"id":13146343,"created_at_i":1481387041,"type":"comment","author":"guitarbill","text":"<p>&gt; a break in reality.</p><p>Such as a singularity (e.g. gravitational)? I think in Physics (just as when analysing functions), the interesting things happen when you approach such limits.</p>","points":null,"parent_id":13145756,"story_id":13145216,"children":[]},{"id":13145847,"created_at_i":1481381358,"type":"comment","author":"danbruc","text":"<p>Do you mean that they can not have holes?</p>","points":null,"parent_id":13145756,"story_id":13145216,"children":[]}]}]},{"id":13146213,"created_at_i":1481385576,"type":"comment","author":"raattgift","text":"<p>That&#x27;s a neat way of putting it (at least broadly) in the first four pargaraphs.  Thanks.</p><p>I&#x27;d add that the event horizon is the boundary below which the propagators of causality can <i>only</i> move further below the horizon itself.</p><p>The &quot;unimaginably weird sub-quantum&quot; part doesn&#x27;t follow from those paragraphs, though, in the region <i>outside</i> the event horizon, or even a little ways inside.   It is however a fair way of describing the problem of the singularity; the goal of nearly all quantum gravity research programmes is keeping the singularity from ever existing, and &quot;weird microscopic behaviour&quot; is a reasonable way of describing what that may entail.</p><p>I made some comments relevant to your last paragraph elsewhere in this discussion.</p>","points":null,"parent_id":13145515,"story_id":13145216,"children":[]}]},{"id":13146318,"created_at_i":1481386777,"type":"comment","author":"losvedir","text":"<p>Perhaps, then, you should consider that you&#x27;re misunderstanding the situation? A firewall is not &quot;orbiting photons&quot;. See <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Firewall_(physics)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Firewall_(physics)</a>.</p>","points":null,"parent_id":13145450,"story_id":13145216,"children":[]}]},{"id":13147262,"created_at_i":1481396683,"type":"comment","author":"m_mueller","text":"<p>I&#x27;ve had this idea in my mind how Black Holes could be connected to universe generation. It came about when I learned that the known universe would be a black hole if its mass was concentrated in the center, i.e. its size is about the same as the event horizon for such a mass.</p><p>Thinking backwards, obviously the universe at some point would have been described as a black hole by GR. Then of course spacetime expansion comes into play, that somehow makes it into not-a-black hole.</p><p>So here is the idea: What if a Big Bang is exactly what happens when matter falls into itself until the original spacetime continuum breaks? I.e. the energy of the original structure forms and gets linked into a new spacetime continuum - part of it as dark energy that expands the new spacetime, part of it as normal energy and matter.</p><p>Is there anything we know makes my idea impossible? If it were true, would there be a chance that we could combine our empirical knowledge of the Big Bang with this new empirical knowledge of gravitational waves to come up with a testable unified theory (i.e. Quantum Gravity)?</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13147676,"created_at_i":1481401167,"type":"comment","author":"pdonis","text":"<p><i>&gt; the known universe would be a black hole if its mass was concentrated in the center</i></p><p>The universe doesn&#x27;t have a &quot;center&quot;. The universe did have a much higher density right after the Big Bang, but it was expanding rapidly; that&#x27;s why it was (and is) not a black hole.</p><p><i>&gt; Is there anything we know makes my idea impossible?</i></p><p>Yes, the fact that it&#x27;s based on a misconception about the universe&#x27;s spacetime geometry. See above.</p><p>There are certainly &quot;bounce&quot; models being considered for what preceded the Big Bang (although they&#x27;re by no means the only models being considered). But they don&#x27;t work like what you are describing.</p>","points":null,"parent_id":13147262,"story_id":13145216,"children":[{"id":13148778,"created_at_i":1481415293,"type":"comment","author":"m_mueller","text":"<p>My point is that the way the universe works, i.e. spacetime expansion, inflation and acceleration (dark energy) could all be governed by processes inside a black hole&#x27;s singularity - something we afaik don&#x27;t have a good model yet. It&#x27;s only a black hole from the reference point of the parent universe. I don&#x27;t mean the old bounce model, more like bubbles around a water hose that get smaller the farther away from the source - i.e a stellar black hole creates a mini universe through its own spacetime rip.</p>","points":null,"parent_id":13147676,"story_id":13145216,"children":[{"id":13149834,"created_at_i":1481436588,"type":"comment","author":"pdonis","text":"<p><i>&gt; My point is that the way the universe works, i.e. spacetime expansion, inflation and acceleration (dark energy) could all be governed by processes inside a black hole&#x27;s singularity</i></p><p>The singularity doesn&#x27;t have an &quot;inside&quot;. See below.</p><p><i>&gt; something we afaik don&#x27;t have a good model yet</i></p><p>The models that are being looked at get rid of the singularity altogether. They don&#x27;t try to model it as being made up of internal parts.</p><p><i>&gt; a stellar black hole creates a mini universe through its own spacetime rip.</i></p><p>Some physicists have considered models in which black holes give birth to &quot;baby universes&quot; (Hawking and Lee Smolin are two that come to mind). But these models don&#x27;t &quot;rip&quot; spacetime; they remove the singularity, which in the standard classical GR model is just a spacelike surface--a moment of time--that represents a boundary of spacetime, and instead just extend the spacetime further on, into the spacetime of the new universe.</p>","points":null,"parent_id":13148778,"story_id":13145216,"children":[]}]}]},{"id":13149378,"created_at_i":1481425531,"type":"comment","author":"lobster_johnson","text":"<p>The idea that the universe is &quot;inside&quot; a black hole in another universe is a pretty old idea, but there have been several papers on it in recent years, such as this one [1], explained here [2], which offers a holographic origin.</p><p>[1] <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1309.1487\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1309.1487</a></p><p>[2] <a href=\"https:&#x2F;&#x2F;www.perimeterinstitute.ca&#x2F;news&#x2F;black-hole-birth-universe\" rel=\"nofollow\">https:&#x2F;&#x2F;www.perimeterinstitute.ca&#x2F;news&#x2F;black-hole-birth-univ...</a></p>","points":null,"parent_id":13147262,"story_id":13145216,"children":[]}]},{"id":13146280,"created_at_i":1481386224,"type":"comment","author":"noobermin","text":"<p>Minor comment from another physicist here, not in this field but from what my friends from this field say, most people expected hints of quantum gravity to come specifically from black holes, so if there is anything new to be learned about GR&#x27;s limits, looking at black holes is the right place to look.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13145521,"created_at_i":1481376005,"type":"comment","author":"nonbel","text":"<p>&gt;&quot;if random noise is behind the patterns, says Afshordi, then the chance of seeing such echoes is about 1 in 270, or 2.9 sigma. To be sure that they are not noise, such echoes will have to be spotted in future black-hole mergers.&quot;</p><p>We are getting closer and closer... So finally we see a correct interpretation of a p-value in the media, but the connection to the following sentence is not clear so I am not sure the meaning was really understood.</p><p>How does spotting more such echos allow us to &quot;be sure they are not noise&quot;, and how does this relate to that 1&#x2F;270 number?</p><p>If the probability of such an observation was 1&#x2F;1.7 million assuming a random noise model (rather than 1&#x2F;270), would that mean we could &quot;be sure it was not noise&quot;? Shouldn&#x27;t that depend on how well the observations could be fit by alternative models?</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13146123,"created_at_i":1481384720,"type":"comment","author":"wyager","text":"<p>You can factor in the expected false positive base rate and the confidence to figure out by how much you should boost your prior expectation of the theory being correct. &quot;Being sure&quot; is shorthand for &quot;having a prior very close to 1 or 0&quot;.</p>","points":null,"parent_id":13145521,"story_id":13145216,"children":[]},{"id":13145758,"created_at_i":1481380066,"type":"comment","author":"danbruc","text":"<p>General relativity makes certain predictions, we now measured a deviation from those predictions assuming a specific model of the source of the observation. So more measurements will help to build up confidence that the deviations are not just measurement errors.</p><p>After that you have to explain those deviations and the two most obvious options are that either the model of the event or the theory itself is wrong or at least not accurate enough to describe the observations. Then you can look for changes to the model, varying masses or the number of objects involved, or maybe even look at entirely different possible source of gravitational waves to explain the observations.</p><p>But if you return with empty hands you will have to take the option serious that a modification of the theory is required. For example if you theory only allows a quantity to decrease monotonically over time but your observations show oscillations, then you have pretty strong evidence that your theory requires modifications.</p>","points":null,"parent_id":13145521,"story_id":13145216,"children":[{"id":13145930,"created_at_i":1481382447,"type":"comment","author":"nonbel","text":"<p>Sure, but if every other explanation is even less likely, random noise is still the best guess.</p>","points":null,"parent_id":13145758,"story_id":13145216,"children":[]}]},{"id":13145767,"created_at_i":1481380216,"type":"comment","author":"Natanael_L","text":"<p>You throw a dice 3 times. It always show 6. How do you know the dice is loaded, and that it wasn&#x27;t a fluke? Repeat the experiment, and see if it starts looking random (pattern disappears) or if the pattern is strengthened (always saying 6).</p>","points":null,"parent_id":13145521,"story_id":13145216,"children":[{"id":13145912,"created_at_i":1481382162,"type":"comment","author":"nonbel","text":"<p>Also, I couldn&#x27;t get the original documents at the time, but you reminded me of this:</p><p>&gt;&#x27;The simplest assumption about dice as random-number generators is that each face is equally likely, and therefore the event “five or six” will occur with probability 1&#x2F;3 and the number of successes out of 12 will be distributed according to the binomial distribution. When the data are compared to this “fair binomial” hypothesis using Pearson’s \u00012 test without any binning, Pearson found a p-value of 0.000016, or “the odds are 62,499 to 1 against such a system of deviations on a random selection.”&#x27;\n<a href=\"https:&#x2F;&#x2F;galton.uchicago.edu&#x2F;about&#x2F;docs&#x2F;2009&#x2F;2009_dice_zac_labby.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;galton.uchicago.edu&#x2F;about&#x2F;docs&#x2F;2009&#x2F;2009_dice_zac_la...</a></p><p>The point is you will always find deviations (with extremely low p-values) if you look hard enough. It is about collecting data as carefully as possible, and determining which model fits best, not which fits perfectly.</p>","points":null,"parent_id":13145767,"story_id":13145216,"children":[{"id":13148897,"created_at_i":1481417047,"type":"comment","author":"GFK_of_xmaspast","text":"<p>&gt; The point is you will always find deviations (with extremely low p-values) if you look hard enough</p><p>I don&#x27;t know how you can get that point from the article instead of &#x27;an 1894-era die is biased but you need a lot of statistical power in order to see that&#x27;.</p>","points":null,"parent_id":13145912,"story_id":13145216,"children":[{"id":13152322,"created_at_i":1481480787,"type":"comment","author":"nonbel","text":"<p>I think the lesson is clear... the more messed up your methods the easier to see the deviation (ie the historical vs modern experiment). Also, where do you get this:</p><p>&gt;&quot;you need a lot of statistical power in order to see that&quot;</p>","points":null,"parent_id":13148897,"story_id":13145216,"children":[]}]}]},{"id":13145850,"created_at_i":1481381405,"type":"comment","author":"nonbel","text":"<p>For a rational person, it depends who gave you the dice. It sounds like you just put a low prior on dice being loaded since you are so used to getting well made dice from neutral parties...</p>","points":null,"parent_id":13145767,"story_id":13145216,"children":[]}]}]},{"id":13146297,"created_at_i":1481386429,"type":"comment","author":"daxfohl","text":"<p>&quot;The most exciting phrase to hear in science, the one that heralds new discoveries, is not &#x27;Eureka!&#x27; but &#x27;That&#x27;s funny...&#x27; &quot; -- Isaac Asimov</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13146298,"children":[]},{"id":13148090,"created_at_i":1481405995,"type":"comment","author":"hanso","text":"<p>They&#x27;re hopelessly out of their depth. This kind of talk makes zero sense</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13148614,"created_at_i":1481413111,"type":"comment","author":"wfunction","text":"<p>Does any layman expect GR <i>NOT</i> to break down? To me it&#x27;s intuitively only correctly describing emergent phenomena in the limiting case of large scales; it&#x27;s bound to be less accurate than something that is correct on small scales.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13145548,"created_at_i":1481376509,"type":"comment","author":"ThePhysicist","text":"<p>Personally, I would not be surprised if we discover that our understanding of general relativity is wrong for extreme values (i.e. very high mass densities). The whole problem of dark energy and dark matter -which has failed to show up in any conceivable form so far- also gives reason to doubt the validity of our current theory of gravitation.</p><p>I think we&#x27;re in a similar situation like at the end of the 19th century, were many physicists thought that everything that could be discovered already was, apart from some &quot;edge phenomena&quot; that would need to be resolved somehow using the current theories. In the end, these edge cases turned out to be the first hints of some completely new theories that dramatically improved our understanding of nature. I think that gravity and quantum mechanics are due for a similar change, and in the coming decades we might just get the data that we need to make this change happpen.</p><p>I also have difficulties &quot;buying&quot; the current theory of black hole physics, especially the concepts of an event horizon and the infinite mass density, as well as the problems which arise from them (e.g. black hole energy evaporation through virtual particle generation at the horizon). And as previous theories of gravitation have broken down at points of extreme value (high energy, high speed), I think black holes are a hot candidate for breaking general relativity.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13146136,"created_at_i":1481384849,"type":"comment","author":"raattgift","text":"<p>There&#x27;s plenty of hot dark matter coursing right through you  right now !</p><p>Fermi -&gt; Wang Ganchang -&gt; Harrison, Kruse &amp; McGuire took a while.   I wouldn&#x27;t expect a quick detection of something with the properties of a WIMP, as I would expect any such particle to be even harder to detect than a neutrino, especially if it doesn&#x27;t feel the weak nuclear force.</p><p>I don&#x27;t know why you think that dark energy has failed to show up in any conceivable form -- how do you explain the cosmological redshift without it?   Dark energy in its simplest form is just the cosmological constant, and can be an inertial effect.</p><p>In any case, even if the concordance cosmology is simply <i>wrong</i>, that does not mean that GR is incorrect as much as we are wrong about the mechanisms that generate the metric (Afshordi, one of the authors of the paper at the top, has proposed non-universal coupling to the single metric of GR), or alternatively we are wrong about the way we choose and stitch together metrics (i.e., we&#x27;re misusing GR in a way that introduces serious errors at long length scales).</p><p>Do you really think there are working scientists who think that there&#x27;s nothing more to discover?   Conversely, are there many who deny that the huge preponderance of evidence we have so far favours the Standard Model and General Relativity?   Even if we &quot;demote&quot; SM and GR to effective field theories, the effective limit of each is very nearly everywhere readily accessible, isn&#x27;t it?</p><p>Buying the BH singularity would be, I think, a pretty extreme position.  Every viable post-GR effort I know about is to some extent focused on abolishing singularities somehow.  (You could alternatively keep them always hidden and resolve things like BH thermodynamics; if you always keep information locked up in another region of spacetime -- behind a horizon -- there&#x27;s no information loss problem to consider, and you can &quot;cut&quot; singularities out of the manifold recovering everywhere-smoothness.  But black holes might evaporate completely in the far de Sitter like future.)</p><p>Not buying an event horizon in a system of local physics with a maximum propagation of local state from one point to another seems even more extreme.   The existence of a maximum local speed -- whatever it is, it could be much faster than light -- sets the slope of a nonempty open convex cone of tangent vectors (a causal cone at each point for the field-values at that point) which in turn lets us fix a first order quasilinear system of PDEs admitting a hyperbolization, and in that you can always find an observer that sees an event horizon.</p><p>The formation of the BH creates a dynamical spacetime with an acceleration between observers before and after the collapse, and that alone is sufficient to produce an event horizon.</p><p>Abolishing &#x27;c&#x27; (as a general free parameter defined at every point; the definition can even vary by location in spacetime) seems a lot harder to swallow than abolishing event horizons.   If you accept &#x27;c&#x27;, then while Schwarzschild event horizons is pretty easy (nonzero J or not-always-zero Q at all physical compact dense objects, for example), abolishing <i>all</i> event horizons requires a lot of contortions to avoid immediate conflict with local experiment, much less astrophysical observation.</p>","points":null,"parent_id":13145548,"story_id":13145216,"children":[{"id":13147970,"created_at_i":1481404779,"type":"comment","author":"ThePhysicist","text":"<p>&gt; There&#x27;s plenty of hot dark matter coursing right through you right now !</p><p>That statement is exactly the problem as I see it, as dark matter is an attempt to save an existing paradigm using a trick that makes use of unknown but conceptually understandable matter.</p><p>The same was and is true for Einstein&#x27;s cosmological constant: It&#x27;s a hack that was necessary to make a theory match with the observations.</p><p>Introducing hypothetical&#x2F;imvisible matter to make a theory fit observations does not mean that this matter really exists.</p><p>I did not say that scientists think that there is nothing more to discover, just that there is a tendency to try to fix up existing theories instead of accepting that they might be wrong. I&#x27;m no expert in particle physics or relativity (my field is quantum mechanics), so I&#x27;m not able to judge the merit of different theories involving dark matter, I&#x27;m just not convinced that dark matter &#x2F; dark energy is real. If anyone shows me compelling experimental evidence I&#x27;ll be happy to change my mind.</p><p>So far we haven&#x27;t seen any convincing arguments for the existence of dark energy or dark matter though, and I think there&#x27;s a chance that they end up as the 21st century equivalent of the &quot;ether&quot;.</p>","points":null,"parent_id":13146136,"story_id":13145216,"children":[{"id":13149013,"created_at_i":1481418935,"type":"comment","author":"ggreer","text":"<p>I&#x27;m pretty sure raattgift was referring to neutrinos when he said hot dark matter was &quot;coursing right through you&quot;. He wasn&#x27;t assuming the existence of any speculative form of dark matter.</p>","points":null,"parent_id":13147970,"story_id":13145216,"children":[{"id":13150602,"created_at_i":1481455690,"type":"comment","author":"raattgift","text":"<p>Yes.   &quot;Hot&quot; because neutrinos move quickly compared to the speed of light, &quot;dark&quot; because they do not feel electromagnetism, and &quot;matter&quot; because they couple to the metric.</p><p>They explain the anomalous momentum in beta decays, among other things, and are still difficult to detect.</p><p>To explain the anomalous momentum we infer around large scale structures at z &lt;&lt; 1, it&#x27;s pretty reasonable to consider neutrinos or neutrino-like particles that are &quot;cold&quot; -- moving slowly compared to the speed of light, thus more likely to &quot;hang around&quot; in a region of spacetime instead of quickly running away to infinity.   Although they interact very weakly with matter, they still impart momentum, so hot dark matter would tend to smear apart gas clouds rather than encouraging them to collapse into denser objects like stars.  Likewise, it is perfectly reasonable to search for them in ways analogous to how the neutrino itself was searched for experimentally and observationally, and like with the first detection of the neutrino, it is liable to take time to detect or let various non-detections exclude all the regions of the particle mass vs nucleon cross-section parameter space.</p><p>Moreover, the search for this sort of cold dark matter does not preclude concurrent searches for other possibilities.</p><p>So I can&#x27;t agree with ThePhysicist that there is a problem here, other than that there is apparently a communications gap that affects even people with backgrounds in quantum mechanics.</p>","points":null,"parent_id":13149013,"story_id":13145216,"children":[]}]}]},{"id":13146747,"created_at_i":1481391392,"type":"comment","author":"tqkxzugoaupvwqr","text":"<p>Dark matter hasn’t been proven to exist. Here is another hypothesis[1].</p><p>[1] <a href=\"https:&#x2F;&#x2F;www.quantamagazine.org&#x2F;20161129-verlinde-gravity-dark-matter&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quantamagazine.org&#x2F;20161129-verlinde-gravity-dar...</a></p>","points":null,"parent_id":13146136,"story_id":13145216,"children":[{"id":13176483,"created_at_i":1481728356,"type":"comment","author":"raattgift","text":"<p>Verlinde&#x27;s paper [ <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1611.02269\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1611.02269</a> ] is the wrong place to be looking for an argument against dark matter.</p><p>It starts with simply accepting that dark energy is part of the unremovable background of spacetime (in particular, his paper considers a de Sitter vacuum with a straightforward positive cosmological constant, and treats it as fully described by classical General Relativity (GR)) and then proposes an emergent thermal-entropic force that may produce deviations from General Relativity on galactic and cluster scales by way of a long-distance entanglement among the fundamental material from which this take on perturbative gravity emerges.</p><p>That fundamental material -- strings (sec 2.3) -- generating the thermal-entropic force does not feel electromagnetism, and so is dark.  That fundamental material additionally is a component of the matter tensor in the low-temperature General Relativistic limit of his theory (eqn 4.23).</p><p>Verlinde&#x27;s theory is, in fact, a &quot;cold&quot; &quot;dark&quot; &quot;matter&quot; one; as the cosmological constant is involved too, it unsurprisingly reproduces the successess of \\Lambda-CDM.   (CDM == cold dark matter).   The only qualification of this is that &quot;matter&quot; is the standard GR definition of everything that is not the gravitational field content.   It&#x27;s not much like the matter of the Standard Model (SM), while WIMPs are expected to be by virtue of some extension of the SM.   (MACHOs, by contrast, can have very little to do with SM or extended-SM particles.)</p><p>Nevertheless, the major difference between Verlinde&#x27;s theory and the standard cosmology is the emergence of the standard cosmology from string theory.</p><p>Quoting the paper: &quot;in  our  ...  framework  one  has  to  add  a  dark  component  to the stress energy tensor,  which behaves very much like the cold dark matter needed to  explain  structure  formation,  but  which  in  its  true  origin  is  an  intrinsic  property of  spacetime  rather  than  being  caused  by  some  unknown  particle&quot;.</p><p>In other words, the paper proposes that <i>some</i> (sec 8.2) of the dark matter of the standard cosmology can emerge from strings in a way that does not produce a particle like a heavy neutrino.</p><p>(The paper is interesting many other ways, though.)</p>","points":null,"parent_id":13146747,"story_id":13145216,"children":[]}]}]}]},{"id":13146077,"created_at_i":1481384133,"type":"comment","author":"yk","text":"<p>Going quickly through the awesomely titled paper [1], they fit a template to the data and obtain something like 2.9 sigma for their best value, without a obvious way how they deal with the look elsewhere effect. On the other hand, this is probably the window on nature that is worst understood, we understand gravity at solar system field strength and distances very well, we have great data from particle physics, but until last year our only evidence for the high field regime of gravity came from pointing telescopes toward astronomical objects - and note that telescopes work with the electro-magnetically, they are using the wrong force.</p><p>I think this is exciting, but only the first step. With this, one can deal with the look elsewhere effect by pointing to this paper and using their analysis, but I wouldn&#x27;t think of this by itself as a hint towards deviations from general relativity.</p><p>[1] Abedi &amp;al. &quot;Echoes from the Abyss: Evidence for Planck-scale structure at black hole horizons&quot; <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1612.00266\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1612.00266</a></p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[]},{"id":13145316,"created_at_i":1481372132,"type":"comment","author":"zeroer","text":"<p>This is super exciting stuff!  We know that the two most accurate models of the physical world, Quantum Mechanics and General Relativity, contradict each other so at least one, and probably both, are approximations to the real laws that govern our universe.  Since the QM and GR disagree about what happens for small massive objects, and in particular black hole event horizons, this is a  place to look for divergence to existing theories.  If these echos holds up under repeated measurements, it could be one of the most consequential measurements of this century.  This is another example of how taking measurements to verify a theory you think you know can lead you in completely unexpected directions.</p><p>Though, for now, the LIGO team is apparently saying that these results could be the result of noise which would occur 1 out of 270 times.  That&#x27;s not strong enough evidence (in my mind) to overcome the overwhelmingly likely prior that General Relativity is correct.  In time, we&#x27;ll see.</p><p>Also, the article mentions that LIGO has witnessed 3 black hole mergers.  Last I heard LIGO had only witnessed 2.</p>","points":null,"parent_id":13145216,"story_id":13145216,"children":[{"id":13147398,"created_at_i":1481398064,"type":"comment","author":"BurningFrog","text":"<p>Yup. This is where, after almost a century, the Quantum Mechanics Rubber finally meets the General Relativity Road.</p><p>May the best theory win!</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[{"id":13147465,"created_at_i":1481398803,"type":"comment","author":"jcoffland","text":"<p>Theory is the operative word here both theories could be, and likely are to some degree, false.  It&#x27;s a common human bias to being to believe one&#x27;s theories as fact.</p>","points":null,"parent_id":13147398,"story_id":13145216,"children":[{"id":13147572,"created_at_i":1481399951,"type":"comment","author":"pvg","text":"<p>That&#x27;s not really what &#x27;scientific theory&#x27; means, outside of creationist circles.</p>","points":null,"parent_id":13147465,"story_id":13145216,"children":[{"id":13152463,"created_at_i":1481482338,"type":"comment","author":"jcoffland","text":"<p>What does this possibly have to do with creationism?  I guess you think that because I&#x27;m calling modern scientific thought into question that I must be a creationist.  Sorry but that&#x27;s not the case.</p>","points":null,"parent_id":13147572,"story_id":13145216,"children":[{"id":13159321,"created_at_i":1481560458,"type":"comment","author":"pvg","text":"<p>I mean that your understanding of what a scientific theory is inaccurate. It&#x27;s a misunderstanding that is most common among creationists so that&#x27;s where you see it discussed most. Here&#x27;s one overview:</p><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Evolution_as_fact_and_theory\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Evolution_as_fact_and_theory</a></p><p>Scientific theory doesn&#x27;t mean &#x27;sort of a suggestion&#x27; as you seem to think.</p>","points":null,"parent_id":13152463,"story_id":13145216,"children":[{"id":13160874,"created_at_i":1481569972,"type":"comment","author":"jcoffland","text":"<p>You are confused about my understanding.  However, scientific theory does not mean &quot;really it&#x27;s true&quot;.  It means we think it&#x27;s true.  Or, this is our best guess so far.  To believe anything else is science as religion.</p>","points":null,"parent_id":13159321,"story_id":13145216,"children":[{"id":13161768,"created_at_i":1481575782,"type":"comment","author":"pvg","text":"<p>I&#x27;m pretty sure I&#x27;m not but ok. I won&#x27;t even say who is fond of the &#x27;science as religion&#x27; thing!</p>","points":null,"parent_id":13160874,"story_id":13145216,"children":[]}]}]}]}]}]}]},{"id":13145360,"created_at_i":1481372947,"type":"comment","author":"danbruc","text":"<p>For reference, at least in particle physics the standard for a discovery is usually taken to be five-sigma, a 1 out of 1.7 million error probability, plus an independent verification to eliminate systematic errors that would not show up in the statistics.</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[{"id":13145880,"created_at_i":1481381702,"type":"comment","author":"ethbro","text":"<p>From someone who hasn&#x27;t worked with statistics in awhile, isn&#x27;t sigma partly dependent on the number of independent events? If so, and LIGO detects occur infrequently, how long are we talking about, even assuming the data supports?</p>","points":null,"parent_id":13145360,"story_id":13145216,"children":[{"id":13146896,"created_at_i":1481393043,"type":"comment","author":"hacker_9","text":"<p>The article said two years.</p>","points":null,"parent_id":13145880,"story_id":13145216,"children":[]},{"id":13149118,"created_at_i":1481420780,"type":"comment","author":"sleavey","text":"<p>We use a technique called time sliding to generate more background data to understand our detector noise better, and thus set better upper limits on the false alarm rate. So even with a 3 month observation time we can claim 5+ sigma.</p>","points":null,"parent_id":13145880,"story_id":13145216,"children":[{"id":13153933,"created_at_i":1481496962,"type":"comment","author":"ethbro","text":"<p>Thanks for the additional information!</p><p>I&#x27;m assuming you&#x27;re referring to the method documented in Ch 4 here? <a href=\"https:&#x2F;&#x2F;gwic.ligo.org&#x2F;thesisprize&#x2F;2011&#x2F;capano_thesis.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;gwic.ligo.org&#x2F;thesisprize&#x2F;2011&#x2F;capano_thesis.pdf</a></p><p>If so, would it be fair to say (as a simplification) that instead of increasing the confidence in GW events by collecting more of them, you&#x27;re doing so by holding the number of collected events almost constant and increasing the confidence in the characteristics of noise the detector is reporting?</p>","points":null,"parent_id":13149118,"story_id":13145216,"children":[{"id":13156577,"created_at_i":1481532056,"type":"comment","author":"sleavey","text":"<p>Yes, exactly that. We don&#x27;t have the luxury of many events, so to increase our confidence we generate more background. One of the problems is what to do with data that contains more than one event. In the second detection paper, one of the plots contains the background with and without the other event taken into account. This is because during the time sliding process you will necessarily slide the time series from one detector across a gravitational wave signal in the other, producing false background noise.</p><p>There&#x27;s no real standard way of dealing with this, so we show both cases - but both claim 5+ sigma.</p>","points":null,"parent_id":13153933,"story_id":13145216,"children":[]}]}]}]},{"id":13147318,"created_at_i":1481397243,"type":"comment","author":"kobeya","text":"<p>This isn&#x27;t particle physics. Particle physics has the luxury and burden of dealing with trillions of experimental trials, not a measly 2.</p>","points":null,"parent_id":13145360,"story_id":13145216,"children":[]}]},{"id":13145449,"created_at_i":1481374657,"type":"comment","author":"privong","text":"<p>&gt; Also, the article mentions that LIGO has witnessed 3 black hole mergers. Last I heard LIGO had only witnessed 2.</p><p>Two have been published as bona fide BH mergers. The third is a signal in the LIGO data that doesn&#x27;t formally meet the statistical significance criteria, and so is classified as a &quot;GW candidate&quot; rather than a detection. Unfortunately I don&#x27;t have a reference for it, but this was discussed during a seminar I attended last month, given by Pedro Marronetti (NSF Program Director for LIGO, I believe).</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[{"id":13146208,"created_at_i":1481385507,"type":"comment","author":"zeroer","text":"<p>Neat!  I&#x27;d love to read more about it.</p>","points":null,"parent_id":13145449,"story_id":13145216,"children":[{"id":13147010,"created_at_i":1481394036,"type":"comment","author":"privong","text":"<p>While writing the original comment, I quickly browsed the LIGO publications list[0], but nothing jumped out at me as being about the candidate, specifically. The papers with &quot;candidate&quot; in the titles are pre-upgrade, so I don&#x27;t think they include the candidate that was referenced in the seminar I attended.</p><p>[0] <a href=\"https:&#x2F;&#x2F;www.lsc-group.phys.uwm.edu&#x2F;ppcomm&#x2F;Papers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lsc-group.phys.uwm.edu&#x2F;ppcomm&#x2F;Papers.html</a></p><p>EDIT: Found something. The third candidate event (LVT151012) is mentioned in this paper, in the 2nd paragraph of the introduction and discussed in more detail in Section C (beginning on page 11): <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1606.04856\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1606.04856</a> (&quot;Binary Black Hole Mergers in the first Advanced LIGO Observing Run&quot;, LIGO+VIRGO).</p>","points":null,"parent_id":13146208,"story_id":13145216,"children":[]}]},{"id":13146209,"children":[]}]},{"id":13145459,"created_at_i":1481374859,"type":"comment","author":"nonbel","text":"<p>&gt;&quot;Quantum Mechanics and General Relativity, contradict each other so at least one, and probably both, are approximations to the real laws that govern our universe.\n[...]\noverwhelmingly likely prior that General Relativity is correct&quot;</p><p>If you think both QM and GR are likely incorrect, then why do you use &quot;a overwhelmingly likely prior&quot; that GR is correct?</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[{"id":13145934,"created_at_i":1481382520,"type":"comment","author":"raattgift","text":"<p>Neither is &quot;incorrect&quot;; the Standard Model and General Relativity are two of our best physical theories in that they both accord entirely with observational and experimental evidence to date.</p><p>Either or both may be <i>incomplete</i>, however.   Correctness and completeness of any theory in mathematical physics are esentially orthogonal.   You can have a complete theory that is just wrong, for example.</p><p>As I wrote a bit earlier in this thread, the most straightforward approach to quantizing General Relativity fails in strong gravity.  Additionally, the classical field theory that is General Relativity is defined on a smooth manifold and yet so far we have been unable to escape the conclusion that some systems of mass-energy inevitably produce a non-smooth discontinuity.  A completion of classical General Relativity requires the smoothing of these regions.  Sharpening this, the problem with GR is the prediction of a gravitational singularity; if singularities are physical at all (even if they are in a region of spacetime that is inaccessible outside event horizons), then General Relativity is incomplete in its own terms.</p><p>The Standard Model as a paradigm of quantum field theory, on the other hand, is defined against a flat spacetime and thus relies on the result from General Relativity that the flat spacetime metric is induced on the tangent space of every point in a smooth spacetime.    So if GR is incomplete, so is the Standard Model, in its own terms.   (This is not just an academic point; any theory of gravity that does not reproduce the Poincaré invariance of flat spacetime in the energy scales of the Standard Model has a terrible <i>correctness</i> problem.)  Additionally, the Standard Model is not especially well-defined at GUT energy scales.   Additionally, the Standard Model does not describe the whole of the non-gravitational content of the universe; for example, it is silent on dark matter.</p><p>The Standard Model is highly correct, however, in the limits where it is effectively complete.  It&#x27;s a pity it has so many free parameters that have to be determined by experiment.</p><p>Likewise, General Relativity is both highly correct in the limits of present observability, and it is complete in its own terms <i>if</i> one admits the possibility that gravitational singularities only arise in our idealized models and that, for example, there are no exactly Schwarzschild black holes anywhere in the past, present or future of our universe.   (One have to show that, and also that there are no other physically realizable systems of matter that can generate non-smoothness in our spacetime.  That&#x27;s not an easy ask.  Although General Relativity has only one of the free paramaters complained about in the previous paragraph, it doesn&#x27;t offer much guidance about how to show that you can&#x27;t actually generate a low-Q Kerr-Newman metric in reality, and worse, some of that guidance must come from the high-energy behaviour of matter fields -- we can only be as complete as the Standard Model right now.)</p>","points":null,"parent_id":13145459,"story_id":13145216,"children":[{"id":13158754,"created_at_i":1481557008,"type":"comment","author":"lambdadmitry","text":"<p>Posts like this is why I read HN. Thanks a lot! :)</p>","points":null,"parent_id":13145934,"story_id":13145216,"children":[]}]},{"id":13145476,"created_at_i":1481375163,"type":"comment","author":"zeroer","text":"<p>Sorry, good catch!  I really mean to say a prior that we wouldn&#x27;t find a falsification of GR in this particular arena.</p>","points":null,"parent_id":13145459,"story_id":13145216,"children":[{"id":13146613,"created_at_i":1481389924,"type":"comment","author":"nonbel","text":"<p>Thanks, makes much more sense.</p>","points":null,"parent_id":13145476,"story_id":13145216,"children":[]}]},{"id":13145480,"created_at_i":1481375222,"type":"comment","author":"laretluval","text":"<p>I think they mean an overwhelmingly strong prior that GR is correct in this particular instance.</p>","points":null,"parent_id":13145459,"story_id":13145216,"children":[]}]},{"id":13147844,"created_at_i":1481403130,"type":"comment","author":"eaq","text":"<p>Just a heads up: the authors of the paper this article is talking about are not part of the LIGO collaboration. They ran their own analysis on the publicly available data.</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[]},{"id":13145797,"created_at_i":1481380644,"type":"comment","author":"raattgift","text":"<p>First a bit of background on QM vs GR, then I&#x27;ll return to your point about horizons.</p><p>It&#x27;s not that they disagree, it&#x27;s just that when you do perturbative quantization of General Relativity you find out you can&#x27;t use the renormalization (by power-set counting) that is done on other perturbatively quantized field theories.   This is only a problem in strong gravity -- where in this context, &quot;strong&quot; means more than one loop of gravitons on a Feynman diagram.   With multi-loop Feynman diagrams involving other massless propagators we can use a number of techniques to reduce the integrals; these techniques do not work with (massless) gravitons.</p><p>One could describe this form of renormalization as a enabling a reduction of infinite modes by making a finite set of measurements at high energy to fix a parameter; this works well for light, for example.   Einstein gravity, on the other hand, is <i>perturbatively</i> non-renormalizable, at least using the same techniques, because you need to make an ever increasing set of these types of parameter-fixing measurements at higher energies, and ultimately in strong gravity (as defined above) you need an infinite number of them.</p><p>Since there is an overwhelming amount of evidence for Einstein gravity everywhere we have been able to look so far, this poses a problem: how do you quantize gravity in a way that makes useful predictions about systems in strong gravity?  There are lots of research programmes looking at this problem.</p><p>(The opposite side of the coin is that programmes to geometrize the fields of the Standard Model exist, but they run into difficulty too.   Taken together, this is the underlying situation supporting the claim that QM and GR disagree about QM scale physics where local curvature distorts lengths and times at the scale of SM scatterings.)</p><p>Outside of strong gravity, however, perturbatively quantized gravity on the one hand, and semiclassical gravity on the other, are perfectly fine effective field theories (effective field theories in the Kenneth G Wilson sense; General Relativity as an effective field theory in this sense I&#x27;ll call &quot;the EFT&quot; below).</p><p>One of the features of black holes generically is that strong curvature is found only very near the (unremovable by change of coordinates in General Relativity, gravitational) singularity.   The event horizon or horizons, depending on metric the black hole sources, are found further from the singularity as the black hole&#x27;s mass increases.    Around an arbitrarily high mass black hole, one will find the horizon is in a region of arbitrarily flat spacetime.   If the compact massive objects we observe to date are astrophysical black holes, they do not have strong gravity at the horizon.</p><p>This is one of the critical parts of the AMPS firewalls &quot;paradox&quot;, wherein one of the set of properties of a black hole which cannot all be true is the no-drama conjecture: an infaller at a sufficiently massive black hole will experience no tidal stresses.</p><p>Afshordi, one of the authors of the paper that&#x27;s the topic of the article has been doing productive phenomenology in his various collaborations, and his argument that there are classes of quantum gravity theory that can be excluded if the observations do not disappear under analysis (e.g., they&#x27;re not systematic errors, and aren&#x27;t &quot;lucky&quot; low-sigma correlations).</p><p>It&#x27;s more than a bit provocative to suggest that the observations suggest that the EFT fails outside the horizon (one of the possibilities that has been discussed by Polchinski and others in the wake of AMPS (he&#x27;s the &quot;P&quot;)), which is fine, since the point will stand or fall on the basis of evidence rather than the consequences for various QG research programmes. :-)</p><p>For now it&#x27;s pretty safe to work on the assumption that the EFT is fine <i>at least</i> everywhere outside the event horizon and the extremely hot dense early universe, and that a UV completion to GR will be completely compatible with the EFT outside strong gravity and inside a region at least a little bigger than the observable universe.</p><p>Finally, all this means that although I won&#x27;t exactly endorse your wording in your third last sentence, I do certainly agree with the sentiment.</p>","points":null,"parent_id":13145316,"story_id":13145216,"children":[{"id":13146507,"created_at_i":1481388904,"type":"comment","author":"AlexCoventry","text":"<p>Any reading suggestions for someone who wants to understand this and has a very strong math background but no physics background beyond basic second-year QM?</p>","points":null,"parent_id":13145797,"story_id":13145216,"children":[{"id":13146888,"created_at_i":1481392985,"type":"comment","author":"raattgift","text":"<p>It&#x27;s hard to gauge (pardon the pun) where to start you based on that.</p><p>I&#x27;ll guess that you&#x27;re keen on understanding the General Relativity part in detail.</p><p>Carroll and ‘t Hooft have kindly put up lecture notes that might be a good starting place.   Stefan Waner has made available good lecture notes on differential geometry in the GR context.</p><p><a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;gr-qc&#x2F;9712019\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;gr-qc&#x2F;9712019</a>  [Carroll]\n<a href=\"http:&#x2F;&#x2F;www.staff.science.uu.nl&#x2F;~hooft101&#x2F;lectures&#x2F;genrel_2010.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.staff.science.uu.nl&#x2F;~hooft101&#x2F;lectures&#x2F;genrel_201...</a>  [&#x27;t Hooft]\n<a href=\"http:&#x2F;&#x2F;www.zweigmedia.com&#x2F;diff_geom&#x2F;tc.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zweigmedia.com&#x2F;diff_geom&#x2F;tc.html</a> [Waner]</p><p>If you can wrap your head around those you could proceed to any of the standard grad texts on GR (MTW, Wald, Weinberg mainly).   Weinberg is popular with people who like concise maths.</p><p>If it&#x27;s all too novel, then Hartle, Schutz and Carroll all have excellent introductory texts aimed at grad students.</p><p>Once you understand how General Relativity works as a general background to any field theory -- classical or quantum -- then you&#x27;d be ready for semiclassical gravity or various quantizations of GR.</p><p>An alternative approach might be to aim you instead towards QFTs via group theory, Lie groups, Yang-Mills theory, renormalization, renormalization group flow, and so forth.</p><p>Eventually you hit on gauge&#x2F;group correspondence arguments in general, which will equip you to understand the attractions of AdS&#x2F;CFT in moving the tedious calculations from one setting to another setting in which they&#x27;re a lot less tedious, and hopefully not fall too hard for the idea that AdS&#x2F;CFT automatically helps us with gravity and matter theories in our universe.</p><p>There is certainly ample scope for talented mathematicians to test the correspondence argument (and especially whether AdS&#x2F;CFT specifically or gauge&#x2F;gravity generally really is a duality) rigourously.</p><p>I think that&#x27;d cover all the ideas touched on in comment you replied to.</p><p>PS: Sorry I meant to list off some QFT resources for you but I have run out of time today.  :(</p>","points":null,"parent_id":13146507,"story_id":13145216,"children":[{"id":13147994,"created_at_i":1481405024,"type":"comment","author":"AlexCoventry","text":"<p>Thank you! I will look into the &quot;QFTs via group theory&quot; approach, since I already have a rough idea how GR works, but QFT is a complete mystery to me.</p>","points":null,"parent_id":13146888,"story_id":13145216,"children":[{"id":13163534,"created_at_i":1481590123,"type":"comment","author":"raattgift","text":"<p>I think that as you have some rough exposure to relativity already, you could first absorb the idea that Minkowski (flat) spacetime is a theory where at every point the Poincaré group is the isometry group.   That&#x27;s a good way to hit on representation theory.</p><p>Representations of the Poincaré group:\n<a href=\"http:&#x2F;&#x2F;www2.ph.ed.ac.uk&#x2F;~s0948358&#x2F;mysite&#x2F;Poincare%20Chapters%201&amp;2.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www2.ph.ed.ac.uk&#x2F;~s0948358&#x2F;mysite&#x2F;Poincare%20Chapters...</a></p><p>and generalizing:\n<a href=\"https:&#x2F;&#x2F;www.wikiwand.com&#x2F;en&#x2F;Particle_physics_and_representation_theory\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wikiwand.com&#x2F;en&#x2F;Particle_physics_and_representat...</a></p><p>Introductions to QFT tend to assume you know a lot of physics.  An example is the Preface for Students in Srednicki&#x27;s prepublication: <a href=\"http:&#x2F;&#x2F;web.physics.ucsb.edu&#x2F;~mark&#x2F;ms-qft-DRAFT.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;web.physics.ucsb.edu&#x2F;~mark&#x2F;ms-qft-DRAFT.pdf</a></p><p>However, Lancaster and Blundell&#x27;s book has some reviews suggesting that someone good at math should be able to work through it without the background needed by textbooks like Srednicki&#x27;s  <a href=\"https:&#x2F;&#x2F;www.dur.ac.uk&#x2F;physics&#x2F;qftgabook&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dur.ac.uk&#x2F;physics&#x2F;qftgabook&#x2F;</a>   (I have not read it though).</p>","points":null,"parent_id":13147994,"story_id":13145216,"children":[{"id":13164624,"created_at_i":1481605739,"type":"comment","author":"AlexCoventry","text":"<p>Thanks again.  Your suggestions led me to scan the QC174.45 shelves at a nearby university library.  I settled on Maggiore&#x27;s <i>A Modern Introduction to Quantum Field Theory</i>, which seems to be almost all Math.</p>","points":null,"parent_id":13163534,"story_id":13145216,"children":[]},{"id":13202398,"created_at_i":1482007004,"type":"comment","author":"AlexCoventry","text":"<p>I got a bit frustrated with Maggiore, and I&#x27;m now taking a crack at Lancaster &amp; Blundell.  The opening chapters are very promising.</p>","points":null,"parent_id":13163534,"story_id":13145216,"children":[]}]}]}]},{"id":13148873,"created_at_i":1481416601,"type":"comment","author":"sn9","text":"<p>Some combination of the following would be a good start, depending on your background:</p><p><i>Quantum Theory for Mathematicians</i> : <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Theory-Mathematicians-Graduate-Mathematics&#x2F;dp&#x2F;146147115X&#x2F;ref=pd_sim_14_1?_encoding=UTF8&amp;psc=1&amp;refRID=KA0JB7VY7BGZN7P55KYA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Theory-Mathematicians-Graduat...</a></p><p><i>Quantum Mechanics for Mathematicians</i> : <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Mechanics-Mathematicians-Graduate-Mathematics&#x2F;dp&#x2F;0821846302\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Mechanics-Mathematicians-Grad...</a></p><p><i>Quantum Field Theory and the Standard Model</i> : <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Field-Theory-Standard-Model&#x2F;dp&#x2F;1107034736&#x2F;ref=pd_sim_14_9?_encoding=UTF8&amp;psc=1&amp;refRID=JM0BG0W0WPE2QSQTDWNC\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Quantum-Field-Theory-Standard-Model&#x2F;d...</a></p>","points":null,"parent_id":13146507,"story_id":13145216,"children":[]}]},{"id":13146848,"created_at_i":1481392487,"type":"comment","author":"kstrauser","text":"<p>I honestly can&#x27;t tell whether that&#x27;s the output of a Markov chain trained on arXiv. I need to read more until I can tell the difference again.</p>","points":null,"parent_id":13145797,"story_id":13145216,"children":[{"id":13146992,"created_at_i":1481393920,"type":"comment","author":"chc","text":"<p>If a Markov chain could generate something that long and coherent, it would be a much greater find than a simple explanation of gravity in General Relativity.</p>","points":null,"parent_id":13146848,"story_id":13145216,"children":[]},{"id":13149823,"created_at_i":1481436433,"type":"comment","author":"ajkjk","text":"<p>If it&#x27;s any help, I can, and it&#x27;s not. I just learned a ton from that post, in terms of clarifying the framework for things I already know a little about.</p>","points":null,"parent_id":13146848,"story_id":13145216,"children":[]}]}]}]}]},{"id":13147042,"created_at_i":1481394517,"type":"story","author":"hecubus","title":"Neurogenesis linked to aerobic exercise","url":"http://nymag.com/scienceofus/2016/04/how-neuroscientists-explain-the-mind-clearing-magic-of-running.html","text":null,"points":263,"children":[{"id":13148672,"created_at_i":1481413764,"type":"comment","author":"StanislavPetrov","text":"<p>&gt;vigorous aerobic exercise, said Karen Postal, president of the American Academy of Clinical Neuropsychology. “That’s it,” she said. “That’s the only trigger that we know about.”</p><p>Actually that isn&#x27;t true.</p><p><a href=\"https:&#x2F;&#x2F;www.jci.org&#x2F;articles&#x2F;view&#x2F;25509\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jci.org&#x2F;articles&#x2F;view&#x2F;25509</a></p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13160172,"created_at_i":1481565760,"type":"comment","author":"copperx","text":"<p>I thought antidepressants such as Prozac were shown to have a neurogenesis effect.</p>","points":null,"parent_id":13148672,"story_id":13147042,"children":[]}]},{"id":13148449,"created_at_i":1481411433,"type":"comment","author":"rdlecler1","text":"<p>Anyone else feel uncomfortable and mild mental-claustrophobia when they run? Time seems to slow to a crawl. I&#x27;be never been able to get past that to enjoy running.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13148470,"created_at_i":1481411596,"type":"comment","author":"wu-ikkyu","text":"<p>Putting in some headphones with good pump up music on helps. Also, try running somewhere  outside with good scenery (I.e. trail running).</p>","points":null,"parent_id":13148449,"story_id":13147042,"children":[]},{"id":13149102,"created_at_i":1481420516,"type":"comment","author":"3131s","text":"<p>Maybe try sprinting if you haven&#x27;t before. I am &#x2F; was a pretty high level athlete and I&#x27;ve never been able to stand jogging, but sprinting is exhilarating. Or just try running in the context of a sport.</p>","points":null,"parent_id":13148449,"story_id":13147042,"children":[]},{"id":13149109,"created_at_i":1481420623,"type":"comment","author":"matwood","text":"<p>I used to hate running distance, but I found after the first couple miles my mind really opened up. I could think clearly and let my mind wander to new ideas. I would end up forgetting I was running at all.</p>","points":null,"parent_id":13148449,"story_id":13147042,"children":[]},{"id":13148618,"created_at_i":1481413130,"type":"comment","author":"tajen","text":"<p>Setting objectives keep my focus on the race. Of course you first have to reach some level of fitness (otherwise it just feels like failures — You need to be able to reach 1hr every time, for example), but when you find a lap of 10-15 minutes and you attempt to beat your speed on 1hr by a few seconds, the race to run as fast as your last record becomes as interesting as hearing the radio anchor commenting your own race. Laps help you measure whether you&#x27;re later or early – in both cases it&#x27;s a mistake. It&#x27;s surprising how the body is precise when you&#x27;re at your maximum, precise to a few sconds every 3km.</p>","points":null,"parent_id":13148449,"story_id":13147042,"children":[]}]},{"id":13147962,"created_at_i":1481404646,"type":"comment","author":"maga","text":"<p>&gt; After about 30 to 40 minutes of a vigorous aerobic workout – enough to make you sweat – studies have recorded increased blood flow to this region, which, incidentally, is associated with many of the attributes we associate with “clear thinking”: planning ahead, focus and concentration, goal-setting, time management.</p><p>I wonder how HIIT stacks up against running in this regard. When done properly, it&#x27;s impossible to do it for the said 30 minutes, yet it makes one sweat no less than that 40 minute run. For example, the routine I follow daily takes about 15 minutes and consists of series of calisthenics a minute&#x2F;half a minute long with 20 seconds of rest between them. By 15 minutes mark it leaves me breathless and drives every muscle to exhaustion. If it&#x27;s all about blood movement, then I assume HIIT should compare well since the routine quickly drives my heart rate up and keeps it relatively high for hours afterwards.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13148568,"created_at_i":1481412653,"type":"comment","author":"rifung","text":"<p>They only talk about neurogenesis here but here&#x27;s an article that says it&#x27;s not as good for neurogenesis.</p><p><a href=\"http:&#x2F;&#x2F;well.blogs.nytimes.com&#x2F;2016&#x2F;02&#x2F;17&#x2F;which-type-of-exercise-is-best-for-the-brain&#x2F;?_r=0\" rel=\"nofollow\">http:&#x2F;&#x2F;well.blogs.nytimes.com&#x2F;2016&#x2F;02&#x2F;17&#x2F;which-type-of-exerc...</a></p><p>I could find being forced to randomly run on a treadmill and then slow down to be extremely stressful, which is bad for neurogenesis, so I don&#x27;t know how representative this experiment is.</p>","points":null,"parent_id":13147962,"story_id":13147042,"children":[{"id":13151402,"created_at_i":1481469740,"type":"comment","author":"maga","text":"<p>Agree, the stress might have negated possible positive outcomes. In my case, though, I&#x27;m sticking with it purely for the joy of it--15 min. of HIIT at the end of the work while you are hungry and tired followed by a cold shower&#x2F;bath for another 15 min. is like being knocked out and woken up after a long sleep--makes you relaxed and focused for the rest of the evening.</p>","points":null,"parent_id":13148568,"story_id":13147042,"children":[]}]},{"id":13148077,"created_at_i":1481405850,"type":"comment","author":"SkyMarshal","text":"<p>For anyone else not familiar with the acronym:</p><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;High-intensity_interval_training\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;High-intensity_interval_traini...</a></p>","points":null,"parent_id":13147962,"story_id":13147042,"children":[{"id":13148114,"created_at_i":1481406303,"type":"comment","author":"Balgair","text":"<p>If you want to look in the scientific literature, then you&#x27;ll want to use : &quot;Tabata&quot;, taken from the first author&#x27;s name that originally discovered and researched this method of exercise.</p>","points":null,"parent_id":13148077,"story_id":13147042,"children":[{"id":13148823,"created_at_i":1481415927,"type":"comment","author":"sn9","text":"<p>The Tabata protocol is much more specific than HIIT and rarely followed even by those claiming to do it.</p><p>It&#x27;s more complicated than doing 20 seconds of &gt;100% effort followed by 10 seconds of rest 8 times over, which is itself more specific than the range of ways in which you can do HIIT.</p>","points":null,"parent_id":13148114,"story_id":13147042,"children":[]}]}]}]},{"id":13148224,"created_at_i":1481408014,"type":"comment","author":"thomyorkie","text":"<p>Unfortunately, some of the benefits of running may prove elusive to those of us living in urban settings.</p><p><a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;23073213\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;23073213</a></p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13148931,"created_at_i":1481417511,"type":"comment","author":"discreteevent","text":"<p>These studies! They measure some micro thing in an extremely complex system and then we extrapolate to get an overall result. But we don&#x27;t do that with complex systems that we engineer. Why do we do it with people?</p><p>I&#x27;ve worked with plenty of smokers. Some who didn&#x27;t take much exercise. But some of them were extremely effective programmers. As Bob Dylan said: You don&#x27;t need a weatherman to know which way the wind blows.</p>","points":null,"parent_id":13148224,"story_id":13147042,"children":[{"id":13149088,"created_at_i":1481420164,"type":"comment","author":"thomyorkie","text":"<p>I too have met some extremely intelligent smokers. But, I think you may be missing the point.  This study doesn’t provide evidence that pollution by itself hinders your cognition.  Rather that pollution (or some other urban-related phenomenon) may blunt some of the positive effects that aerobic exercise would have had otherwise.</p><p>The negative effects of pollution have been well documented, so its not like this study is coming out of nowhere.  But, I  do agree that one study should not be given too much weight. And how pollution affects exercise needs more research before conclusions can be definitively reached.</p>","points":null,"parent_id":13148931,"story_id":13147042,"children":[]}]},{"id":13148369,"created_at_i":1481410356,"type":"comment","author":"rl3","text":"<p>Could always run in a 3M respirator. The reduced airflow would make it extra intense, if not untenable. On the other hand, frequent breaks due to being stopped by police would probably balance that out.</p>","points":null,"parent_id":13148224,"story_id":13147042,"children":[{"id":13148539,"created_at_i":1481412423,"type":"comment","author":"snom380","text":"<p>There are some reviews of different options here: <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;bike-blog&#x2F;2015&#x2F;oct&#x2F;07&#x2F;avoiding-pollution-on-bike-we-test-cycling-anti-pollution-masks-respro-totobobo-biologic\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;bike-blog&#x2F;2015&#x2F;oct&#x2F;0...</a></p>","points":null,"parent_id":13148369,"story_id":13147042,"children":[{"id":13148959,"created_at_i":1481417949,"type":"comment","author":"thomyorkie","text":"<p>Some of the more dangerous pollutants are ultra-fine particles (less than 100nm in size).  I wonder how effective these masks are for trapping these particles.  I can only find information on how well they trap particles larger than 100nm.</p>","points":null,"parent_id":13148539,"story_id":13147042,"children":[{"id":13149365,"created_at_i":1481425374,"type":"comment","author":"dghughes","text":"<p> Many people don&#x27;t realize how dangerous small particles can be over many years. Something that doesn&#x27;t seem dangerous can cause scars on lung tissue with constant exposure to it over many years.</p><p>My dad has idiopathic pulmonary fibrosis or IPF it&#x27;s probably from breathing in small particles over the years which causes scarring of lung tissue. Although the idiopathic part means how it occurs is not known for sure. He worked a blue collar job and often breathed in dust from various things.</p><p>Lungs are only for air don&#x27;t mess with your lungs!</p>","points":null,"parent_id":13148959,"story_id":13147042,"children":[]}]},{"id":13148995,"created_at_i":1481418550,"type":"comment","author":"clumsysmurf","text":"<p>I used a Respro while mountain biking in AZ; when breathing &amp; inhaling very heavily there is some resistance. But otherwise I liked it.</p><p>There is also this inhaler containing ectoine, but this wouldn&#x27;t protect against particles entering the brain via olfactory nerve:</p><p>&quot;An inhaler that protects the lungs against air pollution has been developed by scientists and could help the many millions of people affected by toxic air to avoid its worst effects.&quot;</p><p><a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2016&#x2F;sep&#x2F;16&#x2F;new-inhaler-protects-lungs-against-effects-of-air-pollution\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2016&#x2F;sep&#x2F;16&#x2F;new-inha...</a></p>","points":null,"parent_id":13148539,"story_id":13147042,"children":[]}]},{"id":13149609,"created_at_i":1481430947,"type":"comment","author":"Baeocystin","text":"<p>I&#x27;ve used respirators for years at various jobs.  The older ones were definitely more restrictive, but you can get P100 filters nowadays for cheap that don&#x27;t have any noticeable resistance at all, even when breathing hard.  Just about any dual-filter mask qualifies.</p>","points":null,"parent_id":13148369,"story_id":13147042,"children":[{"id":13149702,"created_at_i":1481433103,"type":"comment","author":"rl3","text":"<p>With all the exhaust in major metro areas you&#x27;d need cartridge-based filters. Personally I&#x27;d opt for 3M Multi Gas 60926s with P100 caps.</p><p>Then again, hauling your own air supply would result in far easier breathing <i>and</i> better cardio due to the added weight.</p>","points":null,"parent_id":13149609,"story_id":13147042,"children":[{"id":13149735,"created_at_i":1481433779,"type":"comment","author":"Mtinie","text":"<p>I use that filter and setup when I work on my art projects. It&#x27;s a pain in the ass, so I know it&#x27;s working (&#x2F;snark)</p><p>Runnning with it, however, is a whole different animal.</p>","points":null,"parent_id":13149702,"story_id":13147042,"children":[]},{"id":13149858,"created_at_i":1481437214,"type":"comment","author":"Baeocystin","text":"<p>Heh.  GMTA. Those are the exact filters I use.  Welding, woodworking, smoke... doesn&#x27;t matter, you can&#x27;t tell, not even a hint of anything other than clean air coming through.  And as long as you use the prefilters, they last a long time.</p>","points":null,"parent_id":13149702,"story_id":13147042,"children":[]}]}]}]}]},{"id":13147478,"created_at_i":1481398969,"type":"comment","author":"lloydde","text":"<p>If you enjoy that article I think you will get heaps out of John J. Ratey&#x27;s book Spark. It describes the connections between mental health and exercise in many dimensions. I like that it both speaks layperson and gives scientific details to spring off from, but some friends wish it was either or, not both.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13147504,"created_at_i":1481399188,"type":"comment","author":"hawkice","text":"<p>If you enjoyed this article it&#x27;s hard to imagine there exist other things on the subject you wouldn&#x27;t enjoy much more. Read What I Talk About When I Talk About Running, which is mentioned in the article, for instance.</p>","points":null,"parent_id":13147478,"story_id":13147042,"children":[{"id":13160198,"created_at_i":1481565970,"type":"comment","author":"copperx","text":"<p>The author started running because he knew writing was a very unhealthy line of work that could lead to an early grave.</p><p>Those of us in technology should be even more worried.</p>","points":null,"parent_id":13147504,"story_id":13147042,"children":[]}]},{"id":13147897,"created_at_i":1481403706,"type":"comment","author":"markdog12","text":"<p>Really loved the book as well, recommended it to friends and family.</p>","points":null,"parent_id":13147478,"story_id":13147042,"children":[{"id":13148806,"created_at_i":1481415700,"type":"comment","author":"eagletusk","text":"<p>I credit this book with bringing me out if a major depressive episode about 5 years ago. I&#x27;ve incorporated running into my schedule ever since and I&#x27;ve yet to have another depression. I had a conversation about it today. I&#x27;m glad to see it mentioned. I gift it  to people often.</p>","points":null,"parent_id":13147897,"story_id":13147042,"children":[{"id":13149397,"created_at_i":1481426036,"type":"comment","author":"lloydde","text":"<p>It triggered a paradigm shift for me. Many of us need our regular doses of exercise to feel good. Cardio is the most importance medicine for me. This discovery also made injury and aging a little scary in a new way :shrug:</p>","points":null,"parent_id":13148806,"story_id":13147042,"children":[]}]}]}]},{"id":13147496,"created_at_i":1481399145,"type":"comment","author":"stinos","text":"<p>nitpick: The actual title of the article is &quot;How Neuroscientists Explain the Mind-Clearing Magic of Running&quot; and that&#x27;s like the best summary it can get. Neurogenesis (a word not even in the article) being linked to exercise is only one of the mechanisms involved (another commenter mentions endorphines as well, which strangely isn&#x27;t in the article)</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13147523,"created_at_i":1481399355,"type":"comment","author":"hawkice","text":"<p>double nitpick: &#x27;neurogenesis&#x27; is in the article, it is in the third sentence of the third paragraph.</p><p>But yes, it is not the focus of the article, because the article has almost no focus. There is an irony in the idea that a runner writing an article about using running to get focus and calm would be so unfocused, disjoint, frenetic and confused, but only a minor irony.</p>","points":null,"parent_id":13147496,"story_id":13147042,"children":[{"id":13147558,"created_at_i":1481399762,"type":"comment","author":"stinos","text":"<p>lol got me there, I thought I read it indeed but then afterwards did a page search which didn&#x27;t find any matches and I was like &#x27;meh, computer&#x27;s probably right&#x27;. It was, because it was case sensitive and I copied &#x27;Neurogenesis&#x27; from the title here :]</p>","points":null,"parent_id":13147523,"story_id":13147042,"children":[]}]},{"id":13147556,"created_at_i":1481399731,"type":"comment","author":"ben0x539","text":"<p>I suspect this is a case of a submitter finding one specific aspect of the submission interesting, not caring about the rest, and using the title to draw attention to it, rather than misrepresenting the article.</p>","points":null,"parent_id":13147496,"story_id":13147042,"children":[]},{"id":13147622,"created_at_i":1481400481,"type":"comment","author":"username223","text":"<p>&gt; (another commenter mentions endorphines as well, which strangely isn&#x27;t in the article)</p><p>Even more tangentially, there&#x27;s a good chance that &quot;runner&#x27;s high&quot; is actually caused by endo-cannabinoids rather than endorphins.</p>","points":null,"parent_id":13147496,"story_id":13147042,"children":[]}]},{"id":13147284,"created_at_i":1481396904,"type":"comment","author":"hkon","text":"<p>It feels good after a workout. Running or powerlifting, I feel the same effects.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13147431,"created_at_i":1481398394,"type":"comment","author":"mgiannopoulos","text":"<p>Endorphins make you happy. That&#x27;s my response to anyone asking why I &quot;bother&quot; to run</p>","points":null,"parent_id":13147284,"story_id":13147042,"children":[{"id":13147510,"created_at_i":1481399220,"type":"comment","author":"dguaraglia","text":"<p>Meh, downvoted you by accident and this stupid iPad interface won&#x27;t let me undo. Making a comment to undo when on a computer.</p>","points":null,"parent_id":13147431,"story_id":13147042,"children":[{"id":13147808,"created_at_i":1481402836,"type":"comment","author":"raverbashing","text":"<p>I see the unvote link on mobile as well, unless you&#x27;re using an app (that should have updated to have the unvote link)</p>","points":null,"parent_id":13147510,"story_id":13147042,"children":[]},{"id":13147621,"created_at_i":1481400474,"type":"comment","author":"robert_tweed","text":"<p>On an iPad here. There&#x27;s an unvote link. Same as on desktop. I always pinch to zoom in on HN because the interface is fiddly and it&#x27;s impossible to tell if you hit up or down. Your finger normally covers them both. Much prefer the Reddit UI (which might be what you&#x27;re mistakenly looking for).</p>","points":null,"parent_id":13147510,"story_id":13147042,"children":[]}]},{"id":13147603,"created_at_i":1481400342,"type":"comment","author":"abstractbeliefs","text":"<p>In your personal experience, did you find it taken some amount of practice, or to clear a certain barrier of fitness, before you started to enjoy running?</p><p>I&#x27;ve been training for about three months now and I spent about 6 weeks of that feeling sick the entire time, and the more recent 6 weeks just not enjoying it.</p>","points":null,"parent_id":13147431,"story_id":13147042,"children":[{"id":13148161,"created_at_i":1481406932,"type":"comment","author":"nitrogen","text":"<p>It took me about six months of swimming to start to notice benefits.  As far as running goes, I find trail running (on sloping, moderately rocky and uneven hiking trails) much more engaging than running on a treadmill or flat ground.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[{"id":13149111,"created_at_i":1481420649,"type":"comment","author":"3131s","text":"<p>Trail running is great. If you have mountain bike trails in your area, I&#x27;d recommend running on those since they&#x27;re winding, filled with slopes and obstacles to jump over, and in general a lot of fun. Many mountain bike trails are designated for both bikers and runners.</p>","points":null,"parent_id":13148161,"story_id":13147042,"children":[]}]},{"id":13149213,"created_at_i":1481422520,"type":"comment","author":"throwaway286","text":"<p>I dislike running but enjoy cycling.  Maybe there&#x27;s some other activity that would catch your interest?</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[]},{"id":13147684,"created_at_i":1481401254,"type":"comment","author":"ieatkittens","text":"<p>I found that it does take time.</p><p>For one, getting zoning out within no time, and second, being fit enough to comfortably run 45-60min.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[]},{"id":13147710,"created_at_i":1481401534,"type":"comment","author":"alecst","text":"<p>I&#x27;m not particularly fit, and I never ran a lot. In fact I always hated running and remember making jokes to my friends about running being a sport for psychopaths. I really just didn&#x27;t get it -- it was hard on my body (especially knees) and just plain boring.</p><p>I have since picked up (slowly) running without shoes on and it has made a real difference. It is difficult to acclimate, but it can be done. I now feel no knee pain and I have realized that I indeed enjoy running. Not only am I discovering that it&#x27;s easier to run without shoes, but it&#x27;s a lot more fun too.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[{"id":13147785,"created_at_i":1481402433,"type":"comment","author":"CodeCube","text":"<p>I&#x27;ve always been fascinated by this ... any time I walk around barefoot, I seem to find every rock, sharp stick, and piece of broken glass in the area. How long does it take for your feet to develop the required callouses?</p>","points":null,"parent_id":13147710,"story_id":13147042,"children":[{"id":13148415,"created_at_i":1481411053,"type":"comment","author":"alecst","text":"<p>Mine have not yet developed callouses and I suspect they never will.</p><p>Indeed I haven&#x27;t seen most of the changes in my feet that others say they have seen in theirs. My feet are mostly the same, but with soles that are just a little less sensitive to pebbles and sticks than they used to be.</p><p>Maybe I&#x27;m lucky, but even in a big city that practically glitters with broken beer bottles and I don&#x27;t find glass to be a problem. Injuries from broken glass are easy to avoid, and are much more often talked about than realized. Once a season I may get a splinter in my foot, or stub my toe on a root, but that&#x27;s about the worst of it.</p><p>There are no real experts on barefoot living yet and if there are I would not be one. But since you asked, in my experience it took a month or so of being consistently barefoot for my soles to begin to feel like they were changing. They&#x27;re still changing, slowly, a year later.</p><p>You get used to the feeling of the concrete on your soles, just like you get used to anything. Then, like anything you get used to, you notice it less and less.</p><p>The only real drawback to being barefoot outside is that a lot of people will look at you like you&#x27;re crazy. They&#x27;ll tell you you&#x27;re going to get injured. That there&#x27;s glass on the ground. Many of these people will be in pumps or wedges. You just learn to let it humor you on the inside.</p>","points":null,"parent_id":13147785,"story_id":13147042,"children":[{"id":13153701,"created_at_i":1481494565,"type":"comment","author":"CodeCube","text":"<p>oh, so you do this primarily in the city? interesting ... thank you for sharing your experience :)</p>","points":null,"parent_id":13148415,"story_id":13147042,"children":[]}]}]}]},{"id":13147715,"created_at_i":1481401582,"type":"comment","author":"crazygringo","text":"<p>In my experience, there are a few things at work. This is just my $0.02, other people&#x27;s experience may be entirely different.</p><p>One, do it gradually -- if you&#x27;re feeling sick, maybe you should be ramping up more slowly. While muscle can grow quickly, tendons and ligaments take much longer to handle the new workload.</p><p>Two, form makes <i>all</i> the difference -- running can either feel heavy and difficult, or lightweight and joyous. But unfortunately, it can take a <i>lot</i> of learning and effort to get to the latter -- good relaxed form is not easy to learn, landing the right way on your foot is incredibly important, for some people things like Vibram shoes help, you might have severe muscle tension preventing good form (see a massage therapist, get a Theracane and use it religiously, etc.), you might have horribly tight hamstrings and need specific stretches for those, the list goes on and on. Me personally, I also had to lose a bunch of weight (getting down to my ideal BMI) for running to feel light and easy rather than painful and pounding.</p><p>And third, being in the right mood for enjoying running makes a huge difference too. When I&#x27;m not in the mood for it, but I run anyways (because I&#x27;m feeling guilty about not running, etc.), I generally stay miserable. But sometimes I really <i>am</i> in the mood for it -- I got enough sleep the night before, I ate a couple hours ago so I have energy, but not so long ago I&#x27;m hungry, it&#x27;s not too early in the day (I&#x27;m not a morning person), but not too late either that I&#x27;m tired -- finding the right time is <i>huge</i>, and makes all the difference.</p><p>Honestly, I love running, but it took a <i>lot</i> of time and effort to figure out everything above that made it work for me -- in my case, years. (And pretty much everything about the programmer lifestyle works against you.) But when you manage to make everything align, it feels <i>great</i>, like you&#x27;re tapping some kind of primal happiness where you&#x27;re back on the African savannah tracking down antelope... I&#x27;m not even joking.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[{"id":13148171,"created_at_i":1481407073,"type":"comment","author":"mgiannopoulos","text":"<p>Proper shoes are very important for running. \nClothes can make a big difference as well.</p>","points":null,"parent_id":13147715,"story_id":13147042,"children":[]},{"id":13149026,"created_at_i":1481419246,"type":"comment","author":"tomascot","text":"<p>It&#x27;s interesting knowing that I enjoy running the most when I&#x27;m starting to feel tired.when I get out of the shower after running I feel like I&#x27;m super light, redbull like.</p><p>I guess every person has it&#x27;s own rhythm.</p>","points":null,"parent_id":13147715,"story_id":13147042,"children":[]}]},{"id":13148298,"created_at_i":1481409087,"type":"comment","author":"david-given","text":"<p>Some people just don&#x27;t enjoy exercise. I&#x27;m one of them. The only way I can do it is through sheer willpower.</p><p>I&#x27;ve heard about the endorphin thing; I think it&#x27;s happened to me exactly once, after climbing a mountain, and it was really creepy and I don&#x27;t want it to happen again. The only thing I feel when finishing exercise is &#x27;oh thank god that&#x27;s over&#x27;.</p><p>What I&#x27;ve found is that the more I train, the fitter I get, and so the longer I can prolong the discomfort, stress and boredom. Maybe you&#x27;re not one of those people --- but if you are, I&#x27;m sorry.</p><p>(In fact, the most <i>annoying</i> thing are that the people who <i>do</i> enjoy exercise simply don&#x27;t believe any of this, and produce unhelpful platitudes like &#x27;you just haven&#x27;t found something you like yet&#x27; or &#x27;but if you keep doing it you&#x27;ll find you&#x27;re enjoying it&#x27;...)</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[{"id":13148418,"created_at_i":1481411085,"type":"comment","author":"bjelkeman-again","text":"<p>Sorry to read about it. I am glad I do enjoy a good excercise.</p>","points":null,"parent_id":13148298,"story_id":13147042,"children":[]},{"id":13148421,"created_at_i":1481411109,"type":"comment","author":"mgiannopoulos","text":"<p>Maybe you need to find a different sport? I prefer running cause I get to be outside and often close to nature. I&#x27;d hate it if I had to go to a gym.</p>","points":null,"parent_id":13148298,"story_id":13147042,"children":[]},{"id":13152110,"children":[]},{"id":13150923,"created_at_i":1481462097,"type":"comment","author":"tormeh","text":"<p>You could try doing &quot;fun&quot; things instead of things that rely on endorphins. Bouldering, wrestling, soccer... Something that keeps your brain occupied as well as your muscles.</p><p>I don&#x27;t really follow my own advice, but I used to boulder regularly when I lived in Berlin, and I liked it.</p>","points":null,"parent_id":13148298,"story_id":13147042,"children":[{"id":13153254,"created_at_i":1481490683,"type":"comment","author":"david-given","text":"<p>Bouldering I&#x27;ve tried --- it&#x27;s okay, but it&#x27;s not really aerobic exercise, which is what I&#x27;m looking for.</p><p>Competitive sports --- flat no. They just don&#x27;t keep my attention.</p><p>What I do is run, because I can build that into my commute, so it doesn&#x27;t feel like it&#x27;s a <i>complete</i> waste of time. Right now I&#x27;m capable of making myself run to work twice a week, 7km each time, which is okay. Hopefully when summer comes round again I&#x27;ll start running back again as well.</p>","points":null,"parent_id":13150923,"story_id":13147042,"children":[]}]},{"id":13149945,"created_at_i":1481439404,"type":"comment","author":"bradknowles","text":"<p>I&#x27;m glad I&#x27;m not the only one who feels this way.</p><p>Yes, I can walk reasonably long distances at the drop of a hat and without difficulty, and I can exercise in the gym, but every time I&#x27;ve done that, I never felt the high. I don&#x27;t think I ever will.</p><p>I guess I&#x27;ll just have to be glad when it&#x27;s over.</p>","points":null,"parent_id":13148298,"story_id":13147042,"children":[]}]},{"id":13148840,"created_at_i":1481416118,"type":"comment","author":"sn9","text":"<p>Most people don&#x27;t go slow enough.</p><p>This sounds counter-intuitive, but you should be going slow enough to hold a conversation.</p><p>If you&#x27;re going much faster, especially when you&#x27;re just starting out, it&#x27;s no wonder you&#x27;re not enjoying it.</p><p>Running really feels meditative at this pace. And it builds a strong aerobic base for more intensive work later on.</p><p>Here&#x27;s a cheap book that lays out the research on why this is so often the advice that works: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;80-20-Running-Stronger-Training-ebook&#x2F;dp&#x2F;B00IIVFAEY\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;80-20-Running-Stronger-Training-ebook...</a></p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[]},{"id":13149117,"created_at_i":1481420768,"type":"comment","author":"matwood","text":"<p>I love sports and powerlifting and have done both for decades now. Running distance I hated. I finally found it okay, once I forced myself to get over the hump. If you keep running, you&#x27;ll eventually hit a point where you feel like at the current pace you can continue indefinitely.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[]},{"id":13148159,"created_at_i":1481406921,"type":"comment","author":"mgiannopoulos","text":"<p>There are always times that fitness isn&#x27;t enjoyable, like running at zero or thirty degrees). If it&#x27;s bad the entire time you might be stressing too much and it probably means that you need to take it slower. Take some rest (but not too much). \nAlso experiment with listening to music or different times of the day.</p>","points":null,"parent_id":13147603,"story_id":13147042,"children":[]}]}]}]},{"id":13147562,"created_at_i":1481399809,"type":"comment","author":"ns8sl","text":"<p>A treatment for PTSD, called EMDR, involves trying to enhance the right&#x2F;left communication in the brain.  This is done by eye tracking back and forth from left to right.  I personally know two people that this was effective on, but <i></i>there is a lack of hard data<i></i> on whether this works or not in general.</p><p>However, the PTSD specialist that worked with these two individuals suggested that running (and walking) long distances can create the same effect since the person is continually scanning the environment.  This would alleviate PTSD symptoms plus anxiety and depression in her patients.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13147658,"created_at_i":1481400957,"type":"comment","author":"Alex3917","text":"<p>If scanning the environment while walking or jogging works, then I&#x27;d recommend learning how to identify edible mushrooms. Whenever you&#x27;re outside you go into 24&#x2F;7 extreme scanning mode that is pretty much impossible to turn off.</p><p>Beginning mushroom hunters find mushrooms by seeing them. Expert mushroom hunters just see things in their peripheral vision that are consistent with a mushroom being there. (E.g. some leaves out of place, a pop of color where there shouldn&#x27;t be, a wisp of smoke, etc.) By the time you actually consciously focus your eyes&#x2F;attention on the area and get close enough to see whether or not there really is a mushroom, you&#x27;re already pretty sure whether or not you&#x27;ve found something.</p>","points":null,"parent_id":13147562,"story_id":13147042,"children":[{"id":13148465,"created_at_i":1481411574,"type":"comment","author":"astrange","text":"<p>Why a wisp of smoke? Because they see something grey or are mushrooms out there starting forest fires?</p>","points":null,"parent_id":13147658,"story_id":13147042,"children":[{"id":13148686,"created_at_i":1481413919,"type":"comment","author":"darpa_escapee","text":"<p>Visible evaporate == really good mushroom habitat, most of the time.</p>","points":null,"parent_id":13148465,"story_id":13147042,"children":[]},{"id":13148730,"created_at_i":1481414648,"type":"comment","author":"Alex3917","text":"<p>If the mushrooms are older you can sometimes see the spores before seeing the actual mushroom. This obviously happens with puffballs, but I&#x27;ve also seen it with Honey Mushrooms and Maitake.</p><p>These are really bad for you to breathe in though, so if you see this happening then definitely go in the other direction.</p>","points":null,"parent_id":13148465,"story_id":13147042,"children":[]},{"id":13148511,"created_at_i":1481412102,"type":"comment","author":"teddyh","text":"<p>Maybe he’s thinking of <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Puffball\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Puffball</a></p>","points":null,"parent_id":13148465,"story_id":13147042,"children":[]}]}]},{"id":13148554,"created_at_i":1481412509,"type":"comment","author":"fapjacks","text":"<p>I like the suggestion here that one of the ways running could help is by the eye tracking back and forth. Going for a run works, full stop. You can search my comment history and see that I recommend four specific things to help immediately alleviate PTSD symptoms like depression and anxiety (take a shower and do some laundry, do some exercise and run, hydrate and eat some leafy greens, and make an appointment with your doc), in which &quot;going for a run&quot; is a central ingredient. I&#x27;ve helped a pretty big group of people over the last ten years (myself, former members of my unit, friends and family, etc), and it works. Incidentally, people always seem to have an opinion about this, even when they&#x27;ve never experienced the problems themselves. It&#x27;s a bit surprising actually how many people rush to get a word in edgewise, when it concerns <i>someone else&#x27;s</i> feelings. Anyway, this is a very interesting theory.</p>","points":null,"parent_id":13147562,"story_id":13147042,"children":[{"id":13149214,"created_at_i":1481422523,"type":"comment","author":"zeroer","text":"<p>What would you recommend for someone who used to love running but can&#x27;t anymore because of knee and ankle problems?</p>","points":null,"parent_id":13148554,"story_id":13147042,"children":[{"id":13156996,"created_at_i":1481537440,"type":"comment","author":"fapjacks","text":"<p>Swimming is a <i>fantastic</i> suggestion and I wholeheartedly agree with it. I&#x27;d also recommend weightlifting as a great companion regimen.</p>","points":null,"parent_id":13149214,"story_id":13147042,"children":[]},{"id":13150096,"created_at_i":1481443508,"type":"comment","author":"musha68k","text":"<p><i>Swimming</i> - hated it back in school, started to love it five years ago during a very stressful time in my life.</p><p>Peace and meditation is what it mostly does for me.</p><p>If you are interested do yourself a favor and check out the book &quot;Total Immersion&quot; by Terry Laughlin.</p><p>I wish had started to read it earlier - a total game changer for me, none of the &quot;no-pain-no-gain&quot; bullshit. I swear I&#x27;ve been\nhaving almost instant results, passing by most &quot;better trained&quot; swimmers with blissful ease, it really is unfair ;) Essentially it&#x27;s about hacking swimming by seriously getting into the <i>physics</i> of the sport.</p><p>Highly recommended!</p><p><a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Total_Immersion\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Total_Immersion</a></p><p><a href=\"https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;936958.Total_Immersion\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;936958.Total_Immersion</a></p>","points":null,"parent_id":13149214,"story_id":13147042,"children":[]}]}]}]},{"id":13147585,"created_at_i":1481400144,"type":"comment","author":"Swizec","text":"<p>Considering we are the most long-distance and endurance optimized land animal evolution has come up with, why do we continue to be surprised that running is good for us?</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13148170,"children":[]},{"id":13147707,"created_at_i":1481401506,"type":"comment","author":"hkon","text":"<p>I think that when we as individuals each discover this, we are struck by it. It&#x27;s one thing to read that exercise is good for you, another thing to actually feel the goodness.</p>","points":null,"parent_id":13147585,"story_id":13147042,"children":[]},{"id":13147623,"children":[]}]},{"id":13149380,"created_at_i":1481425561,"type":"comment","author":"nacc","text":"<p>Most of the neurogenesis studies are done in rodents. So the conclusion should be carefully taken, especially for something like neurogenesis which varies wildly across species.</p><p>Running promotes neurogenesis, but also enriched environment, many drugs, genetics etc. Its effect in mice is also somewhat elusive at this point: we aren&#x27;t sure whether it promotes learning or forgetting.</p><p>That being said, all the nice cognitive effects from exercise probably all due to endorphins (literally endogenous morphine) released in the brain afterwards.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[{"id":13150250,"children":[]},{"id":13149657,"created_at_i":1481432336,"type":"comment","author":"xiaoma","text":"<p>Several studies have confirmed the effects on humans. AFIK, this one was the first: <a href=\"https:&#x2F;&#x2F;scholar.google.com&#x2F;scholar_lookup?title=Neurogenesis+in+the+adult+human+hippocampus&amp;author=P.+S.+Eriksson&amp;author=E.+Perfilieva&amp;author=T.+Björk-Eriksson+et+al.&amp;publication_year=1998\" rel=\"nofollow\">https:&#x2F;&#x2F;scholar.google.com&#x2F;scholar_lookup?title=Neurogenesis...</a></p><p>If you google for studies citing the one above, you will find many more. Purely from a standpoint of scientific evidence, running if one of the best things you can do for your brain. Bilingualism and cognitively demand work are also a good ideathough its less clear whether they have cognitive protective effects or actually lead to neurogenesis.</p>","points":null,"parent_id":13149380,"story_id":13147042,"children":[]},{"id":13149434,"created_at_i":1481426770,"type":"comment","author":"pizza","text":"<p>How distinguishable are externally introduced endorphins to morphine or heroin?</p><p>Billion dollar startup idea: insulin pump-like device that lets you watch hours of ads for heroin infusions..</p>","points":null,"parent_id":13149380,"story_id":13147042,"children":[{"id":13151299,"created_at_i":1481468283,"type":"comment","author":"crpatino","text":"<p>Thank you for this. Our hordes of bright-eyed would-be disrupters and world changers need to hear this a hundred time, a thousand times, and then ponder carefully in precisely what direction they want to actually have the world moving.</p>","points":null,"parent_id":13149434,"story_id":13147042,"children":[]},{"id":13149873,"created_at_i":1481437468,"type":"comment","author":"Nav_Panel","text":"<p>Actually, runner&#x27;s high is caused by endocannabinoids, not endorphins. This NYT article[1] has a decent writeup and a link to the actual journal article. So, not sure how well your startup idea will work, THC infusions maybe?</p><p>[1] <a href=\"http:&#x2F;&#x2F;mobile.nytimes.com&#x2F;blogs&#x2F;well&#x2F;2015&#x2F;10&#x2F;07&#x2F;homing-in-on-the-source-of-runners-high&#x2F;?referer=\" rel=\"nofollow\">http:&#x2F;&#x2F;mobile.nytimes.com&#x2F;blogs&#x2F;well&#x2F;2015&#x2F;10&#x2F;07&#x2F;homing-in-on...</a></p>","points":null,"parent_id":13149434,"story_id":13147042,"children":[]}]}]},{"id":13149152,"created_at_i":1481421546,"type":"comment","author":"ajarmst","text":"<p>Adding a plug for Ratey&#x27;s book &quot;Spark&quot; (<a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Spark-Revolutionary-Science-Exercise-Brain&#x2F;dp&#x2F;0316113514&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Spark-Revolutionary-Science-Exercise-...</a>) which is a pretty good lay introduction to a lot of the research on cognition and exercise as well as exercise&#x27;s role in ameliorating depression, anxiety, stress response, and some neurological deficits.  Recommended by my physician. Turns out the wonder drug we were looking for might have been &quot;take a lap&quot;.</p>","points":null,"parent_id":13147042,"story_id":13147042,"children":[]}]},{"id":13146315,"created_at_i":1481386745,"type":"story","author":"Tomte","title":"Cryptomancer RPG","url":"http://cryptorpg.com/","text":null,"points":189,"children":[{"id":13146915,"created_at_i":1481393213,"type":"comment","author":"jasoncchild","text":"<p>Cyberpunk...or wait...Shadowrun!</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13149038,"created_at_i":1481419445,"type":"comment","author":"szul","text":"<p>Definitely feels like a variation of Shadowrun.</p>","points":null,"parent_id":13146915,"story_id":13146315,"children":[{"id":13149654,"created_at_i":1481432270,"type":"comment","author":"SolarNet","text":"<p>Except it&#x27;s inverted. Shadowrun is cyberpunk with orcs and elves. This is orcs and elves with cyberpunk.</p>","points":null,"parent_id":13149038,"story_id":13146315,"children":[{"id":13152951,"created_at_i":1481487526,"type":"comment","author":"jasoncchild","text":"<p>True! I realized that sometime after my comment but neglected to edit</p>","points":null,"parent_id":13149654,"story_id":13146315,"children":[]},{"id":13150904,"created_at_i":1481461766,"type":"comment","author":"szul","text":"<p>I honestly prefer Netrunner. I&#x27;d rather keep my fantasy and cyberpunk settings a little separate.</p>","points":null,"parent_id":13149654,"story_id":13146315,"children":[]}]},{"id":13149655,"children":[]}]}]},{"id":13147683,"created_at_i":1481401241,"type":"comment","author":"monk_e_boy","text":"<p>hijack this to push HeroKids RPG game. I don&#x27;t have any vested interest in it, other than it is super rad and my kids love playing it.</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13147798,"created_at_i":1481402737,"type":"comment","author":"saycheese","text":"<p>To give a comparison between the two, here are the two preview files for each:</p><p>Cryptomancer RPG\n<a href=\"http:&#x2F;&#x2F;watermark.drivethrurpg.com&#x2F;pdf_previews&#x2F;186678-sample.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;watermark.drivethrurpg.com&#x2F;pdf_previews&#x2F;186678-sample...</a></p><p>Hero Kids RPG\n<a href=\"http:&#x2F;&#x2F;watermark.drivethrurpg.com&#x2F;pdf_previews&#x2F;106605-sample.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;watermark.drivethrurpg.com&#x2F;pdf_previews&#x2F;106605-sample...</a></p>","points":null,"parent_id":13147683,"story_id":13146315,"children":[]},{"id":13147799,"children":[]}]},{"id":13147176,"created_at_i":1481395744,"type":"comment","author":"karmicthreat","text":"<p>Someone over in the SA Fatal and Friends thread did a review that was posted here: <a href=\"http:&#x2F;&#x2F;projects.inklesspen.com&#x2F;fatal-and-friends&#x2F;binarydoubts&#x2F;cryptomancer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;projects.inklesspen.com&#x2F;fatal-and-friends&#x2F;binarydoubt...</a></p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13148301,"created_at_i":1481409120,"type":"comment","author":"labster","text":"<p>The review gives a lot better overview than the website does, so thanks for linking.</p><p><pre><code>    &gt; Basically, the first shards that were found (jumpstarting the Modern Age)\n    &gt; came from an enormous crystalline meteor, so large that thousands upon thousands\n    &gt; of shards were able to be cut from it. They all connected together to form the \n    &gt; Shardscape, which quickly became the lifeblood of the world&#x27;s communications and\n    &gt; commerce.\n\n    &gt; So yeah. You cannot win. There’s no way to reduce risk, no way to stop the\n    &gt; inevitable – just keep fighting until the Risk Eaters are literally willing\n    &gt; to nuke you from orbit, just to get rid of you and your friends.\n</code></pre>\nIf I was running a game, if the party ever got to risk 100%, this would be the point where the aliens show up, safe in the knowledge that they know literally every secret and every truename on the planet.  &quot;Things can always get worse.&quot; --dang[1]</p><p>[1]: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13110096\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13110096</a></p>","points":null,"parent_id":13147176,"story_id":13146315,"children":[]},{"id":13147352,"created_at_i":1481397674,"type":"comment","author":"bjelkeman-again","text":"<p>He complains the manual is 400 pages, then proceeds to write a review that is probably 20. And he isn&#x27;t done yet. At least it is comprehensive.</p>","points":null,"parent_id":13147176,"story_id":13146315,"children":[{"id":13149854,"created_at_i":1481437149,"type":"comment","author":"jholman","text":"<p>That comment about it being 400 pages is not a complaint, I think.</p>","points":null,"parent_id":13147352,"story_id":13146315,"children":[]}]}]},{"id":13147199,"children":[]},{"id":13146754,"created_at_i":1481391431,"type":"comment","author":"ryanmarsh","text":"<p>Has anyone played this? Thoughts?</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]},{"id":13146792,"created_at_i":1481391875,"type":"comment","author":"jfaucett","text":"<p>This is very nice artwork. I wonder if this is the same Chad Walker who worked on Age of Empires and BloodRayne? They&#x27;ve done some pretty cool stuff too at <a href=\"http:&#x2F;&#x2F;www.walkerboystudio.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.walkerboystudio.com</a> .</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]},{"id":13149622,"created_at_i":1481431272,"type":"comment","author":"cyphreak","text":"<p>I&#x27;m down. Anybody in Denver want to do this?</p><p>Is there a place for tabletop gamers to organize? I&#x27;ve always wanted to get into it, but just not with the Doritos+MtnDew sort of people. A bunch of infosec professionals playing this game would be highly entertaining, I think.</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]},{"id":13150646,"created_at_i":1481456485,"type":"comment","author":"umsm","text":"<p>Great artwork, but I&#x27;ll never find time to actually read the 400-pages manual.</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]},{"id":13148605,"created_at_i":1481412947,"type":"comment","author":"saycheese","text":"<p>Here&#x27;s an log of a chat with the game&#x27;s creator that provides a lot of additional information:\n<a href=\"https:&#x2F;&#x2F;gmshoe.wordpress.com&#x2F;2016&#x2F;06&#x2F;21&#x2F;qa-chad-walker-cryptomancer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gmshoe.wordpress.com&#x2F;2016&#x2F;06&#x2F;21&#x2F;qa-chad-walker-crypt...</a></p><p>Which links to an indepth description of how the game works by the creator:\n<a href=\"https:&#x2F;&#x2F;forum.rpg.net&#x2F;showthread.php?781271-Cryptomancer-A-fantasy-role-playing-game-about-hacking\" rel=\"nofollow\">https:&#x2F;&#x2F;forum.rpg.net&#x2F;showthread.php?781271-Cryptomancer-A-f...</a></p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]},{"id":13147848,"created_at_i":1481403178,"type":"comment","author":"marmaduke","text":"<p>why is first image a elf lady? shoudnt hackers be sort of gender neutral?</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13148259,"created_at_i":1481408540,"type":"comment","author":"slmyers","text":"<p>Why should hackers be gender neutral or agender&#x2F;androgynous?</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[{"id":13148282,"created_at_i":1481408884,"type":"comment","author":"marmaduke","text":"<p>I mean, the not-so-subtle imagery of a sexy elf woman sort of pushes buttons on introverted, gamerish masculinity in a manipulative way that seems at odds with notions of hackerdom.</p>","points":null,"parent_id":13148259,"story_id":13146315,"children":[{"id":13149167,"created_at_i":1481421845,"type":"comment","author":"PhasmaFelis","text":"<p>Advertising everything with oversexualized women is a real problem, but that character is not at all sexualized. You seem to be saying that games should only depict men or ugly women. That is really not what anyone needs or wants.</p>","points":null,"parent_id":13148282,"story_id":13146315,"children":[]}]}]},{"id":13148785,"created_at_i":1481415398,"type":"comment","author":"pavel_lishin","text":"<p>I&#x27;m not sure if that&#x27;s supposed to be a man or a woman.</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[]},{"id":13148315,"created_at_i":1481409367,"type":"comment","author":"KirinDave","text":"<p>I looked. I actually don&#x27;t see that art pushing many of the fantasy art sex trope buttons:</p><p>1. Wearing what looks like not-outrageous closes.\n2. There is no obvious cleavage.\n3. There is no willing-come-hither smile at the PoV\n4. Indeed, they are ignoring the PoV.</p><p>Look, that whole Male-Gaze thing is not about erasing all aspects of feminine form in art. That&#x27;d actually be a worse outcome if our goal is better and fairer representation. It&#x27;s about pointing out that Cindy from FFXV is a pretty manipulative and somewhat denigrating trope in fantasy art.</p><p>Think about how many _male_ body types have become acceptable in fantasy art over time. Old men, fat men, emaciated men, short men, slouchy men, skinny men. We&#x27;re getting progressively more comfortable with men of color in fantasy art as well (although still a long way to go here in many ways). Healthy or sick, brown or pale, native or imperialist, writers find a way to make identifiable and enjoyable protagonists out of a lot of male archetypes, and for what it&#x27;s worth most of that is great.</p><p>But when it comes to women, we see WAY fewer allowable templates and they tend to skew towards what the male consensus finds desirable. When we really sit down and see what&#x27;s fair game for these genders, obviously that&#x27;s not terribly fair.</p><p>That&#x27;s the principle complaint people are trying to redress. By locking every female archetype to what a 25-year old man fantasizes about, we create fewer opportunities for a real and textured world and create a sensation of isolation, distance and difference among those ignored groups.</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[{"id":13150296,"created_at_i":1481448119,"type":"comment","author":"marmaduke","text":"<p>You&#x27;re right. I looked up &quot;cindy ffxv&quot; since I didn&#x27;t know and by comparison this is  one is cool.</p><p>I guess I was expecting an image which says more about what happens in the game.</p>","points":null,"parent_id":13148315,"story_id":13146315,"children":[]}]},{"id":13147865,"created_at_i":1481403353,"type":"comment","author":"TillE","text":"<p>It&#x27;s a helpful clue that the setting is more Shadowrun than Neuromancer.</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[]},{"id":13149145,"created_at_i":1481421423,"type":"comment","author":"PhasmaFelis","text":"<p>I read this comment and thought &quot;Ugh, I bet they put a half-naked chick with improbable tits on there, as usual.&quot;</p><p>I looked at the site and she&#x27;s well-clad and and actually kind of androgynous.</p><p>I&#x27;m really not sure what the problem is. Are you saying they shouldn&#x27;t have put a person on the cover at all?</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[]},{"id":13147867,"created_at_i":1481403376,"type":"comment","author":"skj","text":"<p>Elf men and women are indistinguishable.</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[{"id":13148267,"created_at_i":1481408707,"type":"comment","author":"marmaduke","text":"<p>ah I didn&#x27;t know that</p>","points":null,"parent_id":13147867,"story_id":13146315,"children":[{"id":13149182,"created_at_i":1481422039,"type":"comment","author":"PhasmaFelis","text":"<p>That&#x27;s only sort of true (male elves in art tend to be slender and androgynous, but still identifiably male) and anyway beside the point. Yes, that elf is probably intended to be female, and that&#x27;s okay.</p>","points":null,"parent_id":13148267,"story_id":13146315,"children":[]}]}]},{"id":13148662,"created_at_i":1481413644,"type":"comment","author":"GFK_of_xmaspast","text":"<p>Would you have preferred an elf dude?</p>","points":null,"parent_id":13147848,"story_id":13146315,"children":[]}]},{"id":13147874,"created_at_i":1481403432,"type":"comment","author":"saycheese","text":"<p>How many players including the DM are required to play?</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13149106,"created_at_i":1481420578,"type":"comment","author":"PhasmaFelis","text":"<p>Assuming it&#x27;s like most tabletop RPGs, the answer is probably &quot;one.&quot; Three to six is more typical, though.</p>","points":null,"parent_id":13147874,"story_id":13146315,"children":[{"id":13149727,"created_at_i":1481433654,"type":"comment","author":"makeset","text":"<p>How do you play a tabletop RPG by yourself?</p>","points":null,"parent_id":13149106,"story_id":13146315,"children":[{"id":13152441,"created_at_i":1481482097,"type":"comment","author":"saycheese","text":"<p>Agree, though appears to be a thing; here&#x27;s a pretty good guide to &quot;solo rpg&#x2F;roleplaying&quot;:</p><p><a href=\"http:&#x2F;&#x2F;www.rpgready.com&#x2F;solo-roleplaying-solo-rpg&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rpgready.com&#x2F;solo-roleplaying-solo-rpg&#x2F;</a></p>","points":null,"parent_id":13149727,"story_id":13146315,"children":[]}]},{"id":13149372,"created_at_i":1481425461,"type":"comment","author":"saycheese","text":"<p>While it&#x27;s a guess, appears to be less than five, since the &quot;Pregenerated Character Sheets&quot; from the downloads page includes only five characters:\n<a href=\"http:&#x2F;&#x2F;cryptorpg.com&#x2F;pregen_sheets.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptorpg.com&#x2F;pregen_sheets.pdf</a></p>","points":null,"parent_id":13149106,"story_id":13146315,"children":[]}]}]},{"id":13147624,"created_at_i":1481400488,"type":"comment","author":"pfisch","text":"<p>So I guess we all think it is legit that this ad has 96 points in 3 hours.  More than anything else on HN in this time period.</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13147670,"created_at_i":1481401137,"type":"comment","author":"ghostwreck","text":"<p>Isn&#x27;t that what most tech announcements are?</p>","points":null,"parent_id":13147624,"story_id":13146315,"children":[]},{"id":13147784,"created_at_i":1481402425,"type":"comment","author":"qwertyuiop924","text":"<p>Seems pretty legit to me: it&#x27;s of interest, both actually and conceptually, it could inspire discussion, and it&#x27;s just flat-out cool.</p><p>Besides, HN is full of ads: hiring boards, show HNs of products HN users have worked on, various nonsense from HN startups, ads from other companies popping up on the front page (&quot;hey, our new product launched this week&quot;), and so on. And that&#x27;s not even mentioning all the advertising for projects that users do inside threads: How often have you heard kaz essentially advertising TXR, his project? (although to his credit, he only does it when it&#x27;s relevant to the discussion, or if TXR would help with a problem another user mentioned: many are less restrained).</p>","points":null,"parent_id":13147624,"story_id":13146315,"children":[]},{"id":13147829,"created_at_i":1481403028,"type":"comment","author":"saycheese","text":"<p>Point of HN is to share.</p><p>As long as what is shared follows the guidelines, that&#x27;s literally all that matters.</p><p>Everyone once in awhile you&#x27;ll see something that&#x27;s clearly attempting to exploit HN to promote whatever they&#x27;re pushing, put I don&#x27;t see anything that fits a pattern like that and appears to be well within the scope of the guidelines.</p>","points":null,"parent_id":13147624,"story_id":13146315,"children":[{"id":13148999,"created_at_i":1481418629,"type":"comment","author":"pfisch","text":"<p>Is the point of hn to make a bunch of bot accounts on proxies to massively upvote your ad in the first hour?</p>","points":null,"parent_id":13147829,"story_id":13146315,"children":[{"id":13149713,"created_at_i":1481433256,"type":"comment","author":"ekiru","text":"<p>I think you&#x27;re right that that is not the point of HN, but I think HN attempts to automatically (and the HN moderators attempt to non-automatically in some cases) detect various kinds of voting abuse, including that kind. It&#x27;s possible that these detection mechanisms are flawed and that this story was upvoted in that way but managed to get past those mechanisms, but another possibility is that people found the concept interesting and upvoted for that reason (or hoped for it to produce some interesting discussion). Many of the other comments (most of which do post-date your original complaint, of course) do seem to support the hypothesis that some HN users would find it interesting.</p><p>With that said (and assuming you have sufficient karma to flag stories), I think that believing a story to have reached the front page via such abusive voting would be a good reason to flag the story, which will bring it to the attention of the mods, who hopefully would be able to determine whether anything improper was in fact going on.</p>","points":null,"parent_id":13148999,"story_id":13146315,"children":[{"id":13150176,"created_at_i":1481445357,"type":"comment","author":"pfisch","text":"<p>So do you think the mods are paid more than the marketers pushing stuff to the top?  As a person who has benefited from having posts on the top of reddit I can tell you that there is a massive incentive to manipulate the system and that mods do not really have enough incentive or resources to stop them.  It is basically like trying to keep drugs from crossing the border.  The people who make money from the drugs can marshal massive resources in order to get the them across the border, and the will&#x2F;resources just aren&#x27;t there on the opposing side to really stop them.</p><p>r&#x2F;gaming is massively gamed, r&#x2F;news the mods are in on the gaming and have made it illegal to post links that don&#x27;t lead to big news sources.  This was done under the guise of making r&#x2F;news more legit I guess, but it is hard to believe the fix wasn&#x27;t in.  Also mods of r&#x2F;gaming are probably also in on it because there is just too much money at stake.  Try to contact some of the users posting gta 5 gifs on the front page and see how real they are if you don&#x27;t believe me.</p><p>It strains credibility to believe that this post had a massive number of upvotes in the first 3 hours and almost no comments, and it is a pretty blatant advertorial.  I think it did gain some real traction after that, but when you boost something into a high visibility position it always generates some decent numbers.  The question is would it have actually gotten to the top on its own?  I really doubt it.</p><p>There is no smoking gun here and there never will be.  It is incredibly easy to make 100 accounts on proxies and make some comments with them and then upvote a post.  We are talking about one employee for less than a week of work.  The payoff is very large and it is basically untraceable by mods.  It happens all the time on reddit and hn.</p>","points":null,"parent_id":13149713,"story_id":13146315,"children":[{"id":13150579,"created_at_i":1481455002,"type":"comment","author":"qwertyuiop924","text":"<p>I am <i>massively</i> skeptical of this. This seems to be the sort of thing that would come to the top on its own.</p><p>Also, this isn&#x27;t Reddit. The commuity and moderation are pretty different here.</p><p>In addition, do big advertisers even know about us? We&#x27;re pretty niche, and not all that well recognized outside of the programming community.</p>","points":null,"parent_id":13150176,"story_id":13146315,"children":[{"id":13153032,"created_at_i":1481488344,"type":"comment","author":"pfisch","text":"<p>&quot;This seems to be the sort of thing that would come to the top on its own.&quot;</p><p>Maybe, but not in that time period.</p><p>&quot;Also, this isn&#x27;t Reddit. The commuity and moderation are pretty different here.&quot;</p><p>If anything Reddit does more to defend against this sort of thing.</p><p>&quot;do big advertisers even know about us?&quot;</p><p>I have seen so many posts on the top of hn talking about &quot;the hn effect&quot;  It is ridiculous to think that people in pr and marketing aren&#x27;t paying attention to that, while gaming product hunt and reddit.</p><p>I own a software studio that makes software and I am noticing how vulnerable HN is.  Other people have obviously noticed as well.</p><p><a href=\"https:&#x2F;&#x2F;bitcointalk.org&#x2F;index.php?topic=498634.0\" rel=\"nofollow\">https:&#x2F;&#x2F;bitcointalk.org&#x2F;index.php?topic=498634.0</a></p><p>that is from 2014</p>","points":null,"parent_id":13150579,"story_id":13146315,"children":[]}]}]}]}]}]},{"id":13149132,"created_at_i":1481421013,"type":"comment","author":"PhasmaFelis","text":"<p>So are you proposing that Hacker News, a website that regularly covers startups with millions of dollars of investor money, has chosen to fake upvotes to shill for an ultra-niche one-man tabletop game?</p><p>Or are you saying that HN is somehow able to detect and deflect vote manipulation for the former but not the latter?</p><p>&#x27;Cause I think &quot;HN readers are into cryptography&#x2F;security and  tabletop RPGs&quot; is a <i>way</i> more likely theory than either of those.</p>","points":null,"parent_id":13147624,"story_id":13146315,"children":[]}]},{"id":13148394,"created_at_i":1481410749,"type":"comment","author":"bburky","text":"<p>This reminds me of the time my party argued about how much modern information theory we were allowed to use in D&amp;D. We wanted to maximize the amount of information to communicate using Sending which states that it sends &quot;twenty-five words or less&quot;. Can I use a form of encoding and a compression algorithm? Or can we make up words and can they be arbitrarily long?</p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[{"id":13151862,"created_at_i":1481475158,"type":"comment","author":"oconnor0","text":"<p>Of course, since it&#x27;s magic, you could easily rule that total data transferred is equivalent to 25 words or less regardless of compression or not.</p>","points":null,"parent_id":13148394,"story_id":13146315,"children":[]},{"id":13148563,"created_at_i":1481412622,"type":"comment","author":"pavel_lishin","text":"<p>Codes have been around since forever; isn&#x27;t the problem that you have to make sure the receiving party knows the algorithm, too?</p>","points":null,"parent_id":13148394,"story_id":13146315,"children":[{"id":13149003,"created_at_i":1481418699,"type":"comment","author":"johncolanduoni","text":"<p>Encryption yes, but compression encodings haven&#x27;t.</p>","points":null,"parent_id":13148563,"story_id":13146315,"children":[{"id":13149156,"created_at_i":1481421627,"type":"comment","author":"my_first_acct","text":"<p>Compression schemes (in the form of code books) to save on telegraphy costs have existed almost as long as the telegraph itself.</p><p>From [1]: &quot;Elaborate commercial codes which encoded complete phrases into single words were developed and published as codebooks of thousands of phrases and sentences with corresponding codewords...  Cable tolls were charged by the word, and telegraph companies counted codewords like any other words, so a carefully constructed code could reduce message lengths enormously.&quot;</p><p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Commercial_code_(communications)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Commercial_code_(communication...</a></p>","points":null,"parent_id":13149003,"story_id":13146315,"children":[{"id":13149312,"created_at_i":1481424417,"type":"comment","author":"johncolanduoni","text":"<p>Is D&amp;D set in a world where the telegraph exists? I&#x27;ve always gotten the impression that insofar as it&#x27;s linked to our history of technological progression it is set well before that invention, while after the times of e.g. the Caesar cipher.</p>","points":null,"parent_id":13149156,"story_id":13146315,"children":[{"id":13149474,"created_at_i":1481427672,"type":"comment","author":"my_first_acct","text":"<p>Good point.  So here is a compression scheme from about 350 BC, describing how to pass messages from one mountain peak to another, using a torch and a water clock [1][2]:</p><p>&quot;The water-clocks are an early long-distance-communication-system. Every communicating party had exactly the same jar, with a same-size-hole that was closed and the same amount of water in it. In the jar was a stick with different messages written on. When one party wanted to tell something to the other it made a fire-sign. When the other answered, both of them opened the hole at the same time. And with the help of another fire-sign closed it again at the same time, too. In the end the water covered the stick until the point of the wanted message.&quot;</p><p>[1] <a href=\"http:&#x2F;&#x2F;www.mlahanas.de&#x2F;Greeks&#x2F;Communication.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mlahanas.de&#x2F;Greeks&#x2F;Communication.htm</a></p><p>[2] <a href=\"http:&#x2F;&#x2F;www.mlahanas.de&#x2F;Greeks&#x2F;Technology&#x2F;AncientGreekTechnology028.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mlahanas.de&#x2F;Greeks&#x2F;Technology&#x2F;AncientGreekTechnol...</a></p>","points":null,"parent_id":13149312,"story_id":13146315,"children":[{"id":13154386,"created_at_i":1481501176,"type":"comment","author":"pavel_lishin","text":"<p>That&#x27;s incredibly clever.</p>","points":null,"parent_id":13149474,"story_id":13146315,"children":[]},{"id":13154420,"created_at_i":1481501531,"type":"comment","author":"kakarot","text":"<p>That is AWESOME. What an incredible feat of engineering.</p>","points":null,"parent_id":13149474,"story_id":13146315,"children":[]}]}]}]}]}]},{"id":13148569,"created_at_i":1481412658,"type":"comment","author":"Thiez","text":"<p>Well if players want to get pedantic, in typing, a word in &quot;words per minute&quot; in considered 4 or 5 characters, so as the DM, clearly it&#x27;s your prerogative to use that definition.</p>","points":null,"parent_id":13148394,"story_id":13146315,"children":[]},{"id":13148847,"created_at_i":1481416162,"type":"comment","author":"JulianMorrison","text":"<p>Speak in German?</p>","points":null,"parent_id":13148394,"story_id":13146315,"children":[{"id":13149751,"created_at_i":1481434297,"type":"comment","author":"darklajid","text":"<p>As a German: I feel that while this would potentially increase the average length of the words you &quot;send&quot;, it probably will keep or even decrease the amount of information transferred..</p>","points":null,"parent_id":13148847,"story_id":13146315,"children":[]}]}]},{"id":13148914,"created_at_i":1481417286,"type":"comment","author":"saycheese","text":"<p>Really enjoy running across this and in the process ran across a nice list of security games &amp; related resources:</p><p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13148899\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13148899</a></p>","points":null,"parent_id":13146315,"story_id":13146315,"children":[]}]},{"id":13148725,"created_at_i":1481414591,"type":"story","author":"sanimal","title":"The short, tormented life of computer genius Phil Katz (2000)","url":"http://www.bbsdocumentary.com/library/CONTROVERSY/LAWSUITS/SEA/katzbio.txt","text":null,"points":365,"children":[{"id":13174533,"created_at_i":1481702402,"type":"comment","author":"horatiocain","text":"<p>Jesus fucking Christ</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13149451,"created_at_i":1481427102,"type":"comment","author":"smarks","text":"<p>Very sad story. The guy&#x27;s initials are immortalized in the magic number of the zip file format, the bytes of which are</p><p><pre><code>    0x50 0x4b 0x03 0x04\n</code></pre>\nThe values 0x50 0x4b are &#x27;P&#x27; &#x27;K&#x27; in ASCII.</p><p>Note also that every Java JAR file is also a ZIP file, so they all begin with the same magic number.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13150778,"created_at_i":1481459099,"type":"comment","author":"DonHopkins","text":"<p>He&#x27;s also been immortalized in artwork:</p><p><a href=\"https:&#x2F;&#x2F;www.flickr.com&#x2F;photos&#x2F;silentarmy&#x2F;351314710\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flickr.com&#x2F;photos&#x2F;silentarmy&#x2F;351314710</a></p>","points":null,"parent_id":13149451,"story_id":13148725,"children":[]},{"id":13149771,"created_at_i":1481434710,"type":"comment","author":"WalterBright","text":"<p>Windows executables start with &quot;MZ&quot;, for Mark Zbikowski.</p><p>Edit: fixed the name</p>","points":null,"parent_id":13149451,"story_id":13148725,"children":[{"id":13150730,"created_at_i":1481458215,"type":"comment","author":"agumonkey","text":"<p>More recently I found out that systemd binary format starts with LPKS and a few other initials. Those who know the dev team can easily find which is who.</p>","points":null,"parent_id":13149771,"story_id":13148725,"children":[]},{"id":13150053,"created_at_i":1481442041,"type":"comment","author":"gonzo","text":"<p>FreeBSD (and other BSD) UFS2 file systems have a magic number that coincides with Kirk McKusick&#x27;s birthday.</p><p>#define FS_UFS2_MAGIC 0x19540119</p>","points":null,"parent_id":13149771,"story_id":13148725,"children":[{"id":13151167,"created_at_i":1481466216,"type":"comment","author":"JdeBP","text":"<p>The birthdays of Linus Torvalds and some of his relatives are encoded, in hexadecimal, in the magic constants passed to the Linux reboot() system call.</p>","points":null,"parent_id":13150053,"story_id":13148725,"children":[]}]},{"id":13149804,"created_at_i":1481435840,"type":"comment","author":"uiri","text":"<p>I tried googling this but nothing came up until I stumbled across <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;DOS_MZ_executable\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;DOS_MZ_executable</a> which says it stands for <i>Mark Zbikowski</i> (which is supported by a quick Google of that name).</p>","points":null,"parent_id":13149771,"story_id":13148725,"children":[{"id":13149850,"created_at_i":1481437011,"type":"comment","author":"WalterBright","text":"<p>You&#x27;re right, I mis-remembered it. Thanks for the correction!</p>","points":null,"parent_id":13149804,"story_id":13148725,"children":[]}]},{"id":13152931,"created_at_i":1481487337,"type":"comment","author":"bluedino","text":"<p>As a kid poking around with the built-in DOSSHELL hex viewer, I thought it was slang for MS&#x2F;Microsoft</p>","points":null,"parent_id":13149771,"story_id":13148725,"children":[]}]}]},{"id":13149220,"created_at_i":1481422584,"type":"comment","author":"mwcampbell","text":"<p>I wonder how he would have reacted if he had lived to see the integration of his ZIP file format into Windows itself, starting with Windows XP in 2001.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13162044,"created_at_i":1481577816,"type":"comment","author":"cuckcuckspruce","text":"<p>I don&#x27;t think he&#x27;d have a problem with it considering he released the specification for the Zip format freely[1].</p><p>[1] <a href=\"https:&#x2F;&#x2F;pkware.cachefly.net&#x2F;webdocs&#x2F;casestudies&#x2F;APPNOTE.TXT\" rel=\"nofollow\">https:&#x2F;&#x2F;pkware.cachefly.net&#x2F;webdocs&#x2F;casestudies&#x2F;APPNOTE.TXT</a></p>","points":null,"parent_id":13149220,"story_id":13148725,"children":[]}]},{"id":13148973,"created_at_i":1481418233,"type":"comment","author":"throwitaway83","text":"<p>As someone who is in recovery, this story always hits close to home. The anxiety, guilt, and paranoia that comes with addiction is brutal. I was on the verge on losing everything including two young daughters.  What a fucking horrible disease.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13148981,"created_at_i":1481418366,"type":"comment","author":"maxander","text":"<p>A tragic tale, and a reminder that intelligence and business success are no replacement for mental health.</p><p>Even in the BBC&#x27;s account, the tone of the writing seems to present a lot of warning signs and developing problems as just a genius&#x27; wacky eccentricities.  If you require substances in order to function, can&#x27;t maintain social relationships or struggle with harmful lifestyles, these aren&#x27;t mere character traits, they&#x27;re symptoms of real and treatable illnesses.  Presenting these things as &quot;the dark side of being smart&quot; is a popular story, but its harmful in the long run.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13150572,"created_at_i":1481454863,"type":"comment","author":"agumonkey","text":"<p>Something like 10 years ago I heard about a book called emotional intelligence. That title shocked me. Few people told me everything that they found hard was easy for me, while everything that was easy for them was hard for me. There&#x27;s a lot of knowledge about the emotional, or socio-affective, space that&#x27;s worth not ignoring. Sadly society kinda put &quot;wit&quot; over &quot;wise&quot; and I, maybe others, fell in the brainiac race trap.</p>","points":null,"parent_id":13148981,"story_id":13148725,"children":[]},{"id":13149093,"created_at_i":1481420273,"type":"comment","author":"pcl","text":"<p>The article is not affiliated with the BBC -- it&#x27;s published on bbsdocumentaries.com.</p>","points":null,"parent_id":13148981,"story_id":13148725,"children":[{"id":13149277,"created_at_i":1481423754,"type":"comment","author":"maxander","text":"<p>Oops, good catch- one letter makes a substantial difference!</p><p>Should have wondered why a BBC documentary was being presented in plaintext format, anyway...</p>","points":null,"parent_id":13149093,"story_id":13148725,"children":[]}]}]},{"id":13148991,"created_at_i":1481418508,"type":"comment","author":"Animats","text":"<p>Short version: alcohol.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13148998,"created_at_i":1481418618,"type":"comment","author":"andrewguenther","text":"<p>I think that&#x27;s a bit of an insensitive summary.</p>","points":null,"parent_id":13148991,"story_id":13148725,"children":[{"id":13149020,"created_at_i":1481419104,"type":"comment","author":"cgvgffyv","text":"<p>Seems to be what all commenters above are focusing on though.</p><p>(and thus completely miss the point)</p>","points":null,"parent_id":13148998,"story_id":13148725,"children":[]},{"id":13149040,"created_at_i":1481419482,"type":"comment","author":"user5994461","text":"<p>I think it&#x27;s a good summary nonetheless. Short, to the point, and may not have to read the article after it.</p>","points":null,"parent_id":13148998,"story_id":13148725,"children":[]}]},{"id":13149024,"created_at_i":1481419229,"type":"comment","author":"emmelaich","text":"<p>A more poignant and better takeaway:</p><p><pre><code>    &quot;It tore him up inside when his father died. One\n    time we went to his grave,&quot; Fischer says. &quot;He&#x27;d always\n    say that when his father was alive they&#x27;d go fishing\n    and do man things.&quot;</code></pre></p>","points":null,"parent_id":13148991,"story_id":13148725,"children":[{"id":13149663,"created_at_i":1481432437,"type":"comment","author":"reddytowns","text":"<p>I&#x27;d say that parent is more accurate and that is the sanitized version...</p>","points":null,"parent_id":13149024,"story_id":13148725,"children":[{"id":13151533,"created_at_i":1481471545,"type":"comment","author":"emmelaich","text":"<p>If you must, I think it is more about the underlying cause versus the immediate cause.</p><p>Of course you speculate whether he would have been an alcoholic if he hadn&#x27;t had a lonely childhood and hadn&#x27;t\nhad someone so close to him that died.</p>","points":null,"parent_id":13149663,"story_id":13148725,"children":[{"id":13153758,"created_at_i":1481495169,"type":"comment","author":"reddytowns","text":"<p>There is no &quot;underlying cause&quot; that can definitely pointed to, that&#x27;s just hubris. You can&#x27;t know that if those things didn&#x27;t happen he wouldn&#x27;t have still become someone who would drink themselves to death, or that if something else happened, such as becoming devoutly religious, he might have been able to avoid it.</p>","points":null,"parent_id":13151533,"story_id":13148725,"children":[{"id":13153825,"created_at_i":1481495843,"type":"comment","author":"emmelaich","text":"<p>Of course one cannot be sure that it is the underlying cause.</p><p>That&#x27;s what my second sentence alludes to.</p>","points":null,"parent_id":13153758,"story_id":13148725,"children":[]}]}]}]}]},{"id":13149179,"created_at_i":1481422000,"type":"comment","author":"jfoutz","text":"<p>Lincoln, Hitler, Cobain, Lennon.\nShort version: bullet.</p><p>In seems a person&#x27;s whole life can be summed up by the one thing that killed them. I never really thought of it that way before. Interesting insight.</p>","points":null,"parent_id":13148991,"story_id":13148725,"children":[{"id":13149228,"created_at_i":1481422842,"type":"comment","author":"xivusr","text":"<p>I&#x27;m so happy that none of us - not even you - are merely our &#x27;cause of death&#x27;.</p>","points":null,"parent_id":13149179,"story_id":13148725,"children":[{"id":13149266,"created_at_i":1481423577,"type":"comment","author":"jfoutz","text":"<p>Hmm. I thought my condescension was over the top. Guess i was too subtle.</p>","points":null,"parent_id":13149228,"story_id":13148725,"children":[{"id":13149440,"created_at_i":1481426919,"type":"comment","author":"xivusr","text":"<p>OMG. \nI&#x27;m an idiot. \nI&#x27;ll just leave this here, lol</p>","points":null,"parent_id":13149266,"story_id":13148725,"children":[{"id":13150287,"created_at_i":1481447738,"type":"comment","author":"jfoutz","text":"<p>No, no worries. it happens to the best of us. I&#x27;ve been suckered in by a zillion trolls. Good on you for leaving the (edited) comment up.</p>","points":null,"parent_id":13149440,"story_id":13148725,"children":[]}]},{"id":13149433,"children":[]}]}]}]}]},{"id":13148992,"created_at_i":1481418520,"type":"comment","author":"babbage12","text":"<p>I just lost my best mate from university to alcohol. Growing up in Britain, this is not my first friend I&#x27;ve lost because of alcohol. I&#x27;m in tears... I&#x27;ve struggled with drinking too much myself, this hits very close to home.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149455,"created_at_i":1481427192,"type":"comment","author":"protomyth","text":"<p>My condolences and hope.  It is the same story on all too many reservations in the US.  I&#x27;ve remarked that I&#x27;ve attended more funerals than weddings and watching the spiral of others without regard to actions taken to help them is soul killing.</p><p>As hard as it gets, you can only save yourself.  You can throw as many lifelines as there are stars in the sky, but it doesn&#x27;t guarantee they will be caught or even acknowledged.  I sometimes wonder how much growing up on sitcoms and their solved in 30 minutes solutions have given us unrealistic expectations in real life.</p><p>As a friend who watched too much British TV[1] in college said to me: save yourself if for no other reason so you&#x27;re not a selfish twat who caused everyone else pain.</p><p>1) college where students learn about Monty Python and Pink Floyd.</p>","points":null,"parent_id":13148992,"story_id":13148725,"children":[]},{"id":13150065,"created_at_i":1481442295,"type":"comment","author":"jwdunne","text":"<p>Brit here too. I feel your pain. I&#x27;m not a drinker but my parents are. It&#x27;s getting more and more excessive. I&#x27;ll find litres of whiskey hone in a sitting.</p><p>The drink has ruined my relationship with them.</p><p>When I was a teenager, me and my sister suffered from psychosis. They blamed their drinking on that. When we got better, they continued and found a different scapegoat.</p><p>My sister is going through children&#x27;s mental health services. My parents don&#x27;t seem to understand that wrestling tablets from my mother attempting suicide is traumatic for a child. This is really messing up my sister.</p><p>When I spoke to my dad about my sister&#x27;s problems, his response was &quot;I&#x27;m not giving up my life for some 15 year old&quot;</p><p>Over the years, I&#x27;d get nasty text messages. Anything from long essays on why my birthday gift wasn&#x27;t adequate to how my choice of partner isn&#x27;t adequate (my partner demands that the kids don&#x27;t have cordial - my mother disagrees). Years of that plus childhood has made me feel inadequate.</p><p>Alcoholism doesn&#x27;t just screw over the drinker but the family too. Sometimes it&#x27;s not just the pain of watching them fall.</p>","points":null,"parent_id":13148992,"story_id":13148725,"children":[{"id":13150689,"created_at_i":1481457279,"type":"comment","author":"SiVal","text":"<p>I have no idea whether this will help at all, but after staring at it for a while, I decided I had to try. I think it&#x27;s VERY likely that a craving for a chemical such as alcohol or various drugs is learned by the brain and shares a property with such things as language learning, which is that early learning plants it deeply and indelibly in a rapidly developing brain--making it essentially native to the brain&#x27;s structure--while late learning is relatively superficial.</p><p>Based on what I&#x27;ve seen, those who wait to start drinking until well into adulthood have brains that are MUCH more resistant to alcoholism.</p><p>The implication for you, then, is that if you can&#x27;t get your sister to just join you in being a non-drinker, then at least persuade her to procrastinate her drinking as many years as possible and use the language-learning analogy if it helps: the LAST thing you want to do is become a &quot;native drinker&quot;. You want it to be something always a little foreign and unnatural to your brain so you can push it away entirely should you ever choose to do so.</p><p>Again, this might be of no use to you in your personal situation (and sorry I can&#x27;t be more useful), but if there&#x27;s any way you can get her to wait until after college&#x2F;university age, she won&#x27;t be completely safe (no drinker is), but she will have MUCH more power than she has now.</p>","points":null,"parent_id":13150065,"story_id":13148725,"children":[{"id":13155426,"created_at_i":1481515355,"type":"comment","author":"pmoriarty","text":"<p>There&#x27;s an interesting book by Jack London, &quot;John Barleycorn&quot;[1], which is about his battle with alcoholism.  He didn&#x27;t start drinking in earnest until he was 25, though he tried (and absolutely hated) alcohol earlier.</p><p>An interesting read, and recommended for one very talented person&#x27;s view on alcoholism.</p><p>[1] - <a href=\"https:&#x2F;&#x2F;librivox.org&#x2F;john-barleycorn-or-alcoholic-memoirs-by-jack-london&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;librivox.org&#x2F;john-barleycorn-or-alcoholic-memoirs-by...</a></p>","points":null,"parent_id":13150689,"story_id":13148725,"children":[]},{"id":13151108,"created_at_i":1481465130,"type":"comment","author":"jwdunne","text":"<p>Thank you very much for your insight :)</p><p>Unfortunately too late. My sister has had her first drink a year or so ago. She was 14 iirc. I had mine at 11 - 12.</p><p>We can shun alcohol. I have a bottle of Jaeger in the fridge untouched. I got it last Christmas.</p><p>In effect, being stupid with it when I was a kid made me realise I have a point where it isn&#x27;t pleasant at all. It also made me realise that I hate the idea of me under the influence - I hate feeling like a fucking idiot.</p><p>That plus the damage it has done through other means has left me a non-drinker. If alcohol became a class A substance tomorrow and the day after consuming it was punishable by summary death, I would not care (except maybe about a right wing govt). I wouldn&#x27;t give a shit about losing booze.</p><p>I also have young children. If I won&#x27;t jump in a car after 1 drink, how can I look after my kids? What if one wakes up?</p>","points":null,"parent_id":13150689,"story_id":13148725,"children":[]}]}]},{"id":13149097,"created_at_i":1481420366,"type":"comment","author":"PaulRobinson","text":"<p>As somebody who has watched people struggle and seen them fail and succeed, I can relate. Also a Brit, also like a pint. Helped people who were hitting the alcho-pops at 8am (doesn&#x27;t smell like booze on the breath, see?).</p><p>I&#x27;m p7r on twitter and reddit. If you ever want to chat, let me know, I&#x27;ll follow you back, we can DM, or just PM me on reddit. It&#x27;s a sincere offer: I hope in the morning you&#x27;re feeling more optimistic and know you&#x27;re not alone and there are people who give a fuck.</p><p>The things that make us able to do amazing things are also the things that make us do terrible things to ourselves. We should talk about that more as a community.</p>","points":null,"parent_id":13148992,"story_id":13148725,"children":[{"id":13149500,"created_at_i":1481428275,"type":"comment","author":"icantdrive55","text":"<p>I&#x27;ve stopped and failed drinking too many times to count.</p><p>My psychiatrist told me flat out, &quot;Don&#x27;t even try to stop on you&#x27;re own.  It&#x27;s just too f---ing dangerous.&quot;  I used that terrible advice for years.  I kept on drinking.</p><p>I went to A.A., and just coudn&#x27;t stomach it, on so many levels.</p><p>I wasen&#x27;t going to spend my last $15 grand on a expensive rehab.</p><p>I did taper off around ten years ago.  It took a few weeks.  I knew it would be dangerous to just stop.  I did everything the experts told me not to do; like have alcohol around the house, and hang around people who drink.</p><p>We all drink for different reasons.  I felt I was drinking to control my anxiety; and much of the time I was self-medicating.  I tapered down to a few drinks a day--I finally got down to one, or no drinks.</p><p>My point is if anyone reading this is trying to stop drinking, and the status quo advice just isn&#x27;t working, if I could taped down, I honestly think most people can.</p><p>(Try not to drink hard alcohol.  That really did a number on my body.  When I went back to wine, and beer; It was only then could I begin to even think about tapering down to no drinks.  I&#x27;m not giving advice.  I&#x27;m just stating what worked for me.  I really thought I was hopeless.  My father, and grandfather both died from liver tumors that metastasized into cancer.  Both were big drinkers.  I didn&#x27;t think I had a chance in hell.  Plus--I had a nervous breakdown in graduate school, which turned into generalized anxiety.  I still drink, but it&#x27;s not much. I&#x27;m not the bloated mess I used to be.  My life is still not great, but it&#x27;s not due to alcohol.)</p>","points":null,"parent_id":13149097,"story_id":13148725,"children":[]}]},{"id":13155522,"created_at_i":1481516592,"type":"comment","author":"prefectlyWrong","text":"<p>I understand your struggle with grief, and would enjoy chatting over a cuppa if you&#x27;re ever up for it with a bloke from the other side of the pond. If I never hear from you, that&#x27;s ait too, but am here if need be, young man.</p>","points":null,"parent_id":13148992,"story_id":13148725,"children":[]}]},{"id":13149006,"created_at_i":1481418716,"type":"comment","author":"ino","text":"<p>I remember reading this a few years ago, and it touched me as it is touching me now again.</p><p>I don&#x27;t remember computers without pkzip&#x2F;pkunzip. They&#x27;ve always been around, many copies on floppies containing games and other software, maybe just in case someone ever found a computer without them.</p><p>My school computers also had them, and we quickly learned there wasn&#x27;t any benifit of compressing a compressed file. We had pointless discussions about comparisons with arj and rar without even knowing how they worked.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13149016,"created_at_i":1481419009,"type":"comment","author":"isuckatcoding","text":"<p>Wow that was difficult to read. Not that I&#x27;m an alcoholic but I can relate to some of the things he was going through.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149569,"created_at_i":1481429892,"type":"comment","author":"imdsm","text":"<p>Yeah, read it about 3 or 4 times now, and it always seems to be late at night (UK here) when I read it. Here I am, while my family sleeps, working away in the quiet solitude of night. Luckily though, I&#x27;m drinking tea, not alcohol.</p>","points":null,"parent_id":13149016,"story_id":13148725,"children":[]}]},{"id":13149287,"created_at_i":1481423978,"type":"comment","author":"dispose13432","text":"<p>Off topic, but what was so special about the &quot;zip&quot; file over a &quot;.tar.Z&quot; file, especially that it already existed when ZIP came out?</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149450,"created_at_i":1481427089,"type":"comment","author":"GFK_of_xmaspast","text":"<p>In the early&#x2F;mid 90s I remember looking pretty hard for a tar utility for dos and never found one.</p>","points":null,"parent_id":13149287,"story_id":13148725,"children":[]},{"id":13149308,"created_at_i":1481424390,"type":"comment","author":"walrus01","text":"<p>PKZIP was a msdos oriented format (in the pre windows 98 era) and used extensively by millions of people who never saw a tar file. Long before windows 95 shipped, even. If you had a dos PC running 3.3,4.10 or 5.0 it was the near defacto choice.</p>","points":null,"parent_id":13149287,"story_id":13148725,"children":[]},{"id":13149311,"children":[]},{"id":13149315,"created_at_i":1481424453,"type":"comment","author":"duskwuff","text":"<p>- It had a table of contents. You can list the contents of a ZIP file, or even extract individual files, without having to decompress the whole thing. (Which was a particularly big deal back in the 90s, when extracting a large archive would take a while.)</p><p>- You could update an archive in place. Not incredibly useful, but certainly nifty.</p><p>- It had support for multi-disk archives. Again, big deal in the 90s.</p><p>Finally, last but not least: it existed in the PC world. Ports of software between UNIX and PC systems were rare back then, and were made more difficult by the fact that the software would have to run in a segmented (16-bit) x86 environment.</p>","points":null,"parent_id":13149287,"story_id":13148725,"children":[{"id":13150797,"created_at_i":1481459454,"type":"comment","author":"DonHopkins","text":"<p>And AT&amp;T could go after you for stealing their Unix utility source code, who at the time had a huge legal department with a hell of a lot of lawyers.</p>","points":null,"parent_id":13149315,"story_id":13148725,"children":[]},{"id":13149532,"created_at_i":1481428981,"type":"comment","author":"dguaraglia","text":"<p>This is the perfect answer. The fact that you could split zip files across several diskettes was <i>huge</i>.</p>","points":null,"parent_id":13149315,"story_id":13148725,"children":[]},{"id":13150327,"created_at_i":1481448762,"type":"comment","author":"ino","text":"<p>Let me add ZIP2EXE for self-extracting archives.</p>","points":null,"parent_id":13149315,"story_id":13148725,"children":[]},{"id":13152950,"created_at_i":1481487516,"type":"comment","author":"bluedino","text":"<p>And even if you had a UNIX tar.z file, chances are the data would be in big endian, have UNIX line endings, and you&#x27;d have to do all kinds of wizardry to use the file on a PC running DOS&#x2F;Windows</p>","points":null,"parent_id":13149315,"story_id":13148725,"children":[]},{"id":13151208,"created_at_i":1481466818,"type":"comment","author":"JdeBP","text":"<p>Actually, that&#x27;s second last.  Last, but not least is that <i></i>.tar.Z did not fit the 8.3 uppercase-only filename structure; nor did the Unix semantics that <i></i>.Z was one sort of compression and <i></i>.z another.</p>","points":null,"parent_id":13149315,"story_id":13148725,"children":[]}]},{"id":13151124,"created_at_i":1481465421,"type":"comment","author":"syntheticnature","text":"<p>One thing I don&#x27;t see mentioned, though the other reasons are fairly valid -- the &#x27;deflate&#x27; compression that was actually a non-backwards compatible update to PKZIP was superior to &#x27;compress&#x27; -- gzip uses it, though not the PKZIP format.</p><p>There was for a good while a bit of a &quot;compression arms race&quot; with folks looking to find the most optimal compression to save precious time on BBS dial-up. For a while &#x27;ZIP&#x27; won, then &#x27;ARJ&#x27; managed to squeeze out a bit more, and so on -- though I think diminishing returns kept things from going too far beyond ZIP&#x2F;ARJ on many BBSes.</p>","points":null,"parent_id":13149287,"story_id":13148725,"children":[]},{"id":13149347,"created_at_i":1481425089,"type":"comment","author":"zznneezznnee","text":"<p>I imagine it was just a product of UNIX&#x2F;academia being somewhat isolated from the general public&#x2F;BBS world.  Before GNU&#x2F;Linux basically nobody using PCs had access to UNIX-like systems, and probably wouldn&#x27;t have known of tar&#x27;s existence.</p><p>My older sibling exposed me to tar indirectly by granting me access to their university-provided dialup UNIX account where they ran `elm` for email access, and this happened long after I had been using BBSs for years with my PC.</p><p>Never saw a tar file in all my years of PC-based BBS usage.  GNU&#x2F;Linux and Freebsd are largely responsible for the general public accessing *NIX-like systems.  BBSs (and their file sharing) were a thing before those existed.</p>","points":null,"parent_id":13149287,"story_id":13148725,"children":[{"id":13151130,"created_at_i":1481465490,"type":"comment","author":"digi_owl","text":"<p>The whole mainframe world was massively insular, and thus the micro&#x2F;PC world basically had to invent gunpowder all over again. You can see it play out too this day.</p>","points":null,"parent_id":13149347,"story_id":13148725,"children":[]},{"id":13151464,"created_at_i":1481470658,"type":"comment","author":"JdeBP","text":"<p>Actually, plenty of people had access to UNIX-like systems.  There was XENIX, for example, described by some histories as &quot;the most widely installed base of any Unix distribution&quot; of its time.</p><p>XENIX is too often forgotten, as is the fact that the Unix world had its &quot;archiver wars&quot;, too.  In this case it was tar versus cpio, with the POSIX standardization effort settling on &quot;pax&quot;, the pun in whose name is reportedly not a coincidence.</p>","points":null,"parent_id":13149347,"story_id":13148725,"children":[]}]}]},{"id":13149289,"created_at_i":1481424014,"type":"comment","author":"shortformblog","text":"<p>One of the most heartbreaking stories of of the tech world, and one that comes with a lot of bad blood. Be sure to watch Jason Scott&#x27;s documentary clip on the ARC vs PKARC battle:</p><p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YiaM5MT1Ok8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YiaM5MT1Ok8</a></p><p>I admit that I&#x27;ve always wondered what a dramatic film based on this story would look like. It has all of the highs and lows of a movie, and it would be worth retelling for both the lessons it has to teach but also the important role in computer history Katz held.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149729,"created_at_i":1481433679,"type":"comment","author":"zznneezznnee","text":"<p>Thanks for sharing this link, in lieu of watching that I wouldn&#x27;t have had any idea Phil stole SEA&#x27;s code to create pkarc&#x2F;pkzip.</p><p>I still remember running the self-extracting pkz204g.exe on MS-DOS, and never heard of SEA or encountered their software.  That&#x27;s really unfortunate.</p>","points":null,"parent_id":13149289,"story_id":13148725,"children":[{"id":13151391,"created_at_i":1481469584,"type":"comment","author":"shortformblog","text":"<p>I don&#x27;t disagree with you on this, but I just want to clarify something: Katz ripped off ARC, that much is clear. But on the other hand, ZIP was a brand-new format that had some differences from ARC. Among those differences is that Katz made the format open, something SEA hadn&#x27;t done with ARC. This helped ensure its broad uptake as a de facto standard that&#x27;s still used to this day.</p><p>I don&#x27;t think what Katz did in SEA saga is worth defending, but I think we have to delineate the two formats. As Phil Becker of eSoft says in the clip, the reason that Katz&#x27;s software ultimately won out was that he was more adept as a businessman—and the open nature of the ZIP format was a good example of that.</p>","points":null,"parent_id":13149729,"story_id":13148725,"children":[{"id":13151606,"created_at_i":1481472376,"type":"comment","author":"derekp7","text":"<p>Don&#x27;t forget, that this was also in the middle of the various look-and-feel lawsuits that were going on at the time.  Lotus vs. Paperback Software, Lotus vs. Borland, Apple vs. Microsoft, Stac Electronics vs. Microsoft, etc.</p><p>Also, remember that PKarc was popular because it was faster than Arc.  The feeling in the BBS community at the time were feeling a bit of rage, that a superior product was being killed through the courts.  So when PKzip came out, which was not only faster, but had a better compression ratio, combined with the general sentiment in the community that were fed up with look-and-feel lawsuits, doing a mass conversion from arc to zip was also a form of public protest.</p>","points":null,"parent_id":13151391,"story_id":13148725,"children":[]}]}]},{"id":13149475,"created_at_i":1481427690,"type":"comment","author":"Assembly64","text":"<p>Seems like Phil Katz literally stole code from ARC, so much for being a genius.</p>","points":null,"parent_id":13149289,"story_id":13148725,"children":[]},{"id":13162021,"created_at_i":1481577632,"type":"comment","author":"cuckcuckspruce","text":"<p>The linked file is a companion to the wonderful BBS Documentary.</p>","points":null,"parent_id":13149289,"story_id":13148725,"children":[]},{"id":13149611,"created_at_i":1481431002,"type":"comment","author":"hyperpallium","text":"<p>I feel most sorry for Tom Henderson, esp at 20:20 claiming he&#x27;s over it.</p><p>Low barriers to entry make software easy to get into... and easy for your replacement to get into. It seems <i>software</i> businesses aren&#x27;t common any more for that reason (excepting MS).</p>","points":null,"parent_id":13149289,"story_id":13148725,"children":[{"id":13150693,"created_at_i":1481457351,"type":"comment","author":"philjohn","text":"<p>They are, it&#x27;s just rather than installing the software locally, you access it as a service.</p><p>And games, games developers are still software companies, albeit in the entertainment space.</p>","points":null,"parent_id":13149611,"story_id":13148725,"children":[{"id":13151268,"created_at_i":1481467795,"type":"comment","author":"digi_owl","text":"<p>And games have largely turned into a service as well.</p><p>I got two games as a gift recently, and at least one of them require a big download to even function. And both require that i register them with steam before i can play them at all.</p><p>Effectively even &quot;offline&quot; games have just become a client to a &quot;service&quot; running in the clouds.</p>","points":null,"parent_id":13150693,"story_id":13148725,"children":[]},{"id":13150941,"created_at_i":1481462380,"type":"comment","author":"hyperpallium","text":"<p>Aren&#x27;t most SaaS&#x27;s not pure software, but sell data, communication or offline product&#x2F;service, and in that way differ from installed software?</p><p>The difficult programming in games seems mostly deferred to engines (which are becoming cheaper and nore commoditized), and the game is mostly &quot;content&quot; - more akin to a movie than software. But you&#x27;re right, games are software, and are thriving.</p>","points":null,"parent_id":13150693,"story_id":13148725,"children":[]}]}]}]},{"id":13150571,"created_at_i":1481454829,"type":"comment","author":"boot13","text":"<p>Literally the first letter of this is a typo. Sad story though.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13149037,"children":[]},{"id":13149299,"created_at_i":1481424212,"type":"comment","author":"orionblastar","text":"<p>I lost sone friends the same way, alcoholism and mental illnesses seem to be common in my generation. I lost my best friend in 1999 when he bought a shotgun and ended his life. I tried to do all I could to help him but he shut me and everyone out for months until he killed himself.</p><p>I&#x27;ve been suicidal myself. It is something not talked out, but it needs to be talked about eventually. Suicide is taking some of the best out of this industry and stress and depression and anxiety mixed with drugs and&#x2F;or alcohol can lead to these weird behaviors and then suicide unless they are lucky enough to get professional help and the right psychiatrist and medicine and therapy.</p><p>I&#x27;m on disability and can&#x27;t work yet, and I have to learn how to program all over again with different languages as what I know is so outdated except for theories.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13149556,"created_at_i":1481429549,"type":"comment","author":"known","text":"<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Phil_Katz\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Phil_Katz</a></p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13150849,"created_at_i":1481460549,"type":"comment","author":"aryehof","text":"<p>A sad outcome. I will more remember Phil Katz for brazenly copying SEA code to create the basis for his initial success - PKARC. His greatest achievement in my opinion was succeeding in convincing a whole community of programmers, that he was the victim, and not &quot;evil&quot; SEA.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13150106,"created_at_i":1481443659,"type":"comment","author":"dispose13432","text":"<p>Also, as far as I know the ZIP file format wasn&#x27;t patented.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13150243,"created_at_i":1481446892,"type":"comment","author":"transitorykris","text":"<p>File format no, compression yes <a href=\"https:&#x2F;&#x2F;www.google.com&#x2F;patents&#x2F;US5051745\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;patents&#x2F;US5051745</a></p>","points":null,"parent_id":13150106,"story_id":13148725,"children":[]}]},{"id":13149087,"children":[]},{"id":13149089,"created_at_i":1481420179,"type":"comment","author":"blinkingled","text":"<p>For some people conscious existence is too burdensome, uncomfortable, full of anxiety, outright maddening or some combination thereof. You see this in everyday life too, albeit in benign quantities - watch a kid after you tell him he can do nothing for the next hour.</p><p>I had read Phil Katz&#x27;s story before and I read it again today - it wasn&#x27;t any less painful the second time around. I think if we were to debug it - there doesn&#x27;t seem to be any one unmistakable conclusion, rather a combination. It would all depend on how severely one reacts to their emotional trauma. Some people are numbed, some are able to move on, some find healthy diversions in hobbies, people, achievements and some like Phil just plain fail to function well and have to resort to drugs and alcohol in order to run away from the living nightmare. I think at some point existence becomes rather more painful than death for some - that&#x27;s the only way you&#x27;re able to kill yourself without regard.</p><p>Humans are puzzling as a species - all the years of conditioning, the everyday conflicts and contradictions we have to face, the constant need for asserting our existence through external means, the need for relations, the child&#x2F;parent and then spouse systems and all the things that can go wrong with them, all the other uncertainties - amazingly many live through this but some just can&#x27;t escape the dread.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149827,"created_at_i":1481436499,"type":"comment","author":"babbeloski","text":"<p>&gt; For some people conscious existence is too burdensome, uncomfortable, full of anxiety, outright maddening or some combination thereof.</p><p>Reading this gives me immediate anxiety. I have times during the day where just seeing things and being alive is almost unreal, like I can&#x27;t deal with, and the thought of doing this for N number of years more is overwhelming. As I&#x27;m getting older life is just even more surreal, I sometimes wonder if I have the mental fortitude to make it to old age. This isn&#x27;t a cry for help, you just touched a nerve with that sentence.</p>","points":null,"parent_id":13149089,"story_id":13148725,"children":[{"id":13150994,"created_at_i":1481463478,"type":"comment","author":"iampherocity","text":"<p>Phew, I&#x27;m not alone.  Word for word, to the letter.</p>","points":null,"parent_id":13149827,"story_id":13148725,"children":[{"id":13151166,"created_at_i":1481466193,"type":"comment","author":"eternalban","text":"<p>Probably more common than you think.</p><p>One old saw has it that when a man is starving he forgets even the urgent promptings of a full bladder. A newer old saw claims that religion is the opiate of the masses (with its uncoined analog regarding fetishism &amp; the ruling classes).</p><p>The quoted OP railed against wasted time and effort, but his views on the despiritualization of the modern man are not clear. A non contemporary would likely diagnose a &#x27;spiritual crisis&#x27; for the existential angst of the uncommon non-aristocratic unbelieving modern man.</p>","points":null,"parent_id":13150994,"story_id":13148725,"children":[]}]},{"id":13159066,"created_at_i":1481559015,"type":"comment","author":"thomble","text":"<p>You&#x27;re not alone. I sometimes wake up at night, with a sudden realization and shock that I am existing.</p>","points":null,"parent_id":13149827,"story_id":13148725,"children":[]}]},{"id":13149343,"created_at_i":1481425035,"type":"comment","author":"writeslowly","text":"<p>Your comment reminded me of an essay George Scialabba wrote a couple years ago, &quot;The Endlessly Examined Life&quot; [1], where the author gathered over 40 years of mental health records from his therapists (mostly seeking treatment for depression and anxiety), unable to draw a real conclusion</p><p>&gt;<i>I am as puzzled and frustrated by the above records, and by the rest of my psychiatric file, as any casual reader could be. So much earnest effort, so much expert knowledge, so little success. The world’s most common disease is still this opaque.</p><p>Having read half a dozen compelling depression memoirs—Styron, Jamison, Millett, Solomon, Kaysen, McMurtry—I was skeptical, when The Baffler proposed publishing extracts from my file, that there was much more to say. Maybe there isn’t, at least not in that register. But maybe it’s enough just to keep talking.</i></p><p>[1] <a href=\"http:&#x2F;&#x2F;thebaffler.com&#x2F;salvos&#x2F;endlessly-examined-life\" rel=\"nofollow\">http:&#x2F;&#x2F;thebaffler.com&#x2F;salvos&#x2F;endlessly-examined-life</a></p>","points":null,"parent_id":13149089,"story_id":13148725,"children":[{"id":13151960,"children":[]}]},{"id":13150122,"created_at_i":1481443954,"type":"comment","author":"sametmax","text":"<p>+1. It took meditation to make me realize how much we suffer and react to it without realizing it a such a regular basis. It is so part of the everyday life, and anybody does so: children, adults, old people, rich, poor, healthy, sick, etc. We manage to feel that  &quot;conscious existence is too burdensome, uncomfortable, full of anxiety, outright maddening or some combination thereof&quot; in any context, which is a hint that we, as a specie, are part of the problem. And we invent so many ways to distract ourself to avoid feeling it we became masters at it. Some never master it, and instead of hiding the dirt under the carpet, they decide to leave home for good.</p>","points":null,"parent_id":13149089,"story_id":13148725,"children":[{"id":13152202,"created_at_i":1481479502,"type":"comment","author":"rjbwork","text":"<p>I don&#x27;t think it inherent to the species, just to the way we&#x27;ve organized society.  Only the privileged few among us truly get to self-actualize - to become our true selves and leave our marks upon the world before fading into oblivion a scant 8 decades after our arrival.</p><p>It is no wonder then that so many find a life of ultimately meaningless toil and distraction so dreadful, and akin to those words by OP.</p>","points":null,"parent_id":13150122,"story_id":13148725,"children":[{"id":13152985,"created_at_i":1481487823,"type":"comment","author":"bitexploder","text":"<p>I think it a great delusion to asscoiate self-actualization with privelege and leaving a mark on the world. It is the grandiose fiction playing out in the minds of many to design that a true self must leave a mark upon &quot;the world&quot;. What a dependency. Truth is our brains are complex little machines composed of smaller machines cooperating and at times fighting for the primacy of resources. We exist. Creators create. Let that be enough. Judgment and opinion of our creation is largely beyond us. A person of no privilege can know his existence the same as one of great privilege. The mind is always obscuring reality with its machinery, noisy with the remnants of evolution. See past it friend.</p>","points":null,"parent_id":13152202,"story_id":13148725,"children":[]},{"id":13152986,"children":[]}]},{"id":13172946,"created_at_i":1481677909,"type":"comment","author":"taternuts","text":"<p>Anything in particular that made you start? I know meditation would be helpful to me, I&#x27;ve known it for years, I just can&#x27;t seem to bring myself to start for some reason</p>","points":null,"parent_id":13150122,"story_id":13148725,"children":[{"id":13174566,"created_at_i":1481703281,"type":"comment","author":"sametmax","text":"<p>Curiosity. I asked Buddhist friends if they heard about a technic I could use without the religious part, no mantra, book or shrine since I&#x27;m an atheist. There are many of them.</p>","points":null,"parent_id":13172946,"story_id":13148725,"children":[]}]}]},{"id":13152193,"created_at_i":1481479402,"type":"comment","author":"hiddenname","text":"<p>This is me.  I know madness and it&#x27;s horrible, it&#x27;s not scary it&#x27;s an emotion of pure confusing intensity.  I&#x27;ve been able to medicate away the intolerable symptoms, and it was never so severe as to be debilitating, but if I had to live like that day-in and day-out I would end my life quickly.</p><p>Until I experienced the emotionless emotions&#x2F;feelings I couldn&#x27;t have imagined it.  We take for granted that our brain functions properly, even depression and other ailments are comprehensible, it&#x27;s the incomprehensible emotions that can&#x27;t be lived through.</p>","points":null,"parent_id":13149089,"story_id":13148725,"children":[]},{"id":13149398,"children":[]}]},{"id":13148862,"children":[]},{"id":13149137,"created_at_i":1481421186,"type":"comment","author":"milesf","text":"<p>Because this is an old post and not someone who is recently deceased, I do not feel what I am about to say is in poor taste.</p><p>I don&#x27;t want to see the idea of the loner computer hacker be idealized any longer. Mr Robot, while a clever and more accurate representation of tech than its predecessors, still leans on the troubled genius trope. My main gripe is how software developers are dehumanized into masochistic agents of hyper productivity. It&#x27;s unhealthy, it&#x27;s exploitive, and it&#x27;s simply not true.</p><p>Silicon Valley loves stories like Phil Katz because it gives them a pass to treat up-and-coming coders horribly. 90+ hour workweeks, death marches, and insane deadlines not only leads to burnout, it results in poor work.</p><p>Longevity and balance and much more noble pursuits in the tech world. As DHH used to say, put away the Superman cape. We don&#x27;t need heroics, we need sane, well-rested creatives who enjoy their work. If you want real heroes, look at men &amp; women who are in their 70&#x27;s and 80&#x27;s who are still banging out lines of code.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149192,"created_at_i":1481422123,"type":"comment","author":"PaulRobinson","text":"<p>Katz&#x27;s story is perhaps actually an antidote to that: he worked crazy hours much of the time, and ended up dead at 37.</p><p>What&#x27;s interesting for me is that many geeks I&#x27;ve worked with have real issues in some regard, in a way that non-geeks seem to find a way to make entertaining (IT Crowd, Big Bang Theory), or simply think is disturbingly sad (the loner in the basement stereotype).</p><p>The truth is the things that make us great geeks can also make us a little self-destructive, and we should probably as a community talk about that some more.</p><p>Spending your formative years as an outsider and then finding yourself as an adult a highly in-demand insider is potentially damaging. It&#x27;s compounded when - as many of us do - we realise that social anxiety can dissipate with alcohol and use of other drugs.</p><p>We&#x27;ve all watched it. Some of us have done it. We need to be a bit more open about discussing it, I think.</p><p>Thinking about going first and writing a blog this weekend, but man, it&#x27;ll be emotionally raw for me, and possibly cringe-inducing for others...</p>","points":null,"parent_id":13149137,"story_id":13148725,"children":[{"id":13150007,"created_at_i":1481441072,"type":"comment","author":"intransigent","text":"<p>I definitely get the sense that this was a situation where a guy made too much money way too fast. Like almost overnight.</p><p>Reading between the lines, it sounds like he had been pent up, and when an effectively unlimited budget reared its head, it open the floodgates for so many bottled up urges.</p><p>By the time he had graduated to drunk driving convictions, other habits had been so firmly established that he was never going back to his old life.</p><p>It reads like a medical study of addiction models in animals. When granted unlimited push-button access to an addictive stimulus they push the button compulsively, without stopping and kill themselves from sheer lack of self control.</p><p>And about that writing of the tell-all cringe blog. I&#x27;d reconsider if I were you. Definitely do some writing. Write on paper. Not on a computer. Not on the internet. Lock it away, and then proof read it when you&#x27;re in the best possible mood, and try to imagine how it would change your mood to realize others had read it, and cringed over it.</p>","points":null,"parent_id":13149192,"story_id":13148725,"children":[]},{"id":13149295,"created_at_i":1481424150,"type":"comment","author":"sundvor","text":"<p>A lot of us are probably undiagnosed as being on the spectrum. At any rate, alcohol is one of the things that make managing interpersonal relationships easier - and for someone with ASD it can actually be a big benefit socially. It doesn&#x27;t take a genius to see that there&#x27;s a big down side potentially waiting to happen too.</p>","points":null,"parent_id":13149192,"story_id":13148725,"children":[]}]},{"id":13149193,"created_at_i":1481422137,"type":"comment","author":"the_cat_kittles","text":"<p>strongly agree. i think we should replace the trope with that of a master craftsmen. sure they work long hours, but i think what stands out is their wisdom, dedication, pacing, far-sightedness, and mastery. i think the best engineers i know resemble the best craftsmen, rather than indulgent narcissistic fanatics.</p>","points":null,"parent_id":13149137,"story_id":13148725,"children":[]},{"id":13149233,"children":[]}]},{"id":13149146,"children":[{"id":13149317,"created_at_i":1481424530,"type":"comment","author":"duskwuff","text":"<p>What are you even trying to claim is &quot;total bs&quot; here?</p>","points":null,"parent_id":13149146,"story_id":13148725,"children":[]}]},{"id":13149402,"created_at_i":1481426159,"type":"comment","author":"jdeibele","text":"<p>The article kind of glosses over the battle with System Enhancement Associates.   As a sysop (long time since I used that word), ARC was extremely popular.   Then PKarc came out and it generated files that were more compact but kept the extension .ARC.   SEA&#x27;s product couldn&#x27;t unpack those.   So their product got the reputation as the one that didn&#x27;t work.</p><p>The lawsuit was extremely unpopular given that they were both shareware products and the older, more established company was suing the company with a better product.</p><p>It wasn&#x27;t clear now or then what else SEA could have done.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149579,"created_at_i":1481430104,"type":"comment","author":"msandford","text":"<p>Couldn&#x27;t they have just made him an offer too good to refuse to buy PKarc?  I haven&#x27;t read up on the background so perhaps they already tried this.  But it seems like that&#x27;s the &quot;big company&quot; playbook.  At least if you&#x27;re substantially bigger than your competitor.</p>","points":null,"parent_id":13149402,"story_id":13148725,"children":[{"id":13149740,"created_at_i":1481433922,"type":"comment","author":"jdeibele","text":"<p>There are some programmers on Hacker News who probably are paid more than I&#x27;m guessing both companies combined made.   As I remember it (could be wrong now), SEA was two programmers and PKWare was Phil Katz (and his mom).</p><p>&quot;The leaked agreement document revealed that under the settlement terms, the defendants had paid the plaintiff $22,500 for past royalty payments and $40,000 for expense reimbursements.&quot;</p><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Phil_Katz\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Phil_Katz</a></p>","points":null,"parent_id":13149579,"story_id":13148725,"children":[{"id":13151292,"created_at_i":1481468074,"type":"comment","author":"mysterypie","text":"<p>I was about to say the same thing. For all the hard work, risks, stress, and high drama involved, we&#x27;re talking about fairly trivial amounts of money for both parties.</p><p>To put it in perspective, the royalty payment that constitutes the settlement is less than what the most people pay for a new car or the average cost of a wedding in the U.S.</p><p>Given the leaked documents about the settlement (per Wikipedia) and knowing what most people pay for shareware (which is zero), I doubt the article&#x27;s claim that Katz had a &quot;multimillion-dollar company&quot;. This makes his struggles and story even sadder.</p>","points":null,"parent_id":13149740,"story_id":13148725,"children":[]}]},{"id":13149758,"created_at_i":1481434457,"type":"comment","author":"rockdoe","text":"<p>Despite the name it was actually the smaller company. The relevant articles and info are linked from Wikipedia and make for interesting reading.</p><p>When Katz died people asked the ARC people what they thought about him:\n<a href=\"http:&#x2F;&#x2F;www.esva.net&#x2F;~thom&#x2F;philkatz.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.esva.net&#x2F;~thom&#x2F;philkatz.html</a></p>","points":null,"parent_id":13149579,"story_id":13148725,"children":[{"id":13149793,"created_at_i":1481435312,"type":"comment","author":"photogrammetry","text":"<p>From your link:</p><p>&gt;So now Phil Katz is dead. He drank himself to death, alone in a motel room, a bottle of booze in his hand and five empties in the room. One can only guess what drove him to such a tragic end, but it is a fitting demise for a man whose professional reputation is based entirely on a lie.</p><p>What a heartless asshole.</p>","points":null,"parent_id":13149758,"story_id":13148725,"children":[{"id":13149868,"created_at_i":1481437389,"type":"comment","author":"chipotle_coyote","text":"<p>I am old enough to have actually been involved with FidoNet when all of this was going down, and at the time Katz pretty much had the community believing that he was a little guy being unfairly squashed by the huge corporate behemoth of System Enhancement Associates for making a better version of their software. Pretty much every single bit of that turned out, indeed, to be a lie. Katz <i>did</i> steal SEA&#x27;s work and claimed otherwise, and SEA was smaller than PKWare.</p><p>I get where you&#x27;re coming from, but Katz basically stole Henderson&#x27;s work, lied about it, and destroyed Henderson&#x27;s business and, for many years, his reputation. I don&#x27;t think I can really blame him for not having been terribly diplomatic about the man&#x27;s death.</p>","points":null,"parent_id":13149793,"story_id":13148725,"children":[{"id":13150501,"created_at_i":1481452916,"type":"comment","author":"supersan","text":"<p>This 8 year old comment on reddit[1] sheds more light on the controversy from a person who knew him I guess.</p><p>[1] <a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;programming&#x2F;comments&#x2F;74x5e&#x2F;phil_katz_author_of_pkzip&#x2F;c05orfa&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;programming&#x2F;comments&#x2F;74x5e&#x2F;phil_kat...</a></p>","points":null,"parent_id":13149868,"story_id":13148725,"children":[{"id":13150727,"created_at_i":1481458151,"type":"comment","author":"agumonkey","text":"<p>The whole thing hurts because things got twisted for no reasons. Both tiny business. Birth of networks. Katz did not only rename and sell, based on the reddit comment it had value. It&#x27;s just that social perception and hubris turned into a sour sauce. If Katz and Henderson&#x27;s companies managed to collaborate instead of going into battle .. I can easily see immensely better ending for both parties.</p>","points":null,"parent_id":13150501,"story_id":13148725,"children":[]}]}]},{"id":13150661,"created_at_i":1481456730,"type":"comment","author":"jnbiche","text":"<p>&gt; What a heartless asshole.</p><p>Agreed.  Most of us have either experienced ourselves or seen someone suffer from an illness or condition we wouldn&#x27;t &quot;wish on our worst enemy&quot;.</p><p>Most of us.</p>","points":null,"parent_id":13149793,"story_id":13148725,"children":[]},{"id":13150691,"created_at_i":1481457296,"type":"comment","author":"DonHopkins","text":"<p>You forgot to quote the harshest part:</p><p>&gt;I can think of no more fitting epitath than the final clause of the original ARC copyright statement:</p><p>&gt;&quot;If you fail to abide by the terms of this license, then your conscience will haunt you for the rest of your life.&quot;</p>","points":null,"parent_id":13149793,"story_id":13148725,"children":[]}]}]}]}]},{"id":13149662,"created_at_i":1481432421,"type":"comment","author":"wallflower","text":"<p>&gt; But even as\nWindows-based &quot;zip&quot; products nibbled into PKWare&#x27;s sales</p><p>Anyone remember Niko Mak? I heard whisper numbers back in the late 90s of high six figure monthly licensing revenue from companies that were desperate to remain BSA legal (their employees downloaded WinZip for personal use and exposed businesses to legal liability for using unlicensed software). He seems to have disappeared, as he rightly deserves. I assume he changed his name and lives on a private island. I still get WinZip marketing spam on my old email account. Last I remember, they were at version 67...</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13149416,"created_at_i":1481426426,"type":"comment","author":"labrador","text":"<p>I&#x27;m not knocking anyone that talks about emotional pain as a reason to drink, but I want to offer an alternative theory alcoholism based on my experience. Many if not most people have settled on the theory of escape from a painful existence as an explanation, including many alcoholics. I&#x27;ve been battling alcohol since I was a teenager and now I&#x27;m almost 60. I&#x27;ve been in and out of rehab, lots of therapy and psychiatry, lots of sober time, a family with grown kids, a successful career and yet my most recent relapse almost killed me. More on that at the end.</p><p>Alcoholism is beyond thought and emotion. It operates at another level. It takes Kings and Queens. It takes happy family men, while often skipping abused children who grow up to be unhappy adults that can&#x27;t hold a family together. It takes spiritual and religious leaders such as Alan Watts. The list of great, productive and seemingly happy people who are destroyed by alcohol is a long one.\nMy theory is that is a genetic glitch that allows alcohol to get hooked into the autonomic nervous system. It&#x27;s telling in &quot;Leaving Las Vegas&quot; a woman tells Cage&#x27;s character to quit drinking and he replies &quot;why don&#x27;t you tell me to stop breathing?&quot; Carl Sagan liked to talk about our reptilian brain. That&#x27;s the way I look at it. When the lizard brain wants a drink, it&#x27;s going to get a drink. Luckily for me, it&#x27;s not all the time. The urge comes and goes (sometimes for years.) The gene seems to run in families. If it is cured, my bet it will be through genetic therapy.</p><p>I&#x27;m not saying that resolving emotional issues doesn&#x27;t make it easier to stay sober. Many things make it easier to stay sober. Sometimes I just go somewhere where I can&#x27;t get it. That helps. It&#x27;s why a lot of guys stay in the Navy. They have productive sober time at sea. Finding other activities and diversions certainly help. I like to program. I&#x27;ve often stayed sober by programming.</p><p>My last relapse almost killed me because I&#x27;m finding as I have become older, my ability to fight it is greatly weakened. On top of that, I go into a trance-like state where I stay I will stay drunk for days and weeks at a time unless someone who knows me intervenes. That is terrible on the body and as the body weakens, the ability to resist weakens. The downward spiral can be quick and brutal.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[{"id":13149699,"created_at_i":1481433044,"type":"comment","author":"Mtinie","text":"<p>You aren&#x27;t alone. Should you ever want to chat&#x2F;commiserate&#x2F;pair program, you can contact me through my HN account.</p><p>I don&#x27;t have it all, though I have a lot, but I still find myself continuously drawn to a side that defies my own logic. I both glad and saddened to hear that I&#x27;m not alone.</p>","points":null,"parent_id":13149416,"story_id":13148725,"children":[{"id":13152420,"created_at_i":1481481938,"type":"comment","author":"labrador","text":"<p>Thanks. You are not alone. I meet people like me in AA and get coffee with them. I don&#x27;t go now because I don&#x27;t believe the program as designed actually works, at least for me. I also wasn&#x27;t making connections at my favorite meeting. I may try another.</p>","points":null,"parent_id":13149699,"story_id":13148725,"children":[{"id":13158033,"created_at_i":1481551196,"type":"comment","author":"zafka","text":"<p>If you would like, contact me via my email. I think we have some issues in common.</p>","points":null,"parent_id":13152420,"story_id":13148725,"children":[]}]}]},{"id":13149766,"created_at_i":1481434568,"type":"comment","author":"WalterBright","text":"<p>A good friend of mine drank heavily through his twenties. Then, he just stopped, and rarely had a drink since (decades). I asked him how he stopped, and he said he just lost interest in it.</p><p>This also lends credence to the idea that it is genetic.</p>","points":null,"parent_id":13149416,"story_id":13148725,"children":[{"id":13149882,"created_at_i":1481437872,"type":"comment","author":"Trundle","text":"<p>Sorry, how does it lend credence to the genetic theory? Ones genes don&#x27;t change do they? But the need for escapism can.</p>","points":null,"parent_id":13149766,"story_id":13148725,"children":[{"id":13149923,"created_at_i":1481438762,"type":"comment","author":"echlebek","text":"<p>If said friend wasn&#x27;t genetically predisposed to alcoholism, it would explain why they would be able to quit drinking to excess with relative ease.</p>","points":null,"parent_id":13149882,"story_id":13148725,"children":[{"id":13150119,"created_at_i":1481443908,"type":"comment","author":"coldtea","text":"<p>This goes against Occam&#x27;s razor, needing 2 different mechanisms, one for people that manage to quit drinking (even after 5 decades of alcoholism) and one (genetic) for others that died alcoholics.</p>","points":null,"parent_id":13149923,"story_id":13148725,"children":[{"id":13152519,"created_at_i":1481482950,"type":"comment","author":"labrador","text":"<p>One reason I don&#x27;t go to AA is that these days it is full of people who aren&#x27;t real alcoholics. I can tell by listening to their stories. I imagine the same dichotomy for depressives. There&#x27;s people who get really sad and filled with grief, usually about some event, and then there&#x27;s real depressives who get devastated and blanked out for no apparent reason. They don&#x27;t feel anything.</p>","points":null,"parent_id":13150119,"story_id":13148725,"children":[]},{"id":13150624,"created_at_i":1481456041,"type":"comment","author":"jnbiche","text":"<p>Well, specialists have long hypothesized that there is a huge difference between &quot;heavy drinkers&quot; (usually in their teens&#x2F;20s and who quit) and &quot;alcoholics&quot;.  Heavy drinkers usually overimbibe as part of their social circle (fraternities, etc.) whereas budding alcoholics are the ones drinking alone at home in their teens&#x2F;20s.</p>","points":null,"parent_id":13150119,"story_id":13148725,"children":[{"id":13152429,"created_at_i":1481482016,"type":"comment","author":"labrador","text":"<p>There is definitely a certain class of heavy drinker that isn&#x27;t a real alcoholic. Some people just like the effect, but get tired of it.</p>","points":null,"parent_id":13150624,"story_id":13148725,"children":[{"id":13155316,"created_at_i":1481513864,"type":"comment","author":"pmoriarty","text":"<p>While it&#x27;s sometimes nice to have a label, I&#x27;m not sure how productive it is if people disagree about its definition.</p><p>I think it&#x27;s more productive to ask if alcohol is having a serious negative effect on your life or others.  If so, you&#x27;ve got a serious problem.</p><p>If you&#x27;ve tried to deal with the problem on your own and failed, then you need help.</p>","points":null,"parent_id":13152429,"story_id":13148725,"children":[]}]}]},{"id":13150158,"created_at_i":1481445008,"type":"comment","author":"55555","text":"<p>I suspect that in the case of &quot;what underlies alcoholism&quot; a simpler explanation is likely to be less complete than a less simple one. There are probably dozens of different reasons people get hooked or are able to quit.</p>","points":null,"parent_id":13150119,"story_id":13148725,"children":[]}]},{"id":13149935,"children":[]}]}]}]},{"id":13152132,"created_at_i":1481478628,"type":"comment","author":"JamesBarney","text":"<p>One way it hijacks the mind is through opiate receptors.  I&#x27;ve heard good things about the Sinclair method(taking an opiate-blocker before having a drink), and it operates by blocking a lot of the euphoric aspects of alcohol.  And slowly it causes the hooks that alcohol has sunk into the brain to whither and die.  Or at least that&#x27;s the theory.</p>","points":null,"parent_id":13149416,"story_id":13148725,"children":[{"id":13152497,"created_at_i":1481482645,"type":"comment","author":"labrador","text":"<p>I tried it but it didn&#x27;t do much. I&#x27;ve actually found Kratom, which also works on those receptors, to be a good alternative. You can&#x27;t overdose on Kratom and when I use it I don&#x27;t ever get the urge to drink.</p>","points":null,"parent_id":13152132,"story_id":13148725,"children":[{"id":13152755,"created_at_i":1481485575,"type":"comment","author":"groovy2shoes","text":"<p>So many benefits to that plant, and yet the various state governments have been in a hurry to criminalize it.  What a shame that so many people who had been struggling with addiction and finally found an affordable, legal, and ostensibly safe relief in kratom, only to have it taken away without legislators giving it any real consideration.</p>","points":null,"parent_id":13152497,"story_id":13148725,"children":[{"id":13153443,"created_at_i":1481492260,"type":"comment","author":"labrador","text":"<p>The DEA changed it&#x27;s mind after public outcry. I&#x27;m buying it again at the local herb shop. (I live in CA.) Yes, it a great help for some.</p>","points":null,"parent_id":13152755,"story_id":13148725,"children":[{"id":13155298,"created_at_i":1481513680,"type":"comment","author":"groovy2shoes","text":"<p>Oh!  That&#x27;s great news!  :)</p>","points":null,"parent_id":13153443,"story_id":13148725,"children":[]}]}]}]}]}]},{"id":13149436,"created_at_i":1481426820,"type":"comment","author":"burger_moon","text":"<p>Wow this is the first time I&#x27;ve heard this story or heard of Phil Katz. I grew up in Milwaukee and went to UWM as well so the familiarities about hearing about someone like Phil is pretty incredible and sad.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]},{"id":13148927,"created_at_i":1481417466,"type":"comment","author":"estrabd","text":"<p>Always a good cautionary tail.</p>","points":null,"parent_id":13148725,"story_id":13148725,"children":[]}]},{"id":13147890,"created_at_i":1481403582,"type":"story","author":"gozzoo","title":"Fast Fourier transform in x86 assembly","url":"https://www.nayuki.io/page/fast-fourier-transform-in-x86-assembly","text":null,"points":157,"children":[{"id":13149955,"created_at_i":1481439743,"type":"comment","author":"nayuki","text":"<p>Author here. I am embarrassed and surprised to find this article on the front page of HN. I think it isn&#x27;t well-written, and I never intended it to appeal to a wide audience.</p><p>The only fact this article really proves is that I can write an x86 AVX implementation of FFT, such that it has reasonable performance and reasonably readable code.</p><p>I threw together the C code quickly - the portable version is basically the result of &quot;what if I implement FFT in a relatively naive way?&quot;, and the AVX model version is the result of &quot;what if I simulate the computation order and memory access pattern of the AVX code in pure C?&quot;. You wouldn&#x27;t be wrong to say that I created strawmen C code as comparisons to the AVX code.</p><p>I view the article as a non-thorough wrapper around a proof-of-concept AVX code. I failed on a lot of fronts - comparing performance against well-known high-performance libraries like FFTW, explaining why I designed my AVX code the way it is, elaborating on the memory access patterns, et cetera. For these I apologize to the reader who had their hopes up.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13150469,"created_at_i":1481452202,"type":"comment","author":"nkurz","text":"<p>No need to be embarrassed.  I think it&#x27;s useful article, both as a pedagogical &quot;proof of concept&quot; and as a way of evaluating the ability of current compilers to vectorize code.   I used a shell script to compile your code with a variety of compilers (gcc-4.8, gcc-4.9, gcc-5, gcc-6, icc-16, icc-17, and clang-4.0) each with a variety of compilation options (-O0, -O1, -O2, -O3, -Ofast, -march=native, -flto&#x2F;-ipo) to see how they fared on a recent Intel Skylake machine.  Across all combinations, I got results that mostly matched what you found.</p><p>Some takeaways (highly influenced by my own opinions):</p><p>Avoid -O0 for production code.  It no longer means &quot;without optimization&quot;, and should be understood as &quot;put everything on the stack for easy debugging&quot;.</p><p>The difference between -O1, -O2, -O3, and -Ofast can be large, but in this case the spread was small (about 10%).  Higher numbers usually mean faster performance, but not always.  If it really matters, measure.  If you have to guess, use -Ofast (which for GCC is approximately -O3 plus -ffast-math).</p><p>The flag that makes the biggest positive difference here is &quot;-march=native&quot;, which tells the compiler it can use all the instructions supported by the machine you are compiling on. If you are running the software yourself rather than distributing it to others, this should probably be your default.  If you don&#x27;t specify it (or another architecture baseline) your code will run on much older machines, but at the cost of missing many of the vectorization improvements made over the last decade.</p><p>Link time optimization (-flto for gcc and clang) or interprocedural optimization (-ipo in icc) lets the compiler optimize across compilation units rather than only within them.  Approximately, it makes everything a candidate for inlining, thus giving many more opportunities for optimization.  It doesn&#x27;t make a big difference here (since almost all the work is done in one function) but you should likely be using it more than you are.</p><p>Overall, the &quot;portable&quot; version is slower than the &quot;model&quot;, which in turn is slower than the &quot;assembly&quot;.  One read of this is that we don&#x27;t yet have a &quot;sufficiently clever compiler&quot;:  the &quot;naive&quot; C version is slower than the &quot;explicitly vectorizable&quot; one, and both are beaten by &quot;naive assembly&quot;.  This is definitely interesting, and often true, and counters the refrain of &quot;don&#x27;t bother trying to beat the compiler&quot;, but I think it&#x27;s worth digging deeper and asking why the simplistic assembly is faster than the complicated compiler.</p><p>I think the main reason here is that the C code is not sufficiently precise, and doesn&#x27;t actually reflect the programmer&#x27;s intent.  The compiler fails to vectorize because the code as written isn&#x27;t safe to vectorize: legally, there could be &quot;aliasing&quot; between the different arrays.  The assembly is written to take advantage of the absence of aliasing, but the compiler wasn&#x27;t given enough information to do this.</p><p>Some of this information can be provided by a liberal sprinkling of &quot;restrict&quot; keywords: &quot;void fft_transform(const void * tables, double * restrict real, double * restrict imag)&quot;.  But I don&#x27;t think it&#x27;s fair to put the blame on the programmer for skipping these.  Rather than being safe and assuming that the arrays for &quot;real&quot; and &quot;imag&quot; might overlap, in this case it would clearly be more helpful for the compiler to ask the programmer for more guidance rather than silently giving up.</p><p>Intel&#x27;s been doing a fairly good job of giving icc (and icpc) the ability to explain why loops cannot be vectorized.  &quot;-qopt-report&quot; and &quot;-guide-vec&quot; give useful hints about what to be changed to allow vectorization.   But it still requires significant expertise to figure out what the hints mean, which pragmas to add, and whether it&#x27;s safe to add them.</p><p>In this case, the hand written assembly is faster not because the compiler is generating bad code, but because it incorporates the programmer&#x27;s silent assumptions.  It would be nice if compilers were able to give better feedback to the programmer, as a means of making these assumptions (or their absence) more explicit.  Do gcc and clang have options to provide this guidance?  Are there outside tools that can?</p><p>compilation script: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;ff4f6a495428c5c0eaffb3521ad8439b\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;ff4f6a495428c5c0eaffb3521ad843...</a></p><p>portable results: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;a44d57538d4530362951beb1ea2c4cad\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;a44d57538d4530362951beb1ea2c4c...</a></p><p>model results: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;2f362185b7fd42889b8bb533ced5f7d5\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;2f362185b7fd42889b8bb533ced5f7...</a></p><p>assembly results: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;6e797e8b635931d2a0e4f32af6a12d1a\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;nkurz&#x2F;6e797e8b635931d2a0e4f32af6a12d...</a></p>","points":null,"parent_id":13149955,"story_id":13147890,"children":[{"id":13152077,"created_at_i":1481477912,"type":"comment","author":"p1esk","text":"<p>Thanks! Can you point to some guides on C code optimization?</p>","points":null,"parent_id":13150469,"story_id":13147890,"children":[{"id":13154272,"created_at_i":1481499853,"type":"comment","author":"nkurz","text":"<p>There&#x27;s a lot of information out there, but what&#x27;s most useful depends on your goals and current level of knowledge.</p><p>If you haven&#x27;t read them yet, Agner Fog&#x27;s guides are an excellent place to start: <a href=\"http:&#x2F;&#x2F;agner.org&#x2F;optimize&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;agner.org&#x2F;optimize&#x2F;</a>.</p><p>Intel&#x27;s Software Development Manuals are enormous, but contain a lot of great information: <a href=\"https:&#x2F;&#x2F;software.intel.com&#x2F;en-us&#x2F;articles&#x2F;intel-sdm\" rel=\"nofollow\">https:&#x2F;&#x2F;software.intel.com&#x2F;en-us&#x2F;articles&#x2F;intel-sdm</a>.</p><p>Their &quot;Software Optimization Reference Manual&quot; might be the best place to jump in: <a href=\"https:&#x2F;&#x2F;software.intel.com&#x2F;sites&#x2F;default&#x2F;files&#x2F;managed&#x2F;9e&#x2F;bc&#x2F;64-ia-32-architectures-optimization-manual.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;software.intel.com&#x2F;sites&#x2F;default&#x2F;files&#x2F;managed&#x2F;9e&#x2F;bc...</a>.</p>","points":null,"parent_id":13152077,"story_id":13147890,"children":[{"id":13162745,"created_at_i":1481582794,"type":"comment","author":"p1esk","text":"<p>Wow, great resources!</p><p>Do you have any suggestions about learning parallelization techniques? Like which one is better: MPI, OpenMP, Cilk, pthreads?</p><p>My field is machine learning, and I&#x27;ve been using high level libraries until now, but I&#x27;d like to learn how to write something in C that does not suck in terms of speed.</p>","points":null,"parent_id":13154272,"story_id":13147890,"children":[{"id":13163576,"created_at_i":1481590490,"type":"comment","author":"nkurz","text":"<p>I&#x27;m less knowledgeable about parallelization, so wouldn&#x27;t want to make a recommendation.    But I&#x27;ve used each of those a little bit, and would gently suggest that OpenMP might be a good starting point for exploration.  I was impressed by how easy it was to incorporate, and the performance seemed good to the extent that I used it.</p><p>My naive first impressions were that MPI was clunky, required expertise to get good results, and should be reserved for when you need to run on multiple machines; Cilk was slick, had a nice syntax, but as of two years ago was still for early adopters; and OpenMP was a happy medium of syntax, support, and performance, making it a good default if you were trying to utilize multiple cores and processors on a single machine.</p><p>pthreads is the underlying thread implementation used on Linux, and the others are higher level interfaces that run on top of this.  You should understand the basics of how pthreads works for intuition on how the others will perform, but unless you need something out-of-the-ordinary you probably shouldn&#x27;t implement anything with it directly.</p>","points":null,"parent_id":13162745,"story_id":13147890,"children":[{"id":13163799,"created_at_i":1481593366,"type":"comment","author":"p1esk","text":"<p>Thanks! I&#x27;ll try OpenMP then.</p><p>One more question if you don&#x27;t mind: I played with AVX a little bit yesterday, and tried to speed up matrix multiplication in my C code for a simple neural network. Specifically, I transposed the second matrix so both matrices have the same second dimension, and therefore I could do row&#x2F;row dot product instead of row&#x2F;column dot product. This change in itself gained me about 15% improvement, I&#x27;m guessing because it&#x27;s more cache friendly. But I mainly did this so I can use AVX mul_ps intrinsic for the dot product. Then, to sum up the resulting array, I used horizontal add intrinsic in a recursive manner. I compiled this code with -mavx2 flag for my Broadwell Xeon CPU. \nThe code is here: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;michaelklachko&#x2F;NN&#x2F;blob&#x2F;master&#x2F;avx_dot_standalone.c\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;michaelklachko&#x2F;NN&#x2F;blob&#x2F;master&#x2F;avx_dot_sta...</a></p><p>Unfortunately, the code actually got slightly slower! If I take the original code and compile it with clang-3.9 and -Ofast and -march=native (just like you suggested in your earlier comment), it becomes about 10 times faster. So I wonder, when compiling with these flags, does clang actually use those AVX instructions that I tried to do manually? When you say &quot;compiler does vectorization&quot;, what do you mean exactly?</p><p>I&#x27;m also not clear what&#x27;s the difference between aligned and unaligned AVX load&#x2F;store instructions, in terms of performance.</p>","points":null,"parent_id":13163576,"story_id":13147890,"children":[{"id":13164854,"created_at_i":1481609011,"type":"comment","author":"nkurz","text":"<p>I took a quick look at your code on Skylake.  Looks reasonable, although your recursive approach to horizontal summation probably isn&#x27;t what you want.  Rather than writing and re-reading you probably want to &quot;accumulate&quot; the sums into two YMM registers, then add these, then horizontal sum once.  Not all instructions have the same cost, and horizontal addition is more costly than addition or multiplication.</p><p>Look at Agner&#x27;s instruction tables for Broadwell for details: <a href=\"http:&#x2F;&#x2F;agner.org&#x2F;optimize&#x2F;instruction_tables.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;agner.org&#x2F;optimize&#x2F;instruction_tables.pdf</a>.  It&#x27;s initially hard to figure out what the columns mean, but worth the effort.  Going further, you can probably use the &quot;FMA&quot; (Fused Multiply Add) instructions, which are essentially designed for dot products.  You can do two of these per cycle,  each of which does a multiplication and addition of a YMM vector.</p><p><i>I compiled this code with -mavx2 flag for my Broadwell Xeon CPU.</i></p><p>I can&#x27;t remember the details of -march for Clang, but I recall that there is some oddity with older versions that -march=native on Broadwell requires -mavx2 in addition.  But to get the correct instruction set, I think it needs both flags.  In most cases (always for icc and gcc), -march=native is all you need.</p><p><i>when compiling with these flags, does clang actually use those AVX instructions that I tried to do manually</i></p><p>Yes, exactly that.  Modern optimizing compilers look at the code you&#x27;ve written, and (when asked politely and all the stars aline) rewrite it to do something equivalent using the vector instructions.   In many cases, you can get the same performance with simple scalar code as with vector intrinsics if the compiler cooperates, but it can be tricky to write the scalar code in a manner that the compiler is willing to vectorize.</p><p>It&#x27;s easy and worthwhile to look at the assembly generated by the compiler.  It&#x27;s difficult to understand at first, but it&#x27;s a great way to learn, and you should be doing it for any loop where the performance really matters.  Figure out &quot;objdump -d&quot; use &quot;perf record &#x2F; perf report&quot;, or compile to assembly with -S.  Take a look at the fast compiler generated code to see what it&#x27;s doing, then figure out if you can make it faster.</p><p><i>I&#x27;m also not clear what&#x27;s the difference between aligned and unaligned AVX load&#x2F;store instructions, in terms of performance.</i></p><p>A deep morass, but worth looking into.  Agner covers it pretty well.  On current x64, there is essentially no difference in speed between the aligned and unaligned instructions when using aligned data.  The aligned instructions crash when they encounter unaligned data, and the unaligned instructions continue but might be slowed down.</p><p>My general rule for modern Intel processors would be to try very hard to align your data if you can, but always use the unaligned instructions if they exist. Unaligned stores are typically much worse than unaligned reads.  But apart from unaligned stores that cross 4KB boundaries, vector instructions are usually still a win if your algorithm allows them.</p>","points":null,"parent_id":13163799,"story_id":13147890,"children":[{"id":13190134,"created_at_i":1481849113,"type":"comment","author":"p1esk","text":"<p>Nate, first of all, thank you for your detailed responses. I really appreciate it!</p><p>Second, your suggestion to use fma instruction for dot product is great - the code is both simpler and much faster. I wasted some time trying to run the code on my work computer, where it compiled fine, however exited without any output. Turned out that CPU is Ivy Bridge and doesn&#x27;t support AVX2. So it seems that compiling with -mfma will convince the compiler to use non-existing instructions, regardless of the architecture.</p><p>I&#x27;m now wondering if I should upgrade GCC on my Ubuntu box - the default was 4.8, which I upgraded to 4.9, however, the latest is 6.2. Is there a reason they keep it so old?</p><p>Anyway, Agner guide to optimization is pretty interesting, lots of stuff to learn. My naive original code when compiled with Ofast and march=native is still faster than my AVX code compiled without any optimizations, but hopefully one day that will be able to beat it!</p>","points":null,"parent_id":13164854,"story_id":13147890,"children":[]}]}]}]}]}]}]},{"id":13151070,"created_at_i":1481464551,"type":"comment","author":"user5994461","text":"<p>IMO. The article shows two things.</p><p>1) The author is much better at writing ASM code than at writing C code and optimizing it for performances.</p><p>2) Even people who read blogs, write blogs and try pretty hard are still struggling with advanced optimizations. Guess that&#x27;s why I could make a living out of that and why there are so few of us.</p>","points":null,"parent_id":13150469,"story_id":13147890,"children":[]}]},{"id":13150995,"created_at_i":1481463487,"type":"comment","author":"user5994461","text":"<p>Indeed. The code is a disappointment.</p><p>The various AVX.c versions don&#x27;t use any AVX instructions. That is deceptive.</p>","points":null,"parent_id":13149955,"story_id":13147890,"children":[{"id":13151644,"created_at_i":1481472803,"type":"comment","author":"nayuki","text":"<p>Sorry about that naming confusion. As the description says:</p><p>fft-x8664-avx.s: FFT core implementation for x86-64 AVX</p><p>fft-x8664-avx-aux.c: Auxiliary FFT functions for x86-64 AVX</p><p>fft-model-of-x8664-avx.c: C code illustrating how the x86-64 AVX code works</p>","points":null,"parent_id":13150995,"story_id":13147890,"children":[{"id":13152287,"created_at_i":1481480500,"type":"comment","author":"user5994461","text":"<p>I understood what the programs are.</p><p>I am complaining that you don&#x27;t have a C program using the AVX instructions (in C).</p><p>All the AVX functions are directly accessible from C (see: intrinsics). For a valid comparison, I would expect a C program using AVX instructions against an assembly program using AVX.</p><p>Your comparison has C-without-AVX against ASM-with-AVX. Of course, it&#x27;s faster with AVX ;)</p>","points":null,"parent_id":13151644,"story_id":13147890,"children":[]}]}]}]},{"id":13149188,"children":[]},{"id":13148181,"created_at_i":1481407287,"type":"comment","author":"mpreda","text":"<p>The GIMPS (Mersenne numbers search) project has a really extremely fast AVX2 assembler implementation of double FFT <a href=\"http:&#x2F;&#x2F;www.mersenne.org&#x2F;download&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mersenne.org&#x2F;download&#x2F;</a> .</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148496,"created_at_i":1481411942,"type":"comment","author":"adito","text":"<p>So, what it&#x27;s licensed under? Can I use it in other project? From quick glance, it seems that they have their own license.</p>","points":null,"parent_id":13148181,"story_id":13147890,"children":[{"id":13148611,"created_at_i":1481413085,"type":"comment","author":"mwfunk","text":"<p>The terms and conditions are right here, you can evaluate it for yourself (you are the only person who knows if it suits your needs or not): <a href=\"http:&#x2F;&#x2F;www.mersenne.org&#x2F;legal&#x2F;#TCU\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mersenne.org&#x2F;legal&#x2F;#TCU</a></p>","points":null,"parent_id":13148496,"story_id":13147890,"children":[]}]}]},{"id":13148438,"created_at_i":1481411274,"type":"comment","author":"tsomctl","text":"<p>How does it compare to the two giants, FFTW and Intel IPP? (<a href=\"http:&#x2F;&#x2F;www.fftw.org&#x2F;speed&#x2F;CoreDuo-3.0GHz-icc64&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fftw.org&#x2F;speed&#x2F;CoreDuo-3.0GHz-icc64&#x2F;</a>). In particular, I don&#x27;t see any mention of cache awareness. I don&#x27;t know much about FFTW, but all the parts of Intel IPP that I&#x27;ve used are ridiculously fast, and I&#x27;m sure Intel is using all the tricks they can to speed up the cache (ie proper layout, cache prefetch). For example, Intel&#x27;s fft forward transform on complex floats is about as fast as memcpy with a cold cache.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148710,"created_at_i":1481414336,"type":"comment","author":"dsharlet","text":"<p>It&#x27;s not going to compare well. The assembly is a pretty simple port of a basic C implementation of radix 2 Cooley-Tukey FFTs. The author gets ~2x speedup from writing this in assembly.</p><p>In contrast, highly optimized FFT implementations that use higher radix transforms and other FFT algorithm optimizations, along with SIMD and good C (not necessarily assembly) will get speedups of 10-40x over basic C implementations with a radix 2 implementation: <a href=\"http:&#x2F;&#x2F;citeseerx.ist.psu.edu&#x2F;viewdoc&#x2F;download?doi=10.1.1.153.6089&amp;rep=rep1&amp;type=pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;citeseerx.ist.psu.edu&#x2F;viewdoc&#x2F;download?doi=10.1.1.153...</a> (Implementing FFTs in practice by Frigo and Johnson, of FFTW)</p><p>FWIW, it <i>is</i> possible to significantly beat FFTW, if you highly optimize for particular cases: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;halide&#x2F;Halide&#x2F;pull&#x2F;977\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;halide&#x2F;Halide&#x2F;pull&#x2F;977</a>. I don&#x27;t have data handy, but I&#x27;ve seen similar results comparing against IPP.</p>","points":null,"parent_id":13148438,"story_id":13147890,"children":[]},{"id":13148736,"created_at_i":1481414784,"type":"comment","author":"gsteinb88","text":"<p>FFTW is one of the seminal examples of the importance of cache awareness, if I remember my history correctly. As I understand it, the reason the fftw authors (Matteo Frigo and Steven G. Johnson) won the Wilkinson prize was essentially because fftw exemplified the importance of cache-aware algorithms, as opposed to blindly optimizing number of operations.</p><p>I don&#x27;t know, but I would guess that intel&#x27;s implementation post-dates fftw?</p>","points":null,"parent_id":13148438,"story_id":13147890,"children":[]},{"id":13148744,"created_at_i":1481414939,"type":"comment","author":"alfalfasprout","text":"<p>Probably a massive difference. The generic X86 IPP implementation of 1 dimensional FFT is around 8x faster than the naive FFT variants I&#x27;ve tried. Intel also claims an effective 5.5x improvement over that when targeting AVX2 (so Haswell and later). Essentially, a 40x is not unusual.</p><p>When it comes to insanely optimized code, most of Intel&#x27;s libraries (MKL, VSL, IPP, DAAL) are hard to beat.</p>","points":null,"parent_id":13148438,"story_id":13147890,"children":[]}]},{"id":13149984,"created_at_i":1481440468,"type":"comment","author":"Too","text":"<p>The real and imag-pointers should be marked with &quot;restrict&quot;-keyword to enable aliasing optimizations. This goes for all other pointers also. And as others have already said, leaving optimzation at -O1 and not targeting your architecture (-march) can also have big impact.</p><p><pre><code>    real[j + halfsize] = real[j] - tpre;\n    imag[j + halfsize] = imag[j] - tpim;        &#x2F;&#x2F; 1. Reading imag[j]\n    real[j] += tpre;                            &#x2F;&#x2F; 2. Writing real[j], which could be same data as imag[j]\n    imag[j] += tpim;                            &#x2F;&#x2F; 3. Must re-read imag[j] even though we read it in #1, because real[j] might alias it</code></pre></p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[]},{"id":13149002,"created_at_i":1481418698,"type":"comment","author":"babbage12","text":"<p>I love finding blogs like this that I did not know about before. Thanks HN! If anybody knows any other cool blogs in the same vein, please tell me!</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[]},{"id":13148788,"created_at_i":1481415403,"type":"comment","author":"ziikutv","text":"<p>Great work, just finished a course in DSP too!</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[]},{"id":13148297,"created_at_i":1481409083,"type":"comment","author":"rjtobin","text":"<p>Here are some performances with higher optimization parameters and with the Intel C Compiler.  All run with a Haswell Xeon (E5-2698 v3).  Using icc, for the larger problem sizes you get performance speedup that very similar to the speedup from the hard-coded asm.</p><p>With same arguments as blog post:</p><p>gcc -O1 -o fft-test fft-test.c fft-portable.c -lm:</p><p>...</p><p><pre><code>   262144    min=15721397  mean=15748901  sd=0.12%\n   524288    min=34474976  mean=34546878  sd=0.18%\n  1048576    min=99814826  mean=100391926  sd=0.26%</code></pre>\n...</p><p>Adding -march=native and -O2:</p><p>...</p><p><pre><code>   262144    min=14668178  mean=14701671  sd=0.14%\n   524288    min=31297081  mean=31395468  sd=0.14%\n  1048576    min=94027867  mean=94196746  sd=0.13%</code></pre>\n...</p><p>With Intel C Compiler (-O2 -xHost):</p><p>...</p><p><pre><code>   262144    min=14258167  mean=14297606  sd=0.16%\n   524288    min=31126755  mean=31212153  sd=0.23%\n  1048576    min=92893600  mean=93491419  sd=0.46%</code></pre>\n...</p><p>Can provide more numbers if people want them.  EDIT: looks like I was using the less optimized C code, will re-run with the better performing C code when I get the chance.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148459,"created_at_i":1481411518,"type":"comment","author":"inlineint","text":"<p>Did you try GCC with -O3 and -ffast-math? It seems like ICC has its analogue to ffast-math enabled by default: <a href=\"http:&#x2F;&#x2F;scicomp.stackexchange.com&#x2F;questions&#x2F;20815&#x2F;performance-of-icc-main-cpp-g-ffast-math-main-cpp\" rel=\"nofollow\">http:&#x2F;&#x2F;scicomp.stackexchange.com&#x2F;questions&#x2F;20815&#x2F;performance...</a></p>","points":null,"parent_id":13148297,"story_id":13147890,"children":[{"id":13148589,"created_at_i":1481412786,"type":"comment","author":"conistonwater","text":"<p>Good point. GCC has a whole bunch of options here: <a href=\"https:&#x2F;&#x2F;gcc.gnu.org&#x2F;wiki&#x2F;FloatingPointMath\" rel=\"nofollow\">https:&#x2F;&#x2F;gcc.gnu.org&#x2F;wiki&#x2F;FloatingPointMath</a>, and icc&#x27;s default setting is some, possibly unknown, combination of them.</p>","points":null,"parent_id":13148459,"story_id":13147890,"children":[]}]},{"id":13149070,"created_at_i":1481419842,"type":"comment","author":"simcop2387","text":"<p>I just started a run with the better C code from a sibling commentor.  I&#x27;ve also got it doing -ffast-math, and each of the -O1,2,3.  I&#x27;ll post the raw data up to <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;simcop2387&#x2F;32c8fb863403ee714227afe0ee3dd637\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;simcop2387&#x2F;32c8fb863403ee714227afe0e...</a></p>","points":null,"parent_id":13148297,"story_id":13147890,"children":[]}]},{"id":13148044,"created_at_i":1481405577,"type":"comment","author":"llukas","text":"<p>Any comparison to fftw or mkl?</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148083,"created_at_i":1481405932,"type":"comment","author":"etrain","text":"<p>I would also be interested in seeing this.</p>","points":null,"parent_id":13148044,"story_id":13147890,"children":[]},{"id":13148120,"created_at_i":1481406341,"type":"comment","author":"nitrogen","text":"<p>Also kissfft numbers would be interesting for comparison.  Even though it&#x27;s slower, it has a very easy license to work with.</p>","points":null,"parent_id":13148044,"story_id":13147890,"children":[]}]},{"id":13148842,"created_at_i":1481416126,"type":"comment","author":"throwaway_26758","text":"<p>I always cringe when developers compare compiler-optimized C to &#x27;hand rolled&#x27; assembly. In the dawning age of SAT-based program synthesis and vectorization-aware superoptimizers, it&#x27;s extremely anachronistic. It only shows a lack of awareness that in reality your job as a programmer is not to give instructions to a machine, but to provide enough help that a machine can create its own instructions better than you can.</p><p>For example, let&#x27;s take one critical function here: bit reversal. The C code provided (renamed variables so it&#x27;s easy to consistently compare) has an impressive speedup just going from -O1 to higher optimization levels. And then, on top of that speedup with a decent optimizer, we can again halve the amount of time spent in this function by providing better intentions to the compiler which allow it to perform automatic vectorization. Note this is all in standard C, and makes the code simpler to understand (and maintain) by humans as well.</p><p><pre><code>    uint64_t reverse_slow(uint64_t n, uint64_t k)\n    {\n            uint64_t r, i;\n            for (r = 0, i = 0; i &lt; k; ++i, n &gt;&gt;= 1)\n                    r = (r &lt;&lt; 1) | (n &amp; 1);\n            return r;\n    }\n\n    uint64_t reverse_fast(const uint64_t n, const uint64_t k)\n    {\n            uint64_t r, i;\n            for (r = 0, i = 0; i &lt; k; ++i)\n                    r |= ((n &gt;&gt; i) &amp; 1) &lt;&lt; (k - i - 1);\n            return r;\n    }\n</code></pre>\nLesson: do your job as a human and provide guidance, let the machines do their job at taking your advice and running wild with creativity. It helps you both become more effective.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13149226,"created_at_i":1481422794,"type":"comment","author":"Veedrac","text":"<p>&gt; It only shows a lack of awareness that in reality your job as a programmer is not to give instructions to a machine, but to provide enough help that a machine can create its own instructions better than you can.</p><p>If you are in the position where you need to care about fast code, this is extremely naïve advice. Even in your example, it&#x27;s plainly obvious that something simple but specialized like</p><p><pre><code>    uint64_t reverse_actually_fast(uint64_t n, const uint64_t k) {\n        n = bswap_64(n);\n        n = (n &amp; 0xF0F0F0F0F0F0F0F0) &gt;&gt; 4 | (n &amp; 0x0F0F0F0F0F0F0F0F) &lt;&lt; 4;\n        n = (n &amp; 0xCCCCCCCCCCCCCCCC) &gt;&gt; 2 | (n &amp; 0x3333333333333333) &lt;&lt; 2;\n        n = (n &amp; 0xAAAAAAAAAAAAAAAA) &gt;&gt; 1 | (n &amp; 0x5555555555555555) &lt;&lt; 1;\n        return n &gt;&gt; (64 - k);\n    }\n</code></pre>\nis going to knock the socks off a &quot;plain C&quot; version.</p>","points":null,"parent_id":13148842,"story_id":13147890,"children":[{"id":13149281,"created_at_i":1481423873,"type":"comment","author":"throwaway_26758","text":"<p>I was going for a low-hanging fruit example without resorting to bit-twiddling which might confuse many readers, but since you insist I&#x27;ll repeat my point that going for plain C is great. And that compilers, if properly guided, can optimize better than humans. Following code generates essentially the same code as the GCC builtin intrinsic.</p><p><pre><code>  uint64_t reverse_actually_fast_c(const uint64_t n, const uint64_t k) {\n          uint64_t r = 0;\n          r = ((n &amp; 0xFF00000000000000) &gt;&gt; 56) |\n              ((n &amp; 0x00FF000000000000) &gt;&gt; 40) |\n              ((n &amp; 0x0000FF0000000000) &gt;&gt; 24) |\n              ((n &amp; 0x000000FF00000000) &gt;&gt;  8) |\n              ((n &amp; 0x00000000FF000000) &lt;&lt;  8) |\n              ((n &amp; 0x0000000000FF0000) &lt;&lt; 24) |\n              ((n &amp; 0x000000000000FF00) &lt;&lt; 40) |\n              ((n &amp; 0x00000000000000FF) &lt;&lt; 56);\n          r = (r &amp; 0xF0F0F0F0F0F0F0F0) &gt;&gt; 4 | (r &amp; 0x0F0F0F0F0F0F0F0F) &lt;&lt; 4;\n          r = (r &amp; 0xCCCCCCCCCCCCCCCC) &gt;&gt; 2 | (r &amp; 0x3333333333333333) &lt;&lt; 2;\n          r = (r &amp; 0xAAAAAAAAAAAAAAAA) &gt;&gt; 1 | (r &amp; 0x5555555555555555) &lt;&lt; 1;\n          return r &gt;&gt; (64 - k);\n      }</code></pre></p>","points":null,"parent_id":13149226,"story_id":13147890,"children":[{"id":13149314,"created_at_i":1481424435,"type":"comment","author":"Veedrac","text":"<p>I&#x27;m not arguing against plain C - for example I&#x27;ll always write blsi as `n &amp; -n` because I trust the compiler to recognize that pattern.</p><p>The problem I have is the claim that the compiler knows better than me, or any programmer with even fairly basic knowledge of the underlying hardware. The only reason to write `reverse_actually_fast_c` like that is because you know of the bswap instruction. If there was no bswap instruction on the target you support, this would hardly be the ideal implementation!</p><p>Even if you write it indirectly and verbosely, you&#x27;re still picking out specific assembly instructions. You&#x27;re giving instructions to a machine.</p>","points":null,"parent_id":13149281,"story_id":13147890,"children":[]}]}]},{"id":13149064,"created_at_i":1481419769,"type":"comment","author":"gajjanag","text":"<p>&gt; I always cringe when developers compare compiler-optimized C to &#x27;hand rolled&#x27; assembly. In the dawning age of SAT-based program synthesis and vectorization-aware superoptimizers, it&#x27;s extremely anachronistic. It only shows a lack of awareness that in reality your job as a programmer is not to give instructions to a machine, but to provide enough help that a machine can create its own instructions better than you can.</p><p>I agree with your general point, but note that there are some unfortunate reasons why this can&#x27;t be done in many cases.</p><p>A compiler can only make use of appropriate SIMD instructions if it knows that the target has the appropriate SIMD.\nMost packages&#x2F;shipped binaries are &quot;universal&quot; x86-64 binaries, i.e at compilation time, these instructions can&#x27;t really be used effectively in many cases.\nOf course, in certain cases, one can get around this issue.\nFor example, if one compiles from source, one can pass -march=native or similar such flags.\nAnother example is in game development, where one can freely assume that the target processor has AVX (or whatever it is based on the &quot;min reqs&quot; listed on the game).</p><p>But in the general case, the common solution is to compile in different pieces of code corresponding to the different target CPU levels and do runtime CPU detection.\nVideo coding (e.g FFmpeg) is one illustration of this approach, and to which I don&#x27;t know of any reasonable portable alternatives.</p>","points":null,"parent_id":13148842,"story_id":13147890,"children":[{"id":13149183,"created_at_i":1481422067,"type":"comment","author":"wtallis","text":"<p>GCC has the target_clones function attribute that lets you specify a list of  different architecture variants, and GCC will emit a version of the function compiled for each, and automatically generate the code to pick the right one at runtime. This does hinder portability outside of the GNU binutils&#x2F;glibc world, but is otherwise a pretty clean solution.</p>","points":null,"parent_id":13149064,"story_id":13147890,"children":[{"id":13155499,"created_at_i":1481516301,"type":"comment","author":"gajjanag","text":"<p>Thanks a lot for this pointer.</p><p>I noticed just now that there is another hn discussion on recent developments on this front in GCC: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13153320\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13153320</a>.</p><p>I do wish there was a portable solution though (at least across *nix platforms with clang or gcc).</p>","points":null,"parent_id":13149183,"story_id":13147890,"children":[]}]}]},{"id":13148920,"created_at_i":1481417397,"type":"comment","author":"conistonwater","text":"<p>While what you write has a point, I think it&#x27;s not quite right. I remember stumbling on this HN conversation recently: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9202858\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9202858</a> — the two realistic examples mentioned there are video codecs and language interpreters.</p><p>&gt; <i>In the dawning age of SAT-based program synthesis and vectorization-aware superoptimizers, it&#x27;s extremely anachronistic.</i></p><p>I find this particular argument unconvincing, because those aren&#x27;t real yet. (Consider also that if it was easy and feasible, they probably would have been real already.)\nIn particular, with respect to automatic vectorization (not even superoptimizers!), there is one curious thing that should be noted: clang, with its automatic vectorizer, gives you special options to check if the vectorizer is working for your code (<a href=\"http:&#x2F;&#x2F;llvm.org&#x2F;docs&#x2F;Vectorizers.html#diagnostics\" rel=\"nofollow\">http:&#x2F;&#x2F;llvm.org&#x2F;docs&#x2F;Vectorizers.html#diagnostics</a>). This is necessary: from the point of view of the programmer, performance-sensitive code that is not auto-vectorized is miscompiled because vectorizing it and the consequent performance gain is part of its correctness. One group of examples of this is all the linear algebra libraries.</p><p>&gt; <i>do your job as a human and provide guidance</i></p><p>This advice is only good in the general setting, where it is indeed good advice. The people whose job it is to write all that performance-sensitive code absolutely must get it right, and saying &quot;a compiler will eventually do it for you&quot; is simply not good enough. FWIW, I think you&#x27;re not addressing your argument at the right crowd.</p>","points":null,"parent_id":13148842,"story_id":13147890,"children":[{"id":13149447,"created_at_i":1481427047,"type":"comment","author":"TheOtherHobbes","text":"<p>The problem is you need to know exactly which optimisations are in the compiler, and whether or not your code will trigger those optimisations.</p><p>This is very much not a trivial requirement. If you&#x27;re not desperate to optimise performance you can ignore it. But if you are, you really need to know in detail what your compiler will and won&#x27;t do for you.</p><p>A blanket assumption that it&#x27;s smarter than you <i>will</i> be wrong a significant proportion of the time.</p>","points":null,"parent_id":13148920,"story_id":13147890,"children":[{"id":13151598,"created_at_i":1481472315,"type":"comment","author":"conistonwater","text":"<p>Right! And if you did do that, then the correctness of your code would depend on compiler version (to make sure that the expected optimizations will be triggered), which is one hell of a nontrivial dependency.</p>","points":null,"parent_id":13149447,"story_id":13147890,"children":[]}]},{"id":13149144,"created_at_i":1481421417,"type":"comment","author":"throwaway_26758","text":"<p>&gt; I find this particular argument unconvincing, because those aren&#x27;t real yet.</p><p>While the &#x27;ideal&#x27; of writing any half-attempted but correct specification, then superoptimizing to the absolute minimal instruction count is unfeasible today, I counter that the attitude that these basic technologies are fantasy is the AI effect in play here. Compilers routinely employ techniques that were considered the holy-grail of program synthesis and superoptimization several years ago, but due to the moving target mindset, we&#x27;ve discounted how capable these suites are becoming.</p><p>One of the major issues is actually a PEBCAK: programmers don&#x27;t realize what the standard actually affords.</p><p>What is truly undefined behavior in your code that will give the go-ahead to a compiler to fully work around what you wrote?</p><p>Or how about the way you wrote that loop creates a chain of memory dependencies that artificially constrains how the compiler is able to rearrange memory accesses and vectorize.</p><p>And especially important here is optimization coupled with testing. You wrote your algorithm with while loops and no explicit stopping condition, so even though you could transform the code into a properly bounded for loop and profit, now the optimizer and bounded model checker can&#x27;t unroll your loop in certainty for checking if a different implementation is actually perfectly functionally identical. Now the compiler can&#x27;t actually make the optimizing transforms it wishes it could because you failed at your job. And on top of that, you can&#x27;t refactor while having the machine verify that nothing functionally changed -- a potential regression nightmare.</p><p>I&#x27;m not advocating we forget about how to optimize our code, in fact it&#x27;s quite the opposite. Human programmers need to fully understand what assumptions and guarantees are built into a language in order to be proficient at giving a specification where optimization automation is possible.</p><p>Sticking to standard C presents a rather unchanging simple &#x27;virtual machine&#x27; model (terminology abused there), rather than deal with the constant flux of small hardware architecture changes that chaotically renders your past wisdom obsolete.</p>","points":null,"parent_id":13148920,"story_id":13147890,"children":[]}]}]},{"id":13148079,"created_at_i":1481405894,"type":"comment","author":"kken","text":"<p>&quot;The hand-coded x86-64 AVX code is from 1.0× to 2.4× faster than the best C code (which is the AVX model code). This speedup was not as impressive as hoped.&quot;</p><p>Curious. So assembly optimization does not really help that much with modern CPUs?</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148173,"created_at_i":1481407139,"type":"comment","author":"iammyIP","text":"<p>the usual speedup with sse&#x2F;avx is in about that 2.5 range from what i&#x27;ve observed. If it&#x27;s lower, then there are likely other effects that stall the execution, like cache misses and other data logistic ineffieciency.</p><p>The fft shown here uses a precalced lookup table for sin &amp; cos. For a fft size of 2048 this takes 2 * 8 * 2048 bytes,  around 32 kb, which is the already size of the usual L1 cache. The bigger the fft size the bigger the lookup table and the less all the asm will be effective.</p><p>The asm benefits more of a pure algorithmic approach, might try some sin cos approximation instead of a lookup table, then the speed gain might be more consistent.</p>","points":null,"parent_id":13148079,"story_id":13147890,"children":[]},{"id":13148213,"created_at_i":1481407789,"type":"comment","author":"user5994461","text":"<p>Whatever can be done with assembly can be done the same with C (or C++).</p><p>So strictly speaking, assembly optimization can never help you [compared to not using assembly].</p>","points":null,"parent_id":13148079,"story_id":13147890,"children":[{"id":13148433,"created_at_i":1481411212,"type":"comment","author":"aseipp","text":"<p>Uhhhhhhhhhh, assembly optimizations are absolutely vital in many niches these days, and using it can absolutely help you substantially, over trying to magically contort and &quot;over-fit&quot; the compiler and its optimizations into doing what you want. If you want reasonable speed for some of these domains in C, you have to basically force the compiler to do it, by manually forcing these &quot;assembler optimizations&quot; anyway. Compilers are heuristic and &quot;good enough&quot; for the wide majority of code, they aren&#x27;t perfect at everything.</p><p>You cannot beat the compiler <i>globally</i>, but you can absolutely, with almost 100% certainty, beat it <i>locally</i>. It&#x27;s a matter of if that &quot;local&quot; component is important enough. You can absolutely beat the compiler at its own game in several domains -- for example, cryptographic code. In this realm, efficiency matters a hell-of-a-lot.</p><p>Having implemented things like ChaCha20 before in C -- it&#x27;s very hard to get the C compiler to get anywhere close, by itself, to what a hand-optimized implementation can do. Just look at Ted Krovetz ChaCha20 written in C: it&#x27;s fast, in the 1-cycle-per-byte range (my own implementation being in the ~5cpb range), but the code is absolutely ridiculous, because it has to &quot;work with&quot; the C compiler so much and hold its hand, it has to manually use SIMD intrinsics (which still rely on you knowing about the underlying architecture anyway), manually unroll loops etc, careful exit fast paths, etc. By comparison, doing things like vectorized, multi-byte loads or carefully controlled unrolling is relatively &quot;simple&quot; in native assembly and does not require working against any optimizer. These are the kinds of optimizations that are sometimes far simpler to do at the assembly level. <a href=\"https:&#x2F;&#x2F;github.com&#x2F;floodyberry&#x2F;supercop&#x2F;blob&#x2F;master&#x2F;crypto_stream&#x2F;chacha20&#x2F;krovetz&#x2F;vec128&#x2F;stream.c\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;floodyberry&#x2F;supercop&#x2F;blob&#x2F;master&#x2F;crypto_s...</a></p><p>Ted&#x27;s implementation is 5x faster than mine, but it&#x27;s also substantially more complicated due, in no small part, having to <i>force</i> the compiler to get there (I&#x27;d say it&#x27;s ~2x the code but probably on the order or ~10x more complex, all things considered, when you get down to design details). It&#x27;s not clear to me, honestly, if it wouldn&#x27;t be better to just write the core loop in assembly and call that. It may very well be <i>less complex</i> by some standards. Also, just to head off this suggestion: no, simply converting my naive code to use GCC vectorized types (not SIMD intrinsics, but vector types) didn&#x27;t make up for this difference at all, despite the fact it&#x27;s a fairly perfect case for vectorized code. It made maybe a 10% difference at the end. I need a 500% difference to be in the same ballpark. I&#x27;m not going to get it by crossing my fingers, unfortunately.</p><p>That said, Ted&#x27;s implementation has redeeming qualities, including the fact it can be portable, and it does remove some complexity by e.g. not having to register allocate manually. The compiler can take care of instruction scheduling, too. But it only achieves its speed at the cost of a lot of incidental complexity when dealing with the compiler. A lot of the things it&#x27;s doing are things you have to carefully consider in an assembly optimization, too. You&#x27;re not gaining anything by &quot;Using C because I can express anything&quot;, the main thing you&#x27;re gaining is a slight ease-of-development, because some of the code is portable. You still have to do all the actual hard work yourself.</p><p>At that point, when you&#x27;re doing that much work -- for a lot of cases, you might as well just say &quot;Screw the compiler&quot; and write it manually, and also yield even more gains, such as a library like this: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;floodyberry&#x2F;chacha-opt\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;floodyberry&#x2F;chacha-opt</a> -- the efficiency gains may absolutely trump development time, when you realize these efficiency gains compound on each other (2x work for 5% benefit is a lot more reasonable when you realize that 5% benefit is going to be realized 100, 10,000, or even 10,000,000 times over, consistently, with every single use).</p><p>And in any case, if we want to be pedantic, your assertion is just factually 100% wrong anyway. Here&#x27;s an example: IEEE-compliant floating point division can easily expressed in assembly, on IEEE-compliant platforms. IEEE-compliant floating point division is, in a real sense, <i>impossible to implement in C&#x2F;C++ by the rules of the language standard</i>. Why? Because division by zero is defined in IEEE and not C&#x2F;C++, even if &#x27;float&#x27; and &#x27;double&#x27; in your system are IEEE-compliant. Another example is overshifting a register, which is undefined in C&#x2F;C++ and perfectly defined for several architectures. There are absolutely cases where you can write completely legitimate assembly that is impossible to write in standards-compliant C, if you want to be language-lawyer-y about it.</p>","points":null,"parent_id":13148213,"story_id":13147890,"children":[]},{"id":13149029,"created_at_i":1481419272,"type":"comment","author":"user5994461","text":"<p>Wow. You all misunderstood my message judging by the comments and the downvotes.</p><p>I was talking about hand written C vs hand written ASM. This has no relation to the compiler.</p>","points":null,"parent_id":13148213,"story_id":13147890,"children":[{"id":13149714,"created_at_i":1481433260,"type":"comment","author":"buzzybee","text":"<p>That indicates that you swallowed a piece of dogma at some point and didn&#x27;t think it through.</p><p>The argument of &quot;the compiler can make faster code than any programmer&#x27;s assembly code&quot; - which I think is what you are repeating here - is discussing whether writing an entire application in assembly will give great wins. It doesn&#x27;t do so today because the compilers are much, much better at finding performance wins over a large, sprawling program; it&#x27;s a poor use of coding time to attempt otherwise. It is inner loop code that is the concern of everyone writing low-level optimizations today, and inner loop code is a special beast. It can be attacked by writing C tuned around the compiler&#x27;s optimizer, by writing inline assembly, or by writing a specialized compiler that compiles the optimal code path on demand according to some set of parameters.</p><p>C written for an general-purpose optimizer understands that a certain assembly-code result is wanted, and it understands that the compiler has a limited ability to analyze the code and produce that result. It&#x27;s not the same as any other hand-written C, because it deliberately arranges scenarios that the optimizer can pick up on. It uses just-so orderings of statements that are mathematically transitive but will optimize differently in practice. It sets up usages of undefined behavior that are known to be used by the optimizer. It uses extensions specific to the compiler, if they lead to faster generated code. This is a nasty black art and optimizing falls towards this practice because it still ends up being more convenient than writing the assembly, for a variety of reasons - more fluidity in the larger context of the codebase, a safer fallback if the optimization fails, more portable.</p><p>Inline assembly is a hard break with the rest of the program, but for the most inner of inner loop code, the additional power over the details of execution continues to make a substantial difference.</p><p>Specialized compilation is gradually becoming more practiced for very demanding numeric applications and one can find the occasional paper or tool published about it. It&#x27;s obviously more work than writing a single optimization once, but it has the benefit of being a potentially reusable abstraction.</p>","points":null,"parent_id":13149029,"story_id":13147890,"children":[{"id":13150898,"created_at_i":1481461621,"type":"comment","author":"user5994461","text":"<p>&gt; The argument of &quot;the compiler can make faster code than any programmer&#x27;s assembly code&quot; - which I think is what you are repeating here</p><p>WTF. I have never said that.</p><p>I wasn&#x27;t talking about the code generated by the compiler. I even wrote a message to clarify that I talk about handwritten code, not about code generated by a compiler.</p>","points":null,"parent_id":13149714,"story_id":13147890,"children":[]},{"id":13151206,"created_at_i":1481466807,"type":"comment","author":"bogomipz","text":"<p>&gt;&quot; It is inner loop code that is the concern of everyone writing low-level optimizations today, and inner loop code is a special beast.&quot;</p><p>Can you elaborate? Are you are talking about nested loops and quadratic run times?</p>","points":null,"parent_id":13149714,"story_id":13147890,"children":[]}]},{"id":13149274,"created_at_i":1481423688,"type":"comment","author":"benchaney","text":"<p>This makes no sense at all. How can you talk about c vs assembly performance without considering the compiler?</p>","points":null,"parent_id":13149029,"story_id":13147890,"children":[{"id":13150955,"created_at_i":1481462530,"type":"comment","author":"user5994461","text":"<p>I guess this is the source of all the misunderstanding. What makes you think that the compiler is relevant to performances?</p><p>In extreme case of optimization, it&#x27;s the programmer who does the optimizations with carefully hand written efficient code, not the compiler.</p>","points":null,"parent_id":13149274,"story_id":13147890,"children":[]}]}]},{"id":13148314,"created_at_i":1481409365,"type":"comment","author":"benchaney","text":"<p>This isn&#x27;t true at all, in fact, the opposite is true. Compilers are often better than naive micro optimizations, but they do not always have every optimization programmed for every architecture. An expert can absolutely beat the compiler in some cases.</p>","points":null,"parent_id":13148213,"story_id":13147890,"children":[{"id":13148411,"created_at_i":1481411016,"type":"comment","author":"Veedrac","text":"<p>Although I agree the compiler rarely produces great code <i>automatically</i>, it&#x27;s normally possible to handhold the compiler into producing code roughly equivalent to hand-written ASM. Doing so is rarely easier, but it is at least more portable!</p>","points":null,"parent_id":13148314,"story_id":13147890,"children":[{"id":13149269,"created_at_i":1481423615,"type":"comment","author":"benchaney","text":"<p>Compilers don&#x27;t use all instructions. For example crypto code often require assembly in order to take advantage of AES instructions.</p>","points":null,"parent_id":13148411,"story_id":13147890,"children":[{"id":13149319,"created_at_i":1481424558,"type":"comment","author":"Veedrac","text":"<p>That&#x27;s what intrinsics are for.</p>","points":null,"parent_id":13149269,"story_id":13147890,"children":[{"id":13150976,"created_at_i":1481463130,"type":"comment","author":"user5994461","text":"<p>Given the comments, I would assume that the other commenters don&#x27;t know about intrinsics, or embedding ASM code into C, or &quot;handholding the compiler into producing great code&quot;.</p>","points":null,"parent_id":13149319,"story_id":13147890,"children":[]}]}]}]}]}]},{"id":13148562,"created_at_i":1481412620,"type":"comment","author":"kitsuac","text":"<p>I program assembly as a large part of my daily job, and we generally target between 500% and 1500% speedup for our assembly routines. That number being compared to C code with all compiler optimisations enabled. 1.0x - 2.4x is indeed pretty awful, but it does sometimes happen. For example, many algorithms are fundamentally serial in nature (e.g. entropy decoding).</p>","points":null,"parent_id":13148079,"story_id":13147890,"children":[{"id":13148590,"created_at_i":1481412812,"type":"comment","author":"gregschlom","text":"<p>I&#x27;m curious: what kind of job requires assembly programming nowadays? high frequency trading? game dev? neural networks?</p>","points":null,"parent_id":13148562,"story_id":13147890,"children":[{"id":13148620,"created_at_i":1481413155,"type":"comment","author":"kitsuac","text":"<p>I work with video codecs now, but anything computationally intensive and&#x2F;or close to the hardware will benefit from some assembly code. The three that you mentioned are good examples. The web browser you&#x27;re using to view and respond to this thread is another example. Among other things, the JavaScript engine most likely does dynamic recompilation and it may use sandboxed webviews.</p>","points":null,"parent_id":13148590,"story_id":13147890,"children":[{"id":13151182,"created_at_i":1481466448,"type":"comment","author":"bogomipz","text":"<p>Could you elaborate on how assembly is used in sandboxed webviews?</p>","points":null,"parent_id":13148620,"story_id":13147890,"children":[{"id":13155655,"created_at_i":1481518823,"type":"comment","author":"kitsuac","text":"<p>I&#x27;m not sure to what extent exactly, but iirc they instrument APIs and pass them through IPC. It may not really be the best example, for some reason it popped into my head but maybe it was an incorrect assumption.</p>","points":null,"parent_id":13151182,"story_id":13147890,"children":[]}]}]},{"id":13148657,"created_at_i":1481413557,"type":"comment","author":"aseipp","text":"<p>Cryptography, image&#x2F;video processing, scientific computation (analysis&#x2F;physics etc), game dev&#x2F;graphics, microcontrollers&#x2F;embedded devices, hardware interfaces, compiler&#x2F;language development. There are probably at least a dozen more major areas I&#x27;m forgetting. I&#x27;ve at least used assembly for 3 of those myself (crypto&#x2F;hw interfacing&#x2F;compiler dev).</p><p>It&#x27;s maybe niche, as far as the job market&#x2F;skills go, but when you think about it, a hell of a lot of the stuff on a modern Linux system you might use every day is powered by hand-optimized assembly. If you&#x27;re even visiting this webpage -- the cryptographic stack your browser uses to negotiate TLS, with almost 100% certainty, relies on deep assembly optimization. JavaScript engines are relentlessly optimized at these levels. Any time you visit a page and render an image, systems like libjpeg-turbo are, in no small part, a piece of the puzzle. Using disk encryption or ipsec, too? Assembly in your kernel. It&#x27;s everywhere!</p>","points":null,"parent_id":13148590,"story_id":13147890,"children":[]}]}]}]},{"id":13150164,"created_at_i":1481445152,"type":"comment","author":"dharma1","text":"<p>This is a pretty nice CUDA implementation of sFFT</p><p><a href=\"http:&#x2F;&#x2F;hgpu.org&#x2F;?p=16805\" rel=\"nofollow\">http:&#x2F;&#x2F;hgpu.org&#x2F;?p=16805</a></p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[]},{"id":13148893,"created_at_i":1481416969,"type":"comment","author":"edblarney","text":"<p>Performance?</p><p>Man, I wish someone would release a decent tutorial on how to actually use the FFT in real life.</p><p>There are some decent explanations of FT, but often they fail at the very end of FFT: what the output means, explicitly.</p><p>Particularly, this concern of &#x27;the same freq. appearing in many buckets&#x27; due to issues of the phase of the wave?</p><p>So much theory, so much Matlab ... so little actual applied Engineering. Making &#x27;stuff work&#x27; in the real world is basket of caveats ... looking forward to that article: &#x27;FFT in the wild&#x27; :)</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13149537,"created_at_i":1481429128,"type":"comment","author":"ww520","text":"<p>I was baffled by FFT, too, when I first encountered in math class.  It seemed useless.  It&#x27;s not until I started working with sound that it really dawned on me how it&#x27;s being used.</p><p>I think the best illustrated usage of DFT (FFT is just the fast algorithm of DFT) is the sound equalizer.  Sound comes in.  DFT converts it into the strength over frequency on the equalizer.  You can visually see the strength bars on each frequency slots (from the high, the mid range, to low frequency slots).  This let you adjust the frequency strength in each frequency slot individually.  You can bump up the high frequency slot or depress the mid range slot.  The adjusted frequencies are combined to produce the new distorted sound.</p><p>When a sound comes in straight, you can only adjust its amplitude (volume).  Now with DFT, you can adjust the decomposed frequency components of the sound individually, giving you finer control over the sound&#x27;s pitch and quality.  You can amplify the high frequencies to make it higher pitch.  Or amplify the lower frequencies to give more booming bass.  You can chop off the low frequency completely to remove background noise.  You can chop off both the low and high frequencies to make the sound &quot;clearer.&quot;</p><p>DFT&#x2F;FFT basically let you control the different dimension of the sound (or any time-based sine wave data).</p>","points":null,"parent_id":13148893,"story_id":13147890,"children":[{"id":13149584,"created_at_i":1481430153,"type":"comment","author":"edblarney","text":"<p>That I get.</p><p>But the FFT results show all sorts of harmonics and results that effectively need to be further decomposed.</p><p>It does not produce a the results as you described, in reality.</p><p>Using FFT to decompose someones speech, I&#x27;m getting peaks at 300Hz, 600Hz, 900Hz etc.. My crude understanding is that those are all related to one another, though I can&#x27;t quite fathom why.</p><p>I fully grasp the example you give ... but the actual results are something bewildering altogether ...</p>","points":null,"parent_id":13149537,"story_id":13147890,"children":[{"id":13151004,"created_at_i":1481463632,"type":"comment","author":"qb45","text":"<p>&gt; Using FFT to decompose someones speech, I&#x27;m getting peaks at 300Hz, 600Hz, 900Hz etc.. My crude understanding is that those are all related to one another, though I can&#x27;t quite fathom why.</p><p>This is not a quirk of FT but a result of the way physical things actually vibrate. You get this output from FT because your input consists of 300&#x2F;600&#x2F;900&#x2F;...Hz sinewaves superimposed on each other.</p><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Harmonics\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Harmonics</a></p>","points":null,"parent_id":13149584,"story_id":13147890,"children":[{"id":13152942,"created_at_i":1481487456,"type":"comment","author":"edblarney","text":"<p>There is a person talking - that&#x27;s it.</p><p>The peaks at 600Hz and 900Hz are higher than 300Hz.</p><p>Humans can&#x27;t make speech at 600 and 900Hz, is my understanding.</p><p>Listening to it, I don&#x27;t hear those frequencies. So it&#x27;s hard for me to understand how they are there.</p>","points":null,"parent_id":13151004,"story_id":13147890,"children":[{"id":13154086,"created_at_i":1481498406,"type":"comment","author":"ww520","text":"<p>Where do you get your information about human voice frequency range?  600Hz and 900Hz are certainly within the frequency range of human voice.</p>","points":null,"parent_id":13152942,"story_id":13147890,"children":[{"id":13154734,"created_at_i":1481505254,"type":"comment","author":"nkurz","text":"<p>I would have all these frequencies were in range, but when I search I find several sources suggesting that 600 and 900 Hz are indeed greater than the fundamental frequencies of human voices:</p><p><i>Baby cries have a fundamental frequency (hereafter referred to as Fo) of around 500 Hz (roughly corresponding to the note B4). Child speech ranges from 250-400 Hz (notes B3 to G4, adult females tend to speak at around 200 Hz on average (about G3), and adult males around 125 Hz (or, B2).</i></p><p><a href=\"http:&#x2F;&#x2F;www.ncvs.org&#x2F;ncvs&#x2F;tutorials&#x2F;voiceprod&#x2F;tutorial&#x2F;influence.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ncvs.org&#x2F;ncvs&#x2F;tutorials&#x2F;voiceprod&#x2F;tutorial&#x2F;influe...</a></p><p>My guess at this point would be that while the &quot;fundamental frequencies&quot; are lower for vowels, higher frequencies are still required for the consonants?</p>","points":null,"parent_id":13154086,"story_id":13147890,"children":[{"id":13154918,"created_at_i":1481507488,"type":"comment","author":"ww520","text":"<p>Fundamental frequency is the lower bound of the frequency range.  That&#x27;s the floor.</p>","points":null,"parent_id":13154734,"story_id":13147890,"children":[]},{"id":13155036,"created_at_i":1481509359,"type":"comment","author":"edblarney","text":"<p>900Hz is way out of range for human speech.</p><p>Now - maybe humans create some higher frequencies, but the dominant frequency you speak at is much lower.</p><p>Maybe I can understand some &#x27;peaks&#x27; at higher ranges ... but the &#x27;big peak&#x27; should be at the frequency that is obviously the loudest, which is 100-200Hz. That&#x27;s the range you speak at.</p><p>But I also read that those are in fact the &#x27;same frequencies&#x27; - simply at different phases.</p><p>I also read that without &#x27;windowing&#x27; (apparently an extremely complicated process) you get wierd results.</p><p>I did a test with a &#x27;pure&#x27; 300Hz tone - and I got a nice peak at 300Hz, but some other, rounded peaks at other ranges.</p><p>Anyhow - I don&#x27;t think I&#x27;m doing something wrong - I do think that FFT in the <i>real world</i> definitely has some weird artifacts that require interpretation, and they are non-obvious.</p>","points":null,"parent_id":13154734,"story_id":13147890,"children":[]}]}]}]}]},{"id":13150380,"created_at_i":1481449860,"type":"comment","author":"ww520","text":"<p>I&#x27;m afraid the interpretation of the output of FFT really has to go into some theory and the text book version of it.  Here&#x27;re some good description on the time-domain and frequency-domain of the FFT.  <a href=\"http:&#x2F;&#x2F;www.dspguide.com&#x2F;ch8&#x2F;2.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dspguide.com&#x2F;ch8&#x2F;2.htm</a>, <a href=\"http:&#x2F;&#x2F;www.dspguide.com&#x2F;ch8&#x2F;3.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dspguide.com&#x2F;ch8&#x2F;3.htm</a>.</p><p>As for the output you got, the peaks at 300Hz, 600Hz, 900Hz, etc are the signal strength level at those frequencies of the speech.  A voice is made up of many different frequencies at various strength levels.  Most frequencies of a voice have nearly 0 energy.  Some have more energy, with varying levels of strength.  DFT breaks the voice down and figures out the strength levels for all the frequencies.  The frequency range in human voice is from about 70Hz to 10KHz.  That&#x27;s why you see some strength at 300Hz, 600Hz, and 900Hz.  Instead of just describing a voice as volume over time, DFT decomposes it into an array of frequency strengths, giving you the frequency characteristic of the voice.</p><p>The index into the FFT output array identifies the frequency.  Let&#x27;s say you sample the signal at 10000Hz (10000 samples per second).  And you pass only 1000 samples into FFT.  FFT always spits out an array F with half of the input size, i.e. 500 elements.  Each element represents a frequency fraction with respect to the input size.  So F[0] is at 1&#x2F;1000 fraction, F[1] at 2&#x2F;1000 fraction, etc, upto F[499] at 500&#x2F;1000 fraction.  To convert back to the real frequency, just multiply the fraction to the sampling rate.  F[0] with 1&#x2F;1000 * 10000Hz = at 10Hz.  F[1] with 2&#x2F;1000 * 10000Hz = at 20Hz, F[499] at 500Hz.  The values at F[0], F[1], etc are the signal strength at those frequencies.</p>","points":null,"parent_id":13149584,"story_id":13147890,"children":[]}]}]},{"id":13149619,"created_at_i":1481431135,"type":"comment","author":"nkurz","text":"<p>Here&#x27;s an article from a couple weeks ago that uses FFT as part of a machine learning algorithm to categorize music by genre: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13078165\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13078165</a></p>","points":null,"parent_id":13148893,"story_id":13147890,"children":[]}]},{"id":13148126,"created_at_i":1481406393,"type":"comment","author":"jlebar","text":"<p>&gt; gcc -O1 -o fft-test fft-test.c fft-portable.c -lm</p><p>-O1 instructs the compiler to leave some optimizations on the table.  If you want the fastest code the compiler can generate, you want -O2 or -O3.</p><p>This is true for clang and gcc.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148231,"created_at_i":1481408191,"type":"comment","author":"user5994461","text":"<p>And I believe he should also give flags to target the specific hardware and instruction set that he has.</p><p>In extreme cases, GCC&#x2F;Intel&#x2F;MSVC are able to optimize pure C code with auto-vectorization and SSE&#x2F;AVX instructions, possibly better than hand crafted ASM... but the compiler will never do that if not given the flags to allow it.</p>","points":null,"parent_id":13148126,"story_id":13147890,"children":[{"id":13148487,"created_at_i":1481411861,"type":"comment","author":"astrange","text":"<p>Autovectorization is okay but not that good. Its advantage is just that it can transform any part of the program, when your limited dev time won&#x27;t touch it all. But it can&#x27;t focus on the hot loops or know about cache efficiency etc. even if you use PGO. And it&#x27;s sensitive and unstable wrt code changes which is never good.</p>","points":null,"parent_id":13148231,"story_id":13147890,"children":[{"id":13148663,"created_at_i":1481413657,"type":"comment","author":"aarongolliver","text":"<p>Yeah, and when autovectorization fails it can be really hard to tell why. The diagnostic messages aren&#x27;t the best (or, at least, they weren&#x27;t when I was doing this ~4 years ago)</p><p>EG: ICC has a AVX version of atan2(), which you can use through intrinsics[0]. But it refused to vectorize even the simplest loop with the function call in it. Even with every possible fast-math flag or every #pragma(please vectorize), it wouldn&#x27;t do it. I assume due to reduced precision? Nothing I could find online had the answer (again, 4 years ago)</p><p>[0] <a href=\"https:&#x2F;&#x2F;software.intel.com&#x2F;en-us&#x2F;node&#x2F;524364\" rel=\"nofollow\">https:&#x2F;&#x2F;software.intel.com&#x2F;en-us&#x2F;node&#x2F;524364</a></p>","points":null,"parent_id":13148487,"story_id":13147890,"children":[]}]}]},{"id":13148323,"created_at_i":1481409489,"type":"comment","author":"benchaney","text":"<p>To be honest, this oversight makes the rest of his analysis somewhat suspect.</p>","points":null,"parent_id":13148126,"story_id":13147890,"children":[{"id":13148476,"created_at_i":1481411720,"type":"comment","author":"dagss","text":"<p>I would assume it meant that it made things slower, after all this was a hand-tuned numerical core. Optimizations is for what a human did not already optimize.</p>","points":null,"parent_id":13148323,"story_id":13147890,"children":[{"id":13149260,"created_at_i":1481423470,"type":"comment","author":"benchaney","text":"<p>If by this you mean higher levels of optimization made things slower, than I must disagree. He says &quot;Compiling C code with optimizations enabled is obviously a good idea&quot; he would have mentioned it here if -O2 or -O3 were slower. Also, the optimizer doesn&#x27;t optimize hand written assembly. Only c code.</p><p>What I actually think happened is he didn&#x27;t understand that there were higher optimization levels that -O1, which gives his code an advantage when compared to the c code implementation.</p>","points":null,"parent_id":13148476,"story_id":13147890,"children":[{"id":13150051,"created_at_i":1481442006,"type":"comment","author":"dagss","text":"<p>He compared with baseline C code with -O1? That is really bad.</p>","points":null,"parent_id":13149260,"story_id":13147890,"children":[{"id":13151470,"created_at_i":1481470769,"type":"comment","author":"benchaney","text":"<p>Well, it is hard to actually tell but that is what it looks like.</p>","points":null,"parent_id":13150051,"story_id":13147890,"children":[]}]}]}]}]}]},{"id":13148136,"created_at_i":1481406579,"type":"comment","author":"mathetic","text":"<p>The page doesn&#x27;t mention compiling code with -O2 or -O3. Does anyone know the reason for this? In particular -O3 is meant to enable vectorisation optimisations, which seems like it might subsume the author&#x27;s hand optimisations.</p><p>Also I believe Intel C Compiler is better at optimising numerical code, so results with that would also be illuminating.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148186,"created_at_i":1481407363,"type":"comment","author":"raverbashing","text":"<p>You can enable vectorization manually without going for -O2 or -O3</p>","points":null,"parent_id":13148136,"story_id":13147890,"children":[{"id":13148243,"created_at_i":1481408362,"type":"comment","author":"loeg","text":"<p>It isn&#x27;t clear the author did so, though.</p>","points":null,"parent_id":13148186,"story_id":13147890,"children":[{"id":13148331,"created_at_i":1481409607,"type":"comment","author":"mathetic","text":"<p>Actually, it is clear the author didn&#x27;t because he gives the shell commands that are used to compile.</p>","points":null,"parent_id":13148243,"story_id":13147890,"children":[]}]}]}]},{"id":13148909,"created_at_i":1481417234,"type":"comment","author":"paulsutter","text":"<p>Halide is an interesting direction for generating optimized code. By isolating algorithm from schedule, it is better able to optimize for vectorization, locality, pipelining, threading, tiling, and recomputation vs. storage. It then uses LLVM to do all the ordinary optimization. Example code:</p><p><pre><code>  &#x2F;&#x2F; The algorithm - no storage or order\n  blur_x(x, y) = (input(x-1, y) + input(x, y) + input(x+1, y))&#x2F;3;\n  blur_y(x, y) = (blur_x(x, y-1) + blur_x(x, y) + blur_x(x, y+1))&#x2F;3;\n\n  &#x2F;&#x2F; The schedule - defines order, locality; implies storage\n  blur_y.tile(x, y, xi, yi, 256, 32)\n        .vectorize(xi, 8).parallel(y);\n  blur_x.compute_at(blur_y, x).vectorize(x, 8);\n</code></pre>\nHalide can auto-optimize to create schedules for specific architectures, which can match or exceed performance of C code written by experts. It&#x27;s intended for image processing, and has an unnatural affinity for rectangles, but it&#x27;s an interesting direction for optimization. Darkroom does similar optimization for FPGAs</p><p>Website: <a href=\"http:&#x2F;&#x2F;halide-lang.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;halide-lang.org&#x2F;</a></p><p>Video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3uiEyEKji0M\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3uiEyEKji0M</a></p><p>Paper: <a href=\"http:&#x2F;&#x2F;graphics.cs.cmu.edu&#x2F;projects&#x2F;halidesched&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;graphics.cs.cmu.edu&#x2F;projects&#x2F;halidesched&#x2F;</a></p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[{"id":13148993,"created_at_i":1481418522,"type":"comment","author":"throwaway_26758","text":"<p>Thanks for bringing up specialized optimization tools such as Halide. Recently there&#x27;s been a proliferation of domain-specific languages targeting this automatic optimization-from-intentions paradigm. While it&#x27;s great for testing new ideas isolated from the complexity of modern day compiling suites (academic excursions), actually devoting your codebase to these tools is a huge burden for future maintainability, and eliminates the possibility of future improvements provided outside the small development effort of a single academic group.</p><p>Many of the techniques given here (and elsewhere in the glut of DSLs) are quietly folded into mainstream C compilers within a short timeframe -- first as requiring explicit hints just like the DSLs, then secondly simplified to allow the compiler to automatically <i>infer</i> hints from well-structured code relying on transformation guarantees of standard C idioms.</p><p>So if you stick with strict C and come to understand the implicit assumptions&#x2F;guarantees the standard dictates while conveying structure in your code, in time the compiler suites will march forward in improvements that come with each update &#x27;for free.&#x27;</p><p>And most importantly, update your testing infrastructure to be formally verified each refactoring (such as with CBMC) so that there&#x27;s no regression problems caused by compiler updates with free reign!</p>","points":null,"parent_id":13148909,"story_id":13147890,"children":[{"id":13149121,"created_at_i":1481420827,"type":"comment","author":"paulsutter","text":"<p>Memory access dominates performance issues, and memory access patterns are mostly pre-determined when a C developer chooses data structures. This limits the optimizations a C optimizer can perform.</p><p>Halide gives the optimizer control over a broader set of design decisions. While the image-processing focus limits Halide (I wish it were designed for neural nets and embedded in Tensorflow), the lessons here are powerful and have potential that go beyond C compiler improvements.</p>","points":null,"parent_id":13148993,"story_id":13147890,"children":[{"id":13150179,"created_at_i":1481445435,"type":"comment","author":"dharma1","text":"<p>You could use Halide some neural net uses I guess - like writing convolution kernels?</p><p>Though (I&#x27;m not an expert on the subject) but it seems like  high perf convnet kernels requires assembly for specific architectures - like Scott Gray&#x27;s fast Winograd kernels optimised for NVidia.</p><p>Woukd be awesome if someone wrote fast conv kernels for AMD GPUs but it seems like a lot of effort</p>","points":null,"parent_id":13149121,"story_id":13147890,"children":[]}]}]}]},{"id":13148148,"created_at_i":1481406725,"type":"comment","author":"andrepd","text":"<p>A few questions:</p><p>Is this just vectorization? Because FFT libraries often implement this using either asm or intrinsics.</p><p>Why compile with -O1? Why not let the gcc optimize with -O2 or -O3? In recent versions I believe this enables vectorization attempts which could produce similar speedups to your handwritten asm.</p>","points":null,"parent_id":13147890,"story_id":13147890,"children":[]}]}]
